{"items":[{"title":"Elon Musk initiates another Twitter fight by squabbling with Bernie Sanders over extreme wealth","description":"Elon Musk has a long history of publicizing his opinions on Twitter, On Sunday, he continued this trend by sparring with Sen. Bernie Sanders, I-Vt., over extreme wealth and stocks. In response to a tweet from Sanders demanding that extremely wealthy Americans \"pay their fair sha","author":"TeslaTracker Submissions","url":"https://www.businessinsider.com/elon-musk-bernie-sanders-twitter-extreme-wealth-2021-11","link_type":"article","item_date":1636938087000,"item_id":"26d5cfa1","timestamp":1636939451423,"domain":"businessinsider.com","item_date_formatted":"Nov 15","description_trimmed":"Elon Musk has a long history of publicizing his opinions on Twitter, On Sunday, he continued this trend by sparring with Sen. Bernie Sanders, I-Vt., over extreme wealth and stocks. In response to a tweet from Sanders demanding that extremely wealthy Americans \"pay their fair sha ...","keywords":"Bernie Sanders, Sanders Demanding, Extreme Wealth, Twitter Fight","submitted_by":"derick.realwebdev+teslatracker","is_question":false},{"title":"The Anti-Tesla: Why Toyota Remains Hung Up On Hydrogen","description":"Originally posted on EVANNEX. By Charles Morris Toyota didn’t rise to the pinnacle of the global auto industry by chance. Throughout its history, it’s been an extremely innovative, forward-looking company. Books have been written, and college courses taught, about its engineering","author":"TeslaTracker Submissions","url":"https://cleantechnica.com/2021/11/14/the-anti-tesla-why-toyota-remains-hung-up-on-hydrogen/","link_type":"article","item_date":1636938087000,"item_id":"a0522fa0","timestamp":1636939451523,"domain":"cleantechnica.com","item_date_formatted":"Nov 15","description_trimmed":"Originally posted on EVANNEX. By Charles Morris Toyota didn’t rise to the pinnacle of the global auto industry by chance. Throughout its history, it’s been an extremely innovative, forward-looking company. Books have been written, and college courses taught, about its engineering...","keywords":"Extremely Innovative","submitted_by":"derick.realwebdev+teslatracker","is_question":false},{"title":"The Paragould Arkansas Police Department Adds 2 Tesla Model 3s to Fleet","description":"Photo: TommyR/Reddit\nThe Paragould, Arkansas Police Department will soon receive two Tesla Model 3 electric vehicles that have been approved for purchase by the City Council. The EVs are expected to be delivered in 2022 and help the city save thousands of dollars over traditional ICE vehicles.In September 2021, the Paragould City Council approved the purchase of two Tesla Model 3 vehicles for use in the Police Department fleet. It is estimated that these vehicles will save the city more than $7,400 a year in reduced fuel and maintenance costs. Thus, in just five years, they will bring savings of $37,000, compared to gas police vehicles.The main purpose of the purchase is the desire to reduce costs on fueling the vehicles. Captain Brad Snyder says that projections show a real opportunity, according to KAIT8. “We are expected to see about a 4,000 dollars a year savings in Tesla vs. the normal traditional gas units,” he said.The electric cars will be put through a pilot program where if they do not work as traffic unit vehicles they will be moved to another division. However, the experience of using Tesla vehicles by other police units in the United States has shown that the electric vehicles of the Texas manufacturer do an excellent job of their tasks, having even higher performance than originally expected.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/paragould-police-department-adds-two-tesla-model-3s-to-its-fleet","link_type":"article","item_date":1636726254000,"item_id":"551f69fc","timestamp":1636939451526,"domain":"tesmanian.com","item_date_formatted":"Nov 12","description_trimmed":"Photo: TommyR/Reddit\nThe Paragould, Arkansas Police Department will soon receive two Tesla Model 3 electric vehicles that have been approved for purchase by the City Council. The EVs are expected to be delivered in 2022 and help the city save thousands of dollars over traditional...","keywords":"Tesla Model, Electric Vehicles, Tesla Vehicles, Year Savings"},{"title":"Tesla Announces 30-Day Free Trial of Enhanced Autopilot (EAP) for Customers in China","description":"Photo: Motortrend\nTesla continues to delight its customers and provide them with exclusive gifts. The company announced the launch of a 30-day free trial for the Enhanced Autopilot (EAP) for the Double 11 shopping festival in China.In the best tradition, Tesla pleases its customers again. The company said it provided a 30-day free EAP trial covering Model 3 and Model Y vehicles that were delivered before November 11, 2021, and have not installed EAP and Full Self Driving (FSD) while also meeting some hardware requirements.The service will be launched in cars on November 11 and 12. In order for all customers to be able to use the service for at least 30 days, the end of the trial period is set at midnight on December 13. Owners can confirm the current EAP status and effective date by clicking the “Control-Software” column at the bottom left of the control screen of their vehicle.According to Tesla, EAP is based on the original Autopilot (AP) feature, but with the addition of such features as Navigate on Autopilot (NOA), Auto Lane Change (ALC), Autopark, and Smart Summon. With the help of EAP, vehicles can automatically enter and exit highway ramps or overpass forks, overtake slow-moving vehicles, and automatically change lanes on highways. The feature helps improve the overall safety and convenience of users’ daily travel.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-announces-30-day-eap-free-trial-to-its-customers-in-china","link_type":"article","item_date":1636723673000,"item_id":"71f2e4f0","timestamp":1636939451544,"domain":"tesmanian.com","item_date_formatted":"Nov 12","description_trimmed":"Photo: Motortrend\nTesla continues to delight its customers and provide them with exclusive gifts. The company announced the launch of a 30-day free trial for the Enhanced Autopilot (EAP) for the Double 11 shopping festival in China.In the best tradition, Tesla pleases its custome...","keywords":"Free Trial, Customers Again, Trial Period, Installed Eap"},{"title":"Tesla increases Model Y prices again as new incentives are coming","description":"Tesla has again increased the price of the Model Y in the US (the eighth time this year), and it is coming as new incentives are expected.\n more…\nThe post Tesla increases Model Y prices again as new incentives are coming appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/11/12/tesla-increases-model-y-prices-again-new-incentives-coming/","link_type":"article","item_date":1636717990000,"item_id":"35336b9f","timestamp":1636939451816,"domain":"electrek.co","item_date_formatted":"Nov 12","description_trimmed":"Tesla has again increased the price of the Model Y in the US (the eighth time this year), and it is coming as new incentives are expected.\n more…\nThe post Tesla increases Model Y prices again as new incentives are coming appeared first on Electrek.","keywords":"Coming Tesla"},{"title":"US rental fleets gain cachet as carmakers pursue electric vehicles","description":"Tesla deliveries to Hertz signal change for markets that long absorbed unpopular models","author":"Electric vehicles","url":"https://www.ft.com/content/c20e4f4b-1a6e-4b51-a38c-97783e75a847","link_type":"article","item_date":1636711222000,"item_id":"61f3651d","timestamp":1636939451823,"domain":"ft.com","item_date_formatted":"Nov 12","description_trimmed":"Tesla deliveries to Hertz signal change for markets that long absorbed unpopular models","keywords":""},{"title":"Model 3 now comes with heated steering wheel and rear seats on all trims","description":"submitted by    /u/mrlife_   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qs1p4j/model_3_now_comes_with_heated_steering_wheel_and/","link_type":"article","item_date":1636685670000,"item_id":"f38518df","timestamp":1636939451810,"domain":"reddit.com","item_date_formatted":"Nov 12","description_trimmed":"submitted by    /u/mrlife_   [link]   [comments]","keywords":"Trims Submitted, Rear Seats"},{"title":"Model Y Price Increased, $1k for both trims. Last increase was $1k a week ago","description":"submitted by    /u/chaud   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qs1bee/model_y_price_increased_1k_for_both_trims_last/","link_type":"article","item_date":1636684364000,"item_id":"f067dcaf","timestamp":1636939451812,"domain":"reddit.com","item_date_formatted":"Nov 12","description_trimmed":"submitted by    /u/chaud   [link]   [comments]","keywords":"Price Increased"},{"title":"Hertz Is Educating Its Customers About Tesla &amp; EVs","description":"Hertz is doing for Tesla what many Tesla supporters have been divided about Tesla doing for itself — advertising and giving consumers factual information about EVs in general. I’ve noticed that some in the Tesla community feel that Tesla should have some sort of educational advertising campaign that would dispel the fear, uncertainty, and doubt […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/11/hertz-is-educating-its-customers-about-tesla-evs/","link_type":"article","item_date":1636667883000,"item_id":"17ca8ede","timestamp":1636939451814,"domain":"cleantechnica.com","item_date_formatted":"Nov 11","description_trimmed":"Hertz is doing for Tesla what many Tesla supporters have been divided about Tesla doing for itself — advertising and giving consumers factual information about EVs in general. I’ve noticed that some in the Tesla community feel that Tesla should have some sort of educational adver...","keywords":"Tesla Supporters, Tesla Amp, Evs Hertz"},{"title":"Model S 2021 Airbag Recall?","description":"submitted by    /u/deeebug   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qruop4/model_s_2021_airbag_recall/","link_type":"article","item_date":1636663791000,"item_id":"079c31db","timestamp":1636939451808,"domain":"reddit.com","item_date_formatted":"Nov 11","description_trimmed":"submitted by    /u/deeebug   [link]   [comments]","keywords":"Airbag Recall"},{"title":"Rivian: the next Tesla or over hyped?","description":"A $100bn price tag is steep for an electric-vehicle maker that produced 12 vans this year","author":"Electric vehicles","url":"https://www.ft.com/content/92f65548-099b-4c74-aa38-3183da62f1e8","link_type":"article","item_date":1636657093000,"item_id":"2857bc13","timestamp":1636939451821,"domain":"ft.com","item_date_formatted":"Nov 11","description_trimmed":"A $100bn price tag is steep for an electric-vehicle maker that produced 12 vans this year","keywords":"Price Tag"},{"title":"Tesla displaces Mercedes-Benz as third-most-popular luxury brand in U.S.","description":"Tesla has officially displaced Mercedes-Benz as the third-most-popular luxury automotive brand in the United States, quickly approaching BMW and Lexus, which took first and second place, respectively.\nThe data comes from Automotive News, which reported the story earlier this week. According to the report, Mercedes-Benz accumulated 213,708 vehicle registrations through Q3 2021, a hefty figure for the German automaker which has been battling supply chain bottlenecks and parts shortages through most of the year. However, other automakers are not immune to the issues as well, and a majority of car companies have been battling with semiconductor and other essential parts shortages for the better part of 2021.\nThat did not stop a small-but-mighty car company from Silicon Valley from overtaking German giant Mercedes from the third spot on the list. Tesla handily made its way past Mercedes-Benz with 230,855 registrations, becoming the third-best-selling luxury car brand in the routinely touted U.S. sector where luxury vehicles make up about 5% of the market.\n\n\n\nCredit: Tesla\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTesla is not far off of other high-end brands, as leaders BMW and Lexus held leads over the electric car company but not by many vehicles. BMW reached 259,237 registrations to take first prize, while Japanese Lexus came in second with 245,864 units.\nTesla very well may take over the top spot in the luxury sector by the end of the year. The company’s increasingly active production lines at the Fremont facility where its U.S. cars are built, along with the ongoing construction and imminent arrival of Gigafactory Texas manufacturing lines are both indicative of a scrappy and hungry car company that is preparing for an influx of customer orders for the next several years.\nMany of Tesla’s U.S. vehicles are sold out for 2021, and delivery times are indicating to customers that they may be waiting for several months in 2022 to receive their vehicles. While the new Tesla factory located just outside of Austin is expected to begin production in limited volumes by the end of the year, executives are looking toward 2022. Tesla CFO Zachary Kirkhorn said during the company’s Q3 2021 Earnings Call that “we [Tesla] should not expect for us to deliver cars by the end of 2021 from these factories [Texas and Berlin] even if we do produce them — so homologation, regulatory reasons.”\nHowever, it is not all bad for Tesla, even if Giga Texas does not begin shipping cars to patiently-waiting customers by the end of 2021. With increased production capacity and industry-leading gross margins, Tesla is making money hand over fist while balancing an evergrowing production sheet that continues to show the arrival of the electric revolution is upon the U.S. automotive sector.\nI’d love to hear from you! If you have any comments, concerns, or questions, please email me at joey@teslarati.com. You can also reach me on Twitter @KlenderJoey, or if you have news tips, you can email us at tips@teslarati.com.\nThe post Tesla displaces Mercedes-Benz as third-most-popular luxury brand in U.S. appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-luxury-sector-performance-us-2021-q3-mercedes-benz/","link_type":"article","item_date":1636645568000,"item_id":"2c7b5af5","timestamp":1636939451638,"domain":"teslarati.com","item_date_formatted":"Nov 11","description_trimmed":"Tesla has officially displaced Mercedes-Benz as the third-most-popular luxury automotive brand in the United States, quickly approaching BMW and Lexus, which took first and second place, respectively.\nThe data comes from Automotive News, which reported the story earlier this week...","keywords":"Luxury Brand, Car Company, Car Companies, Vehicle Registrations"},{"title":"BMW’s CEO Takes Another Swipe at Tesla, This Time on Quality","description":"BMW’s CEO Takes Another Swipe at Tesla, This Time on Quality","author":"Hyperdrive - Bloomberg","url":"https://www.bloomberg.com/news/articles/2021-11-10/bmw-ceo-takes-another-swipe-at-tesla-this-time-on-quality?srnd=hyperdrive","link_type":"article","item_date":1636637329000,"item_id":"9de16902","timestamp":1636939451819,"domain":"bloomberg.com","item_date_formatted":"Nov 11","description_trimmed":"BMW’s CEO Takes Another Swipe at Tesla, This Time on Quality","keywords":"Ceo Takes"},{"title":"Rivian Automotive: Wall Street embraces venture capital risk in the public markets","description":"The newly listed electric truckmaker generated perhaps $1m of revenue in its most recent quarter","author":"Electric vehicles","url":"https://www.ft.com/content/f5199c94-ee2a-4a4f-b0d7-a47ca1ebdd5f","link_type":"article","item_date":1636569673000,"item_id":"f6ed3781","timestamp":1636939452230,"domain":"ft.com","item_date_formatted":"Nov 10","description_trimmed":"The newly listed electric truckmaker generated perhaps $1m of revenue in its most recent quarter","keywords":""},{"title":"Tesla outselling Mercedes, wireless charging, Hyundai and Kia hybrids recalled: Today’s Car News","description":"Tesla is climbing up the premium-brand sales ladder with only EVs. Several Kia and Hyundai hybrids are being recalled. And could wireless charging make EVs more enticing? This and more, here at Green Car Reports. A study of consumers at various stages of EV shoppers shows big gains in interest and purchase intent with the idea of wireless charging...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134127_tesla-outselling-mercedes-wireless-charging-hyundai-and-kia-hybrids-recalled-today-s-car-news","link_type":"article","item_date":1636563300000,"item_id":"716f8279","timestamp":1636939452223,"domain":"greencarreports.com","item_date_formatted":"Nov 10","description_trimmed":"Tesla is climbing up the premium-brand sales ladder with only EVs. Several Kia and Hyundai hybrids are being recalled. And could wireless charging make EVs more enticing? This and more, here at Green Car Reports. A study of consumers at various stages of EV shoppers shows big gai...","keywords":"Wireless Charging, Hyundai Hybrids"},{"title":"Rivian $RIVN stock soars 52% in IPO as investors embrace EV sector","description":"UPDATED 1:13 PM EST: Revised IPO opening to 52% from 60%.\nRivian Automotive (NASDAQ: RIVN) is set for its market debut today with an implied valuation of over $93 billion thanks to an over 52% surge in share price from its IPO price of $78 per share.\nThe most recent developments for the Rivian market debut have set the company’s initial share price at $122 per share, which could put the company’s valuation at around $104 billion. This would make Rivian the sixth-most valuable automaker globally, displacing General Motors with a market cap of $85.92 billion. Rivian would be slightly behind Daimler, which holds a valuation of $109.12 billion.\nEarlier this week, Rivian priced its shares for its IPO at between $75 and $78, above its previously expected range. The automaker expected to raise $11.9 billion, making it the second-largest tech IPO of all time, trailing Facebook who raised $16 billion in May 2012.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nRivian’s valuation may be driven by the sentiment trailing its name, which is backed by high-end and well-known investors like Amazon and Ford. During a disclosure earlier this month, Amazon disclosed its 20% ownership position in Rivian, which will produce 100,000 all-electric e-commerce delivery vehicles for the company. The Rivian delivery vans have already been tested in various cities across the United States. The 100,000 deliveries will take place by 2030, with 10,000 units operating by the end of 2022.\nAmazon has a massive stake in Rivian, SEC filing shows\n\nRivian is entering an EV market that is becoming more populated with every quarter. Both existing, legacy automotive companies and new, tech-focused startups are attempting to establish new EVs that will dethrone the undisputed king of the sector, Tesla. Rivian, while delivering around 150 units of its introductory R1T as of November 1, is the first automaker to introduce an all-electric pickup to the market. It will have tough competition to fend off as Ford will roll out the F-150 Lightning in Spring 2022. GMC’s Hummer EV is expected to begin deliveries later this year, and the widely-popular Tesla Cybertruck is set to start production in late 2022.\n150,000 all-electric vehicles are expected to roll off Rivian’s production lines at its manufacturing facility in Normal, Illinois, annually. Along with the R1T and Amazon delivery vans, Rivian is developing the R1S, an all-electric SUV that could begin deliveries as soon as December, the company’s prospectus said. Rivian also stated that it has 9,500 employees, with over 3,400 of them working at the Normal Factory.\nRivian will have an uphill battle for the remainder of 2021, as it said in the October prospectus. Revenue has not been generated due to its process of ramping current vehicle production, which is costly and challenging to scale. Tesla CEO Elon Musk advised Rivian to ramp and solve production at its single Normal, Illinois factory for the time being. However, rumors of a manufacturing expansion known as “Project Terra” have swirled through the sector, with several U.S. states, including Texas, being discussed as a possible landing spot for Rivian’s second production plant.\nDisclosure: Joey Klender is not a RIVN Shareholder.\nI’d love to hear from you! If you have any comments, concerns, or questions, please email me at joey@teslarati.com. You can also reach me on Twitter @KlenderJoey, or if you have news tips, you can email us at tips@teslarati.com.\nThe post Rivian $RIVN stock soars 52% in IPO as investors embrace EV sector appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/rivian-rivn-ipo-soars-60-percent-investors-embrace-ev-sector/","link_type":"article","item_date":1636562308000,"item_id":"c6383880","timestamp":1636939452239,"domain":"teslarati.com","item_date_formatted":"Nov 10","description_trimmed":"UPDATED 1:13 PM EST: Revised IPO opening to 52% from 60%.\nRivian Automotive (NASDAQ: RIVN) is set for its market debut today with an implied valuation of over $93 billion thanks to an over 52% surge in share price from its IPO price of $78 per share.\nThe most recent developments ...","keywords":"All Electric, Begin Deliveries, Stock Soars, Share Price"},{"title":"Tesla is losing US EV market share but gaining luxury share, now outselling Mercedes-Benz","description":"submitted by    /u/CarCooler   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qqxww8/tesla_is_losing_us_ev_market_share_but_gaining/","link_type":"article","item_date":1636560995000,"item_id":"a2320046","timestamp":1636939452131,"domain":"reddit.com","item_date_formatted":"Nov 10","description_trimmed":"submitted by    /u/CarCooler   [link]   [comments]","keywords":""},{"title":"Tesla is losing US EV market share but gaining luxury share, now outselling Mercedes-Benz","description":"Tesla's overall EV market share in the United States—the portion of the EV market that it commands—is shrinking; but its share of the luxury segment is growing, according to research firm Experian. The Silicon Valley automaker's share of the overall U.S. EV market fell from 79.5% through the second quarter of 2020 to 66.3% for the same...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134120_tesla-is-losing-us-ev-market-share-but-gaining-luxury-share-now-outselling-mercedes-benz","link_type":"article","item_date":1636560000000,"item_id":"5fc27692","timestamp":1636939452232,"domain":"greencarreports.com","item_date_formatted":"Nov 10","description_trimmed":"Tesla's overall EV market share in the United States—the portion of the EV market that it commands—is shrinking; but its share of the luxury segment is growing, according to research firm Experian. The Silicon Valley automaker's share of the overall U.S. EV market fell from 79.5%...","keywords":"Ev Market, Luxury Segment"},{"title":"Rivian (RIVN) goes public at $77 billion valuation, aims to reach 1 million EV volume by 2030","description":"Rivian (RIVN) goes public this morning, and after adjusting the price up all week, it now values the company at around $77 billion at the opening.\n more…\nThe post Rivian (RIVN) goes public at $77 billion valuation, aims to reach 1 million EV volume by 2030 appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/11/10/rivian-rivn-goes-public-70-billion-valuation-aims-reach-1-million-ev-volume-2030/","link_type":"article","item_date":1636556938000,"item_id":"8fb154bf","timestamp":1636939452236,"domain":"electrek.co","item_date_formatted":"Nov 10","description_trimmed":"Rivian (RIVN) goes public this morning, and after adjusting the price up all week, it now values the company at around $77 billion at the opening.\n more…\nThe post Rivian (RIVN) goes public at $77 billion valuation, aims to reach 1 million EV volume by 2030 appeared first on Elect...","keywords":"Rivian Rivn, Billion Valuation"},{"title":"Hertz displays Tesla Model 3 fleet at Times Square in an electric show of force","description":"As it started trading on Tuesday on the Nasdaq, car rental giant Hertz brought over some of its Tesla Model 3 units to the Nasdaq MarketSite in Times Square, New York. The initiative was a show of force of sorts, showing that the car rental company is going full throttle in its efforts to embrace sustainable transportation. \n\n\n\nAmong the vehicles brought by Hertz were several white Model 3s and at least one that is wrapped in the company’s colors. And while the company also brought over some of its luxury SUVs to Times Square, it was the Model 3 that evidently took the center stage. This was somewhat symbolic for Hertz, which has made headlines recently with its blockbuster 100,000-unit Tesla order. \n\n\n\n\n\nA few more Model 3s from Hertz’s fleet on display in NYC!  $HTZ $TSLA #Tesla #EV #TimesSquare #Nasdaq pic.twitter.com/aE355yDozU— Tesla New York (@TeslaNY) November 10, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nHertz seems to be keen on emphasizing the idea that it is all-in on electric vehicles. Since announcing its intention to purchase 100,000 Teslas from the American electric car maker, Hertz has gone ahead and featured the Model 3 in several of its advertisements. This was despite Tesla CEO Elon Musk noting on Twitter that the Hertz deal involves no fleet discounts for the car rental company. \n\n\n\nIn a recent appearance at CNBC’s Squawk Box, Hertz Board Member Tom Wagner highlighted that there is no doubt that demand far outstrips Tesla’s supply. He also noted that Hertz has been seeing some interest for electric vehicles among its customers. “There’s no question demand exceeds supply at Tesla, there’s enormous built up demand from us, from consumers in general … It’s really about working to ensure we bring vehicles into the fleet in timeline consistent with what all parties want,” Wagner said. \n\n\n\n\n\nHertz: “There’s no question demand exceeds supply at Tesla, there’s enormous built up demand from us, from consumers in general … It’s really about working to ensure we bring vehicles into the fleet in timeline consistent with what all parties want” $TSLA pic.twitter.com/azD3kM5McG— Tesla New York (@TeslaNY) November 9, 2021\n\n\n\n\n\n\nWhile Hertz may have no binding contract for its massive 100,000 Tesla purchase, the EV maker did benefit from news of the car rental giant’s order. The massive vehicle order helped Tesla stock strengthen its momentum, which ultimately pushed Tesla well into a valuation of over $1 trillion. Hertz also seems to be looking at a long-term relationship with Tesla. The company noted that its order could increase to about 150,000 (or even more) vehicles if the electric cars prove popular enough among its customers. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up.\nThe post Hertz displays Tesla Model 3 fleet at Times Square in an electric show of force appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-model-3-show-of-force-hertz/","link_type":"article","item_date":1636553464000,"item_id":"055d620c","timestamp":1636939452109,"domain":"teslarati.com","item_date_formatted":"Nov 10","description_trimmed":"As it started trading on Tuesday on the Nasdaq, car rental giant Hertz brought over some of its Tesla Model 3 units to the Nasdaq MarketSite in Times Square, New York. The initiative was a show of force of sorts, showing that the car rental company is going full throttle in its e...","keywords":"Times Square, Electric Show, York Teslany, Timeline Consistent"},{"title":"Tesla's $25k Car Model Could Come in Near Future, Says Company's VP in China","description":"Image: @Alwinart/Twitter\nThousands of people are awaiting the unveiling of Tesla's new car model, which the company says should cost around $25,000. The market launch of an affordable electric car from Tesla will determine the further development of the global automotive market, as many people will prefer an environmentally friendly EV rather than an ICE car that pollutes the environment with exhaust gases. The company's VP in China expects the market launch of a new affordable Tesla model already in the near future.During the 4th China International Import Expo, Tesla China VP Grace Tao said that in the near future, the market will be able to see cars independently designed and manufactured by the Chinese team on the country's roads, according to The Paper. The fact that Tesla’s executive in China began to speak openly about this may indicate that the company is not far from completing the project.\n\n\"I hope that in the near future, not only will Chinese-made models reach nearly 100% localized productivity, but we may also be able to witness models completely independently designed and manufactured by the Chinese team driving on Chinese roads. Next, we will continue to strengthen our technical cooperation with domestic industry chain partners and will increase the localization rate of the supply chain, and at the same time promote the integration of Tesla and China's local economy to achieve common development.\"\n\nIn early 2021, before the start of the Giga Shanghai expansion, Tesla received approval for an environmental impact report from the Lingang Area Development and Construction Management Committee. The project will carry out tests related to the launch of a new model and research work at the existing plant, including testing of important equipment and manufacturing processes. According to the document, the testing cycle is about six months for verification, and coordination of parts and functions, etc.In early January 2021, Tesmanian reported that in September 2020, according to rumors, Tesla had already developed a new car model, and would soon be ready to start production at its Giga Shanghai. The affordable compact car was expected to be produced and delivered in 2022. If we combine the known facts and some rumors, then Tao's statement confirms the guesses, and the market may indeed soon get an affordable electric car from Tesla.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/teslas-25k-car-model-could-come-in-the-near-future-says-the-companys-vp-in-china","link_type":"article","item_date":1636549221000,"item_id":"6d8f2845","timestamp":1636939451917,"domain":"tesmanian.com","item_date_formatted":"Nov 10","description_trimmed":"Image: @Alwinart/Twitter\nThousands of people are awaiting the unveiling of Tesla's new car model, which the company says should cost around $25,000. The market launch of an affordable electric car from Tesla will determine the further development of the global automotive market, ...","keywords":"Car Model, Market Launch, Company's Vp, Ice Car"},{"title":"Tesla Model S Plaid Sets a New 1/4 Mile Record at Under 9 Seconds","description":"Photo: Tom Tharp/Twitter\nTesla Model S Plaid is a unique vehicle that has no equal on the market right now, and probably won't anytime soon. Although it is a four-door electric vehicle capable of seating up to 7 people, Model S Plaid is also the first production car ever to hit 60 mph in less than 2 seconds and sprint a 1/4 mile in just 8.994 seconds, setting a new world record.In mid-May, Tesla Model S Plaid had set a new 1/4 mile speed record for any production vehicle in the world. The record of 9.247 seconds with a trap speed of 152.16mph was set on May 11, 2021, at the Autoclub Famoso Raceway in Bakersfield. Jay Leno, who was there at the time, confirmed that the Model S Plaid set a new 1/4 mile record of 9.247 seconds.However, this is not the limit of what this electric horse can produce and a new 1/4 mile time record was recently set. Tom Tharp/Twitter shared the news that his friend's family was able to set a new record. According to the post, his friend George and his wife Christine ran the 1/4 mile in their Tesla Model S Plaid in less than 9 seconds. A photo of the recorded run time showed that the distance was covered in 8.994 seconds. According to the video shared by Tom, the trap speed was 155mph.\n\nCongratulations to my friend George and his wife Christine! They ran the first 8 second 1/4 mile in their Tesla Plaid Model S! pic.twitter.com/xjTJD6jQra\n— Tom Tharp (@tomtharp) November 8, 2021\n\n\nAlthough there is no description of how the Model S Plaid was modified, the photo shows that it was lightened by removing the seats. Other details of the modifications remain unknown.What is clear at this point is that the Tesla Model S Plaid has already broken the 9.4 second 1/4 mile record set by the $3.3 million Bugatti Chiron Sport. Thus, the family electric car, which costs 27 times (!!!) less than the Bugatti Chiron Sport, is the fastest production car in the world.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-model-s-plaid-drive-1-4-mile-in-under-9-seconds-a-new-world-record","link_type":"article","item_date":1636491532000,"item_id":"d1bd0585","timestamp":1636939451911,"domain":"tesmanian.com","item_date_formatted":"Nov 9","description_trimmed":"Photo: Tom Tharp/Twitter\nTesla Model S Plaid is a unique vehicle that has no equal on the market right now, and probably won't anytime soon. Although it is a four-door electric vehicle capable of seating up to 7 people, Model S Plaid is also the first production car ever to hit 6...","keywords":"Tesla Model, Mile Record, Friend George, Trap Speed"},{"title":"Rivian IPO: What you need to know","description":"Rivian Automotive Inc. is expected to price its initial public offering (IPO) later today, November 9, 2021. Morgan Stanley, Goldman Sachs, and J.P. Morgan currently stand as Rivian’s underwriters for the company’s debut. And based on filings with the Securities and Exchange Commission (SEC), Rivian is looking to enter the public markets in a big way — and it is setting its ambitions very high. \n\n\n\nTarget Valuation\n\n\n\nRivian has disclosed that it is targeting a valuation above $65 billion in its IPO, with shares priced between $72 and $74. Such a valuation is ambitious, as it would make Rivian’s market cap just a bit lower than veterans such as General Motors ($84.82 billion) and Ford Motor Company ($79.65 billion), the latter being a key investor in the truck maker. Similar to fellow electric vehicle maker Tesla, which currently reached a market cap above of over $1 trillion, Rivian’s valuation target is founded on the idea that the company may see a meteoric rise in the coming years. \n\n\n\n(Credit: Rivian)\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nIf Rivian’s shares end up selling at the top of their marketed range, the company could make history as the seventh-biggest US IPO on record, according to Bloomberg. It would also overtake longtime players in the auto segment, such as Japanese carmakers Honda Motor Co., which has a market cap of $53 billion, and French automaker Renault SA, which is valued at a conservative $11 billion. \n\n\n\nThe Finances So Far\n\n\n\nRivian’s S-1 filing with the SEC has provided a glimpse of the company’s finances so far. Just as expected, and similar to fellow electric vehicle makers that are just starting out, Rivian is currently burning cash, with heavy investments in R&amp;D and high operating costs. This is likely due to the fact that the company is still learning the ropes when it comes to mass-producing its three vehicle offerings, one of which has an order for 100,000 units from Amazon, the world’s premier e-commerce site. \n\n\n\nRivian currently employs over 8,000 people across multiple facilities in Arizona, California, Michigan, Illinois, Vancouver, Canada, and the UK. And as the company approached the production of the R1T pickup truck and R1S SUV, its losses grew. Rivian posted a net loss of $994 million from January to June 2021, more than double the $377 million net loss it posted for the first half of 2020. Rivian’s R&amp;D expenses are also on the rise, with the company spending $683 million in Q1 and Q2 2021. In comparison, its R&amp;D cost for 2020 stood at $766 million. Despite this, Rivian still has about $3.6 billion in cash on its balance sheet. \n\n\n\n(Credit: Rivian Stories)\n\n\n\nWhat Analysts are Saying\n\n\n\nRivian is quite unique among EV startups today because its already has a sure customer in Amazon, which has ordered 100,000 units of an all-electric delivery van. That being said, New Street Research analyst Pierre Ferragu stated in a note on Monday that Rivian may end up facing a “natural ceiling” of 300,000 to 400,000 units per year, partly due to the price range of its consumer vehicles, the R1T pickup truck and the R1S SUV. The R1T currently starts at $67,500 for its base model, while the R1S starts at $70,000. \n\n\n\n“Above $70,000, the global addressable market for Rivian’s SUV and pickup is less than 1.5 million units, and it will be a crowded space,” Ferragu wrote. \n\n\n\nIvan Drury, a senior analyst at Edmunds, highlighted that Rivian may face an uphill climb when ramping its first vehicles, especially considering that the chip crisis is still ongoing. “It’s difficult enough for established automakers, let alone a new one. Couple that with this new issue the entire industry is dealing with, the chip crisis, that just adds another layer of complexity,” Drury noted. \n\n\n\nRivian’s Production Plans\n\n\n\nRecent reports have noted that Rivian is currently focusing its resources on delivering the first batch of its Amazon delivery vans. This makes sense considering the volume of orders it has received from the e-commerce giant, but this strategy could also result in the R1T and R1S being ramped at a more deliberate pace. So far, Rivian has noted that it has received just over 55,000 pre-orders for the R1T and R1S. And since starting deliveries of the R1T, the company has only delivered 156 units of the all-electric pickup truck, “nearly all” of them to Rivian employees. \n\n\n\nRivian’s SEC filing has provided a bit more detail about the R1T and R1S’ rather deliberate ramp. According to the document, the company expects to fill its pre-order backlog of approximately 55,400 R1 vehicles by the end of 2023. Previous reports also note that Rivian is expected to deliver the first 10,000 units of its Amazon delivery vans by the end of 2022, with the entire 100,000-unit order being completed by the end of the decade. \n\n\n\n(Credit: eHauler/RivianForum)\n\n\n\nLegal Challenges to Date\n\n\n\nSimilar to other automakers, Rivian is also involved in some legal challenges. Among the more notable ones involve fellow EV maker Tesla, which has filed a suit against Rivian last year over the alleged theft of intellectual property related to recruitment, bonus and compensation plans for sales personnel, and manufacturing project management systems. A later lawsuit from Tesla also alleged that the truck maker was acquiring core technology related to its upcoming 4680 cells, which was deemed by the Silicon Valley-based company as the “most essential element for any electric vehicle.” \n\n\n\nMore recently, Laura Schwab, who was the first female President in luxury automaker Aston Martin’s history, also filed a suit against Rivian over alleged gender discrimination. Schwab served as Rivian’s Vice President of Sales and Marketing during her tenure with the company. But according to the former Rivian executive, she was routinely excluded from meetings despite her experience in the auto industry, and her warnings about the R1T and R1S’ pricing and public targets were largely ignored. Finally, Schwab noted that she was terminated by Rivian just before it went public, which effectively made her lose “millions of dollars in unvested equity on the eve of the company’s IPO.”\n\n\n\nConclusion\n\n\n\nWith electric vehicle maker Tesla joining the trillion-dollar club, numerous investors are now looking towards the “next Tesla.” And while not all EV startups have succeeded — hydrogen truck company Nikola is a good cautionary tale — companies like Rivian and Lucid Motors do seem to have the makings of a legitimate, and potentially profitable long-term business. This was something highlighted by Pitchbook senior mobility analyst Asad Hussain, who noted that “Rivian’s premium market valuation reflects its ownership of the entire value chain and freedom to innovate without dealing with stranded assets. Between Rivian and Lucid, the market finally has credible candidates for ‘the next Tesla.” \n\n\n\nWould you consider investing in Rivian? Sound off in the comments below. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up.\nThe post Rivian IPO: What you need to know appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/rivian-ipo-what-you-need-to-know/","link_type":"article","item_date":1636476162000,"item_id":"019f85e6","timestamp":1636939452408,"domain":"teslarati.com","item_date_formatted":"Nov 9","description_trimmed":"Rivian Automotive Inc. is expected to price its initial public offering (IPO) later today, November 9, 2021. Morgan Stanley, Goldman Sachs, and J.P. Morgan currently stand as Rivian’s underwriters for the company’s debut. And based on filings with the Securities and Exchange Comm...","keywords":"Pickup Truck, Market Cap, Truck Maker, Legal Challenges"},{"title":"Cadillac Is Buying Out Dealers That Don’t Want To Modernize In Order To Compete With Tesla","description":"Last year, Cadillac started offering its dealers cash in return for giving up their franchise rights if they didn’t want to be a part of the new automotive industry that includes electric vehicles. In other words, invest the funds to modernize your dealerships or get out of the industry. Many chose to take the money […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/09/cadillac-is-buying-out-dealers-that-dont-want-to-modernize-in-order-to-compete-with-tesla/","link_type":"article","item_date":1636474063000,"item_id":"11df764b","timestamp":1636939452332,"domain":"cleantechnica.com","item_date_formatted":"Nov 9","description_trimmed":"Last year, Cadillac started offering its dealers cash in return for giving up their franchise rights if they didn’t want to be a part of the new automotive industry that includes electric vehicles. In other words, invest the funds to modernize your dealerships or get out of the i...","keywords":"Dealers Cash, Automotive Industry, Franchise Rights"},{"title":"Tim Cook responds to Elon Musk claim that Tesla wanted to sell to Apple (while dodging car question)","description":"Back in late 2020, Elon Musk said he had reached out to Tim Cook to talk about Apple acquiring Tesla years back when the automaker was struggling. However, Cook said he had never spoken with Musk. Now in a new interview, while skipping a question about Apple Car, Cook shared more details on what happened with Musk.\n more…\nThe post Tim Cook responds to Elon Musk claim that Tesla wanted to sell to Apple (while dodging car question) appeared first on Electrek.","author":"Electrek","url":"https://9to5mac.com/2021/11/09/tim-cook-doesnt-recall-elon-musk-reaching-out/","link_type":"article","item_date":1636473938000,"item_id":"f03d2e73","timestamp":1636939452329,"domain":"9to5mac.com","item_date_formatted":"Nov 9","description_trimmed":"Back in late 2020, Elon Musk said he had reached out to Tim Cook to talk about Apple acquiring Tesla years back when the automaker was struggling. However, Cook said he had never spoken with Musk. Now in a new interview, while skipping a question about Apple Car, Cook shared more...","keywords":"Tesla Wanted, Elon Musk, Tim Cook"},{"title":"Tesla Now Licensed to Provide Retail Electrical Services in Texas","description":"Photo: Mark Felix/Bloomberg\nTesla has become licensed to provide retail electrical services in Texas through Tesla Energy Ventures. The company aspires to become the state's electricity supplier out of a desire to improve the overall state of affairs in the state's energy market, which deteriorated following a winter storm in February 2021.Tesla demonstrated its intention to sell electricity directly to consumers in Texas by filing an application with the Texas Public Utility Commission in August. At the end of last week, the state issued a permit, according to Gizmodo. The commission wrote that Tesla Energy Ventures is now licensed to “provide retail electric services throughout the area served by ERCOT,” which is basically all of Texas.In February, winter storms hit Texas and left millions of people without electricity for several days. Tesla CEO Elon Musk was one of those impacted, as he and his family were there. Also, the construction of Giga Texas was stopped for several days. The company became one of those who helped the local population by donating and delivering food and essentials. All of this likely prompted the company to help the state bolster its energy market. At the moment, there are no details regarding Tesla's alleged activities there, but the company has experience in this area.“Usually an electricity service provider that doesn't have generation on the ground essentially acts as a middleman, they buy on the wholesale market and turn around and sell to customers,” Ted Kury, director of energy studies for the Public Utility Research Center at the University of Florida, told UtilityDive at the time of the Tesla filing. “Tesla would have the ability to act as a buyer and seller simultaneously and have access to a lot of data. Regulators are going to have to think about what the implications might be.\"\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-licensed-to-provide-retail-electrical-services-in-texas","link_type":"article","item_date":1636471337000,"item_id":"28024313","timestamp":1636939451824,"domain":"tesmanian.com","item_date_formatted":"Nov 9","description_trimmed":"Photo: Mark Felix/Bloomberg\nTesla has become licensed to provide retail electrical services in Texas through Tesla Energy Ventures. The company aspires to become the state's electricity supplier out of a desire to improve the overall state of affairs in the state's energy market,...","keywords":"Energy Market, Company Aspires, Tesla Filing, February Tesla"},{"title":"Goodyear tested its new airless tires on a Tesla — Future Blink","description":"Goodyear just tested its airless tires on a Tesla at up to 55 mph. They expect to perfect the new technology by 2030, and bring an end to landfills full of flat tires.","author":"Mashable","url":"https://mashable.com/video/goodyear-airless-tires-tesla","link_type":"article","item_date":1636467986000,"item_id":"a2af5f63","timestamp":1636939452325,"domain":"mashable.com","item_date_formatted":"Nov 9","description_trimmed":"Goodyear just tested its airless tires on a Tesla at up to 55 mph. They expect to perfect the new technology by 2030, and bring an end to landfills full of flat tires.","keywords":"Airless Tires, Flat Tires, Goodyear Tested"},{"title":"Most F-150 Lightning intenders are EV newbies, so Ford is helping them get ready with AR","description":"Ford already has more than 160,000 reservations for its 2022 F-150 Lightning electric pickup, due for deliveries starting in 2022. Yet of the retail reservation-holders in that crowd, a recent survey suggested that nearly 80% have never owned a battery electric vehicle before. That’s a great thing for EV adoption, but it also means that Ford...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134108_most-f-150-lightning-intenders-are-ev-newbies-so-ford-is-helping-them-get-ready-with-ar","link_type":"article","item_date":1636466400000,"item_id":"833ccc7e","timestamp":1636939452326,"domain":"greencarreports.com","item_date_formatted":"Nov 9","description_trimmed":"Ford already has more than 160,000 reservations for its 2022 F-150 Lightning electric pickup, due for deliveries starting in 2022. Yet of the retail reservation-holders in that crowd, a recent survey suggested that nearly 80% have never owned a battery electric vehicle before. Th...","keywords":"Ar Ford, Ev Newbies, Ev Adoption"},{"title":"Will Rivian’s blockbuster IPO make it the next Tesla?","description":"Huge hype around electric truckmaker that has only just started production","author":"Electric vehicles","url":"https://www.ft.com/content/0d849b99-477b-4c72-9b1b-7b0b99fe270c","link_type":"article","item_date":1636457661000,"item_id":"024e4e85","timestamp":1636939452328,"domain":"ft.com","item_date_formatted":"Nov 9","description_trimmed":"Huge hype around electric truckmaker that has only just started production","keywords":"Huge Hype"},{"title":"Upgraded Cameras for 2017 FSD Cars!","description":"submitted by    /u/110110   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qptmpm/upgraded_cameras_for_2017_fsd_cars/","link_type":"article","item_date":1636424887000,"item_id":"ff86cadb","timestamp":1636939452323,"domain":"reddit.com","item_date_formatted":"Nov 9","description_trimmed":"submitted by    /u/110110   [link]   [comments]","keywords":"Upgraded Cameras, Fsd Cars"},{"title":"Jay Breaks a World Record in a Tesla Plaid! | Jay Leno's Garage","description":"submitted by    /u/RealPokePOP   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qpt6y7/jay_breaks_a_world_record_in_a_tesla_plaid_jay/","link_type":"article","item_date":1636423472000,"item_id":"25b50bda","timestamp":1636939452322,"domain":"reddit.com","item_date_formatted":"Nov 9","description_trimmed":"submitted by    /u/RealPokePOP   [link]   [comments]","keywords":"Jay Breaks, World Record"},{"title":"Jay Breaks a World Record in a Tesla Plaid! | Jay Leno's Garage","description":"https://www.youtube.com/watch?v=eWYnBGG0QU8","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=eWYnBGG0QU8","link_type":"article","item_date":1636412715000,"item_id":"eba94161","timestamp":1636939452321,"domain":"youtube.com","item_date_formatted":"Nov 8","description_trimmed":"https://www.youtube.com/watch?v=eWYnBGG0QU8","keywords":"Jay Breaks"},{"title":"Elon tells us nothing new, but the market moves anyway","description":"How to shape the narrative of a telegraphed share sale.","author":"Electric vehicles","url":"https://www.ft.com/content/7a35340d-e1d7-41a9-93e9-bff49489bd7c","link_type":"article","item_date":1636370677000,"item_id":"5f4bb8e9","timestamp":1636939452234,"domain":"ft.com","item_date_formatted":"Nov 8","description_trimmed":"How to shape the narrative of a telegraphed share sale.","keywords":"Market Moves"},{"title":"Ask TT: Here's the first question","description":"Here's the first questionHere's the description for the thing. by derick.realwebdev+teslatracker","author":"TeslaTracker Submissions","url":"https://teslatracker.com/","link_type":"article","item_date":1636203175000,"item_id":"2fe51513","timestamp":1636939452606,"domain":"teslatracker.com","item_date_formatted":"Nov 6","description_trimmed":"Here's the first questionHere's the description for the thing. by derick.realwebdev+teslatracker","keywords":""},{"title":"New Tesla Patent Reveals Tesla’s Vision For Making Its Cars More Intiutive","description":"One of the newest patents Tesla recently applied for shows what it takes to lead an industry. In the new filing, titled “Generating Ground Truth For Machine Learning From Time Series Elements,” Tesla invented a way to enable the computer (AI) to predict, with high accuracy, the actions a vehicle will take. This is something […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/05/new-tesla-patent-reveals-teslas-vision-for-making-its-cars-more-intiutive/","link_type":"article","item_date":1636169641000,"item_id":"33db70f3","timestamp":1636939452532,"domain":"cleantechnica.com","item_date_formatted":"Nov 6","description_trimmed":"One of the newest patents Tesla recently applied for shows what it takes to lead an industry. In the new filing, titled “Generating Ground Truth For Machine Learning From Time Series Elements,” Tesla invented a way to enable the computer (AI) to predict, with high accuracy, the a...","keywords":"Tesla Invented, Titled Generating, Machine Learning"},{"title":"Denver Basic Income Project Started with Tesla [TSLA] Gains","description":"By Mark Patrick Donovan The Denver Basic Income Project is the first major effort in the US to study the impact of providing guaranteed income to individuals who are unhoused, as a means of accelerating the path toward stability. I founded and seeded this initiative with $500,000 in Tesla gains. We have already raised an […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/05/denver-basic-income-project-started-with-tesla-tsla-gains/","link_type":"article","item_date":1636119600000,"item_id":"50e0da9c","timestamp":1636939452650,"domain":"cleantechnica.com","item_date_formatted":"Nov 5","description_trimmed":"By Mark Patrick Donovan The Denver Basic Income Project is the first major effort in the US to study the impact of providing guaranteed income to individuals who are unhoused, as a means of accelerating the path toward stability. I founded and seeded this initiative with $500,000...","keywords":"Tesla Gains, Tesla Tsla, Major Effort"},{"title":"Tesla Cybertruck","description":"Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to T by derick.realwebdev+teslatracker","author":"TeslaTracker Submissions","url":"https://tesla.com/cybertruck","link_type":"article","item_date":1636118514000,"item_id":"86f5e4bf","timestamp":1636939452652,"domain":"tesla.com","item_date_formatted":"Nov 5","description_trimmed":"Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to T...","keywords":"Ultimate Durability, Superior Strength, Structural Skin, Passenger Protection"},{"title":"Mass-producing Tesla 4680 cells \"requires new techniques,\" Panasonic says","description":"Panasonic is preparing to mass produce large-format 4680 battery cells for Tesla, and facing new manufacturing challenges as part of that process, the head of the company's new consolidated battery division in a recent interview with Nikkei Asia. \"In terms of product development, the technological goals have largely been achieved,\" Kazuo Tadanobu...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134073_mass-producing-tesla-4680-cells-requires-new-techniques-panasonic-says","link_type":"article","item_date":1636113600000,"item_id":"b13e9f4c","timestamp":1636939452642,"domain":"greencarreports.com","item_date_formatted":"Nov 5","description_trimmed":"Panasonic is preparing to mass produce large-format 4680 battery cells for Tesla, and facing new manufacturing challenges as part of that process, the head of the company's new consolidated battery division in a recent interview with Nikkei Asia. \"In terms of product development,...","keywords":"Battery Cells, Cells Requires, Technological Goals, Recent Interview"},{"title":"Tesla Model Y is now sold out for 2021 in the US","description":"The Tesla Model Y is sold out in the United States for the rest of 2021, revealing strong demand for the all-electric crossover.\n\n\n\nA quick search on Tesla’s US order page reveals that the estimated delivery date for a Model Y Performance is now January 2022. The expected delivery date for a Model Y Long Range is even later, on June 2022.\n\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nTesla recently increased the price of the Model Y and the Model 3 by $1,000. The Model Y Long Range now costs $57,990 before options. The Performance variant starts at $62,990 before options. Tesla is also offering a new free paint option, called Midnight Silver Metallic, along with Pearl White Multi-coat.\n\n\n\nRecent videos of the Fremont Factory and Giga Shanghai revealed how busy Tesla is this quarter with deliveries. Tesla’s first factory in California seems filled to the brim with vehicles waiting to be delivered. Giga Shanghai also seemed busy, with its holding lot bursting with cars.\n\n\n\nIn China, the Model Y Standard Range Plus seems to be selling out fast, too. The estimated delivery date for the MIC Model Y SR+ is 6-10 weeks, either around late December 2021 to early January 2022. The MIC Model Y Long Range and Performance variants’ expected delivery dates are listed as “the fourth quarter.”\n\n\n\n\nTesla Q4 deliveries teased with 12 export ships to Asia and Europe\n\n\n\n\n\nTesla hopes to make the Model Y the best-selling vehicle of any kind in the world by either next year or 2023.\n\n\n\n“As we’ve mentioned before, we’ve seen record growth of both Model 3 and Model Y segments, where Model 3 is currently the best-selling luxury sedan worldwide. And as we mentioned at our shareholders’ meeting, Model Y is poised to be the best-selling vehicle in the world,” said Lars Moravy, Tesla’s VP of Vehicle Engineering, at the last earnings call.\n\n\n\nTesla Giga Texas and Giga Berlin are expected to significantly contribute to the company’s goals for the Model Y. The two new Tesla gigafactories are expected to start operations with Model Y production lines. Tesla aims to produce Model Y vehicles with structural battery packs and 4680 cells at Giga Texas and Giga Berlin.\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla Model Y is now sold out for 2021 in the US appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-model-y-sold-out-for-2021/","link_type":"article","item_date":1636094797000,"item_id":"9ead9054","timestamp":1636939452628,"domain":"teslarati.com","item_date_formatted":"Nov 5","description_trimmed":"The Tesla Model Y is sold out in the United States for the rest of 2021, revealing strong demand for the all-electric crossover.\n\n\n\nA quick search on Tesla’s US order page reveals that the estimated delivery date for a Model Y Performance is now January 2022. The expected deliver...","keywords":"Long Range, Tesla Model, Mic Model, Best Selling"},{"title":"Video: Tesla FSD Beta Uses Superhuman Reflexes to Avoid Hitting A Deer","description":"People often ask, \"Can we trust autonomous cars in an emergency?\" Watch this video of a Tesla FSD Beta-equipped Model S and see how it does!","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/05/video-tesla-fsd-beta-uses-superhuman-reflexes-as-it-avoids-hitting-a-deer/","link_type":"article","item_date":1636092665000,"item_id":"cee6b9e1","timestamp":1636939452649,"domain":"cleantechnica.com","item_date_formatted":"Nov 5","description_trimmed":"People often ask, \"Can we trust autonomous cars in an emergency?\" Watch this video of a Tesla FSD Beta-equipped Model S and see how it does!","keywords":"Superhuman Reflexes"},{"title":"With recent price changes, here's a doc showing the history of price changes since 2018! Shout out to Aldrich for the work!","description":"submitted by    /u/Iamhereforhelp   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qn2aof/with_recent_price_changes_heres_a_doc_showing_the/","link_type":"article","item_date":1636083009000,"item_id":"971c164b","timestamp":1636939452529,"domain":"reddit.com","item_date_formatted":"Nov 5","description_trimmed":"submitted by    /u/Iamhereforhelp   [link]   [comments]","keywords":"Doc Showing"},{"title":"Contract? Elon Musk Says There's No Contract Between Hertz and Tesla","description":"Contract? Elon Musk Says There's No Contract Between Hertz and Tesla","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/elon-musk-tesla-model-3-hertz-rent-a-car-ev-sedan/","link_type":"article","item_date":1636082615000,"item_id":"c18190bc","timestamp":1636939452645,"domain":"motortrend.com","item_date_formatted":"Nov 5","description_trimmed":"Contract? Elon Musk Says There's No Contract Between Hertz and Tesla","keywords":"Elon Musk"},{"title":"Electric vehicle maker Rivian sued for ‘unlawful’ firing","description":"Former executive says she was let go after complaining about ‘toxic bro culture’","author":"Electric vehicles","url":"https://www.ft.com/content/ef059fdd-408e-4976-8b2a-1a8cb19ce2c4","link_type":"article","item_date":1636079851000,"item_id":"14b2d6f3","timestamp":1636939452648,"domain":"ft.com","item_date_formatted":"Nov 5","description_trimmed":"Former executive says she was let go after complaining about ‘toxic bro culture’","keywords":"Bro Culture"},{"title":"Rivian IPO puts a spin on Ford’s market value","description":"When the companies start delivering their electric trucks, how should both be valued?","author":"Electric vehicles","url":"https://www.ft.com/content/425dd9dd-6e6d-4083-a019-2ddd38908789","link_type":"article","item_date":1636049222000,"item_id":"03805432","timestamp":1636939452646,"domain":"ft.com","item_date_formatted":"Nov 4","description_trimmed":"When the companies start delivering their electric trucks, how should both be valued?","keywords":"Electric Trucks"},{"title":"Tesla and Hertz reportedly have a disagreement over how fast Tesla can deliver 100,000 electric cars","description":"Tesla and Hertz are reportedly in the middle of a disagreement over how fast the former can deliver the 100,000 electric cars that the rental company ordered.\n more…\nThe post Tesla and Hertz reportedly have a disagreement over how fast Tesla can deliver 100,000 electric cars appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/11/04/tesla-hertz-reportedly-disagreement-on-how-fast-deliver-100000-electric-cars/","link_type":"article","item_date":1636044116000,"item_id":"519ef59f","timestamp":1636939452607,"domain":"electrek.co","item_date_formatted":"Nov 4","description_trimmed":"Tesla and Hertz are reportedly in the middle of a disagreement over how fast the former can deliver the 100,000 electric cars that the rental company ordered.\n more…\nThe post Tesla and Hertz reportedly have a disagreement over how fast Tesla can deliver 100,000 electric cars appe...","keywords":"Hertz Reportedly, Fast Tesla"},{"title":"RT @AnythingTesla: Thanks to our @Tesla Powerwalls we have power in a sea of outages. @elonmusk if this is not a great reason to...","description":"RT @AnythingTesla: Thanks to our @Tesla Powerwalls we have power in a sea of outages. @elonmusk if this is not a great reason to go solar with Powerwalls. I don’t know what else is!","author":"@teslasolar on Twitter","url":"https://twitter.com/TeslaSolar/status/1455963926642921472","link_type":"article","item_date":1635963825000,"item_id":"c5fee058","timestamp":1636939452651,"domain":"twitter.com","item_date_formatted":"Nov 3","description_trimmed":"RT @AnythingTesla: Thanks to our @Tesla Powerwalls we have power in a sea of outages. @elonmusk if this is not a great reason to go solar with Powerwalls. I don’t know what else is!","keywords":"Rt Anythingtesla"},{"title":"BMW: taking the slow road to an electrified future","description":"Carmaker steers different course to rivals as it bets on continuing demand for fossil fuel cars","author":"Electric vehicles","url":"https://www.ft.com/content/e686fc56-e695-449b-a4ff-2cbe60c6f757","link_type":"article","item_date":1635958219000,"item_id":"a05f921b","timestamp":1636939452531,"domain":"ft.com","item_date_formatted":"Nov 3","description_trimmed":"Carmaker steers different course to rivals as it bets on continuing demand for fossil fuel cars","keywords":"Slow Road, Continuing Demand"},{"title":"Tesla Deploys New Car Software Update for Cold Weather, Active Noise Reduction, TIDAL Music &amp; More","description":"Image: @greentheonly/Twitter\nTesla has begun rolling out a new software update that brings cold weather improvements, active noise reduction, TIDAL, and much more. The updates should significantly improve the experience of using its cars and make them even more user-friendly.Tesla recently began rolling out the new software, 2021.40, which has many interesting features that will undoubtedly make the user experience more enjoyable. The company has introduced a new TIDAL music streaming option so that owners can enjoy quality sound from the high-end audio systems installed in their vehicles. TIDAL is a Norwegian music, podcast, and video subscription streaming service recently acquired by Jack Dorsey's Square. Although it has fewer subscribers than other popular similar services, TIDAL offers original content and carefully curated playlists with over 70 million tracks and 250,000 music videos.\n\nTIDAL\nTIDAL streaming is now available from the Media menu with a TIDAL account. You can listen to TIDAL playlists or albums in high-quality audio by connecting to Wi-Fi and pressing Download on the selected content.\n\nThe software update also brings improved vehicle performance in cold weather. Tesla has optimized automatic battery pre-conditioning to consume less energy. In addition, you can now enable front defrost and maintain your climate settings when clearing ice and snow.\n\nCold Weather Improvements\nYou can now enable front defrost and maintain your climate settings when clearing ice and snow. As usual, tap the fan icon and select Keep Climate On when parked.Additionally, when using climate controls on the Tesla App, automatic battery pre-conditioning has been optimized to consume less energy.\n\nThe updated Model S and Model X have added Active Road Noise Reduction, which uses new microphones to enable active noise canceling.\n\nActive Road Noise Reduction\nYour vehicle now has the ability to actively reduce low-frequency road noise while driving on rough surfaces. To accomplish this, the system uses the seat microphones to measure the noise in the cabin, then generates anti-noise through the speakers to create quiet zones around the occupants.To access, tap Audio Settings &gt; Options &gt; Active Road Noise Reduction.\n\nTraffic Aware Cruise Control Chime, which was previously launched in China, will now also be added to its cars. When Traffic-Aware Cruise Control is activated, the car beeps, which was done in order to warn drivers if they accidentally activated TACC.\n\nTraffic Aware Cruise Control Chime\nYou will now receive an audio alert when Traffic-Aware Cruise Control is enabled. To disable, tap Controls&gt; Autopilot&gt; Traffic-Aware Cruise Control Chime.\n\nIn addition, Tesla added “British English” as an official language.\n\nNew Language Support\nYou can now select British English as your language. To update your language setting, tap Controls &gt; Display and select the desired option from the Language drop down menu.\n\n\n2021.40 Tesla Release Notes via Not a Tesla App\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-deploys-new-software-update-that-brings-to-vehicles-cold-weather-improvements-active-noise-reduction-tidal-and-more","link_type":"article","item_date":1635946095000,"item_id":"faf8c2de","timestamp":1636939452712,"domain":"tesmanian.com","item_date_formatted":"Nov 3","description_trimmed":"Image: @greentheonly/Twitter\nTesla has begun rolling out a new software update that brings cold weather improvements, active noise reduction, TIDAL, and much more. The updates should significantly improve the experience of using its cars and make them even more user-friendly.Tesl...","keywords":"Cruise Control, Cold Weather, Software Update, Traffic Aware"},{"title":"Uber London Adds Tesla Vehicles For Drivers Wanting To Buy Or Lease EVs","description":"Starting on November 3, Tesla vehicles will be available for Uber drivers in London wanting to buy or lease a clean energy vehicle, Reuters reports. This is part of a plan to encourage Uber’s customers to use EVs. The article noted that over 135 million pounds had been collected for drivers to use toward environmentally-friendly […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/02/uber-london-adds-tesla-vehicles-for-drivers-wanting-to-buy-or-lease-evs/","link_type":"article","item_date":1635908819000,"item_id":"dca56ccc","timestamp":1636939452728,"domain":"cleantechnica.com","item_date_formatted":"Nov 3","description_trimmed":"Starting on November 3, Tesla vehicles will be available for Uber drivers in London wanting to buy or lease a clean energy vehicle, Reuters reports. This is part of a plan to encourage Uber’s customers to use EVs. The article noted that over 135 million pounds had been collected ...","keywords":"Drivers Wanting, Uber Drivers, Tesla Vehicles"},{"title":"Electric vehicle maker Rivian targets up to $53bn valuation in IPO","description":"Amazon-backed company would be worth more than Nissan or Kia despite scant revenues","author":"Electric vehicles","url":"https://www.ft.com/content/e123d71e-8644-410c-9b4e-69a25914d867","link_type":"article","item_date":1635815706000,"item_id":"6fa1194d","timestamp":1636939452647,"domain":"ft.com","item_date_formatted":"Nov 2","description_trimmed":"Amazon-backed company would be worth more than Nissan or Kia despite scant revenues","keywords":""}],"item_upvotes":{"0554569f":{"auth0|615cb90b861e13006987e6c1":true},"2f441c4b":{"auth0|615cb90b861e13006987e6c1":true},"65088f4f":{"auth0|615cb90b861e13006987e6c1":true},"98aa2dc3":{"auth0|615cb90b861e13006987e6c1":true},"9f943435":{"auth0|615cb90b861e13006987e6c1":true},"f2155f0a":{"auth0|615cb90b861e13006987e6c1":true},"4d9a5014":{"auth0|615cb90b861e13006987e6c1":true},"0db586c3":{"auth0|615cb90b861e13006987e6c1":true},"3e8be538":{"auth0|615cb90b861e13006987e6c1":true}},"user_favorites":{"auth0|615cb90b861e13006987e6c1":[{"item_id":"34d562db","action_date":1636134029384},{"item_id":"49bba284","action_date":1636134030442},{"item_id":"0554569f","action_date":1636203300160},{"item_id":"2f441c4b","action_date":1636203309504},{"item_id":"65088f4f","action_date":1636936804515},{"item_id":"98aa2dc3","action_date":1636936812511},{"item_id":"9f943435","action_date":1636938197920},{"item_id":"a7399752","action_date":1636938199255},{"item_id":"f2155f0a","action_date":1636938205688},{"item_id":"4d9a5014","action_date":1636938206953},{"item_id":"3e8be538","action_date":1636938538753},{"item_id":"0db586c3","action_date":1636938540223},{"item_id":"e13c80ca","action_date":1636938545523},{"item_id":"979fc1c9","action_date":1636938546346},{"item_id":"26d5cfa1","action_date":1636939687410},{"item_id":"a0522fa0","action_date":1636939687881},{"item_id":"551f69fc","action_date":1636939689104},{"item_id":"71f2e4f0","action_date":1636939690410},{"item_id":"35336b9f","action_date":1636939691228}]},"user_upvotes":{"auth0|615cb90b861e13006987e6c1":[{"item_id":"0554569f","action_date":1636203296974},{"item_id":"2f441c4b","action_date":1636203297963},{"item_id":"65088f4f","action_date":1636936808627},{"item_id":"98aa2dc3","action_date":1636936810555},{"item_id":"9f943435","action_date":1636938201425},{"item_id":"f2155f0a","action_date":1636938209023},{"item_id":"4d9a5014","action_date":1636938209602},{"item_id":"0db586c3","action_date":1636938541432},{"item_id":"3e8be538","action_date":1636938542026}]},"comments":[{"item_id":"65088f4f","author":"derick.realwebdev+teslatracker","contents":"Here's a comment","comment_date":"1636937742711","comment_date_formatted":"Nov 15","parent_id":"null","comment_id":"393e0cae"},{"item_id":"98aa2dc3","author":"derick.realwebdev+teslatracker","contents":"Here's another comment","comment_date":"1636937754583","comment_date_formatted":"Nov 15","parent_id":"null","comment_id":"5f4d4b90"},{"item_id":"979fc1c9","author":"derick.realwebdev+teslatracker","contents":"Here are some more comments","comment_date":"1636938553760","comment_date_formatted":"Nov 15","parent_id":"null","comment_id":"4427744a"},{"item_id":"e13c80ca","author":"derick.realwebdev+teslatracker","contents":"Here are the different ways of being that I'm doing.","comment_date":"1636938569677","comment_date_formatted":"Nov 15","parent_id":"null","comment_id":"5d0af72e"},{"item_id":"09fa7158","author":"derick.realwebdev+teslatracker","contents":"Here's another comment","comment_date":"1636938581803","comment_date_formatted":"Nov 15","parent_id":"null","comment_id":"9a3b3d55"}],"users":{"derick.realwebdev+teslatracker":{"nickname":"derick.realwebdev+teslatracker","name":"derick.realwebdev+teslatracker@gmail.com","picture":"https://s.gravatar.com/avatar/bb113ac06bd5fb93059d57dc16ffc0d6?s=480&r=pg&d=https%3A%2F%2Fcdn.auth0.com%2Favatars%2Fde.png","updated_at":"2021-11-10T11:25:01.389Z","email":"derick.realwebdev+teslatracker@gmail.com","email_verified":true,"sub":"auth0|615cb90b861e13006987e6c1","about":"This is my description. Hello world, how are you today?","ownedTeslaModel":"Model Y"}}}