{"etag":"W/\"39ad1a991f696169c1583d464ee39e54\"","items":[{"title":"Tesla Cybertruck","description":"Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to T","author":"TeslaTracker Submissions","url":"https://tesla.com/cybertruck","link_type":"article","item_date":1635455574000,"item_id":"0b914140","timestamp":1635499837319,"domain":"tesla.com","item_date_formatted":"Oct 28","description_trimmed":"Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to T...","keywords":"Ultimate Durability, Superior Strength, Structural Skin, Passenger Protection","submitted_by":"derick.realwebdev+teslatracker"},{"title":"SANDY MUNRO on Who Can Catch Tesla... and How","description":"SANDY MUNRO on Who Can Catch Tesla... and How","author":"TeslaTracker Submissions","url":"https://youtu.be/fI-aEyS_dfc","link_type":"article","item_date":1635450631000,"item_id":"9a306033","timestamp":1635499837200,"domain":"youtube.com","item_date_formatted":"Oct 28","description_trimmed":"SANDY MUNRO on Who Can Catch Tesla... and How","keywords":"Sandy Munro"},{"title":"Trillion-dollar Tesla has redefined what carmaking means","description":"The company’s technological edge and Musk’s cult-like following mark it out — for now","author":"Electric vehicles","url":"https://www.ft.com/content/dd1b4aa6-5065-416a-8068-ca5e12cf32f3","link_type":"article","item_date":1635423999000,"item_id":"53474be9","timestamp":1635499837309,"domain":"ft.com","item_date_formatted":"Oct 28","description_trimmed":"The company’s technological edge and Musk’s cult-like following mark it out — for now","keywords":"Technological Edge, Carmaking Means, Trillion Dollar"},{"title":"Tesla Model 3 Hertz order could increase to 150,000 vehicles, no FSD included","description":"Hertz could extend its Tesla order to 150,000 vehicles if the venture with Uber proves successful, according to the rideshare platform’s CEO Dara Khosrowshahi.\n\n\n\nKhosrowshahi said Uber was confident that 50,000 Tesla vehicles would be a popular choice for drivers and consumers once they enter the rideshare platform.\n\n\n\n“I’ve always said that climate change is a team sport, and our drivers want to help. So we do think that based on the demand that we’ve seen for electric vehicles on our network and Tesla, obviously, is a great brand, is a great product. I think if we make Teslas available, there’ll be plenty of takers,” the Uber CEO stated during an interview on First Move with Julia Chatterley.\n\n\n\n\n\n\"Over the next 3 years, this could grow to 150,000 #Teslas that can be provided by Hertz to #Uber.\"Mark Fields, Interim CEO @Hertz and @Uber CEO @dkhos talk EV adoption &amp; building charging capacity. Plus, no self-driving options included for now!  Part 2 | @firstmove pic.twitter.com/G40TCDCMAd— Julia Chatterley (@jchatterleyCNN) October 27, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nHertz interim CEO Mark Fields added that if the program with Uber proved successful, the rental car company could provide even more Teslas to the rideshare network.\n\n\n\n“Over the next 3 years, this could grow to 150,000 Teslas that can be provided by Hertz to Uber,” said Hertz Interim CEO.\n\n\n\nMark Fields also stated that Hertz’s 100,000 Model 3 order did not include Tesla’s Full Self-Driving suite. Although he didn’t completely rule out the FSD use in the future. Uber drivers will have to be content with just basic Tesla Autopilot for now.\n\n\n\nEarlier this week, Tesla inked a deal with Hertz Global Holdings Inc. for a 100,000 Model 3 vehicle order. The agreement stands as the single-largest purchase for electric vehicles to date, representing about $4.2 billion in revenue. Elon Musk revealed that Hertz paid full price for its order.\n\n\n\nFollowing the news of Hertz’s 100,000 Model 3 order, the car rental company announced that it would be partnering with Uber Technologies Inc. Hertz would add up to 50,000 Tesla vehicles to the Uber Network by 2023, based on the partnership.\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla Model 3 Hertz order could increase to 150,000 vehicles, no FSD included appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-model-3-hertz-150000-vehicle-order/","link_type":"article","item_date":1635404340000,"item_id":"5875bddb","timestamp":1635499837321,"domain":"teslarati.com","item_date_formatted":"Oct 28","description_trimmed":"Hertz could extend its Tesla order to 150,000 vehicles if the venture with Uber proves successful, according to the rideshare platform’s CEO Dara Khosrowshahi.\n\n\n\nKhosrowshahi said Uber was confident that 50,000 Tesla vehicles would be a popular choice for drivers and consumers o...","keywords":"Tesla Vehicles, Electric Vehicles, Hertz Order, Rideshare Platform"},{"title":"Accelerating the electric vehicle transition","description":"Shift is going to be determined by availability of commodities as well as related infrastructure","author":"Electric vehicles","url":"https://www.ft.com/content/41654a34-d472-4aa2-bdab-d5a685af800e","link_type":"article","item_date":1635393640000,"item_id":"c0098e09","timestamp":1635499837308,"domain":"ft.com","item_date_formatted":"Oct 28","description_trimmed":"Shift is going to be determined by availability of commodities as well as related infrastructure","keywords":""},{"title":"To be clear, cars sold to Hertz have no discount. Same price as to consumers.","description":"To be clear, cars sold to Hertz have no discount. Same price as to consumers.","author":"TeslaTracker Submissions","url":"https://twitter.com/elonmusk/status/14527946194109","link_type":"article","item_date":1635384946000,"item_id":"514cf63a","timestamp":1635499837305,"domain":"twitter.com","item_date_formatted":"Oct 28","description_trimmed":"To be clear, cars sold to Hertz have no discount. Same price as to consumers.","keywords":"Cars Sold"},{"title":"1,000 HP BATTLE * Ferrari SF90 vs Tesla Plaid DRAG RACE","description":"1,000 HP BATTLE * Ferrari SF90 vs Tesla Plaid DRAG RACE","author":"TeslaTracker Submissions","url":"https://youtu.be/8CF56F-4L8A","link_type":"article","item_date":1635368227000,"item_id":"e5ab39cc","timestamp":1635499837307,"domain":"youtube.com","item_date_formatted":"Oct 27","description_trimmed":"1,000 HP BATTLE * Ferrari SF90 vs Tesla Plaid DRAG RACE","keywords":"Hp Battle"},{"title":"Goldman Sachs Raises Tesla TSLA Price Target to $1,125 from $905","description":"Photo: David Paul Morris/Bloomberg/Getty Images\nGoldman Sachs raises Tesla's (NASDAQ: TSLA) price target to $1,125 from $905 amid strong news that Hertz has ordered 100,000 Model 3 EVs. The firm is also pleased with the overall growth of the manufacturer's business.Goldman Sachs analyst Mark Delaney raised Tesla's price target to $1,125 from $905 per share. He has confirmed its rating on the manufacturer's shares as Buy. Delaney raised his price target after major car rental company Hertz ordered 100,000 Tesla vehicles for its rental fleet. After completing this order, EVs will make up more than 20% of its fleet. Hertz also said it will supply 50,000 of these units to Uber drivers.“We believe this news is important for Tesla, and while the 100K order is material on its own, we also believe that it will help the company to sustain strong growth and margins when considering the order in the context of other dynamics,” the note said.The analyst clarified that the PT increase is not only due to news related to Hertz but also against the background of general business growth. As a part of \"other dynamics,\" Delaney indicated that Tesla could gain additional fleet sales and also make more money from its charging stations as Tesla's fleet grows.The large order should help Tesla maintain strong margins even as it builds out new factories, Goldman Sachs said. The Hertz deal could also prove to be just the start of a steady stream of orders from the rental company:“We expect there to be continued opportunities in this channel. Hertz typically only holds vehicles for a few years per its filings, suggesting additional sales over time, and this news could also incentivize other rental fleets to shift more quickly toward EVs,” Delaney said.In addition, Delaney increased his 2022 and 2023 full-year earnings-per-share estimates by about 65 cents and $1.50, respectively, to $9 and $10.50, excluding stock-based compensation, which the Street usually backs out when communicating Tesla earnings estimates.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below.\nFollow @EvaFoxU\nLegal Disclaimer --This article is for informational purposes only. You should not construe any such information or other material as an investment, financial, or other advice. Nothing contained in this article constitutes a solicitation, recommendation, endorsement, or offer by Eva Fox, Tesmanian, or any third party service provider to buy or sell any securities or other financial instruments in this or in any other jurisdiction in which such solicitation or offer would be unlawful under the securities laws of such jurisdiction.Eva Fox holds zero shares of Tesla, Inc., and currently (at the time of this article's publishing) holds zero options or securities in Tesla Inc. and/or its affiliates.","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/goldman-sachs-has-raised-tesla-tsla-price-target-to-1-125-from-905","link_type":"article","item_date":1635365580000,"item_id":"f6ada745","timestamp":1635499837534,"domain":"tesmanian.com","item_date_formatted":"Oct 27","description_trimmed":"Photo: David Paul Morris/Bloomberg/Getty Images\nGoldman Sachs raises Tesla's (NASDAQ: TSLA) price target to $1,125 from $905 amid strong news that Hertz has ordered 100,000 Model 3 EVs. The firm is also pleased with the overall growth of the manufacturer's business.Goldman Sachs ...","keywords":"Eva Fox, Price Target, Manufacturer's Shares, Delaney Raised"},{"title":"Every electric vehicle with at least 300 miles of range","description":"The jaw-dropping Lucid Air Dream edition electric vehicle has massive range — and a price tag to match. \n\nThis Saturday, the very first Lucid cars will be delivered at the company’s headquarters in Northern California. The luxury sedan can travel 520 miles on a single charge, the most of any EV available anywhere. But that long range will cost you at least $169,000.\n    \n\n\n\n            \n            Lucid's cars are finally here.\n            Credit: LUCID\n        \n    \nHere are other electric vehicles that get at least 300 miles on a single charge. It’s not a long list now, but as more EVs arrive in 2022 and beyond (we’re looking at you, BMW iX, Ford F-150 Lightning, and Cadillac Lyriq), the range wars will be on.\n        SEE ALSO:\n        \n            Everything you need to know before buying an electric car\n                            \n                    \n    \nTesla\n    \n\n\n\n            \n            A family of long-range EVs.\n            Credit: TESLA\n        \n    \nTesla offers a large selection of \"long range,\" dual-motor cars with more than 300 miles of range. Tesla Model S Long RangeThis is the longest-lasting Tesla available with a 405-mile range. It starts at just under $95,000.Tesla Model S Plaid The revamped sedan is a speed demon (0 to 60 mph in under 2 seconds!) while also offering nearly 400 miles on a single charge. It's the priciest option, starting at $129,990Tesla Model X Long RangeTesla's original electric SUV and its 360-mile range doesn't come cheap. It starts at just under $105,000. Next year, a Plaid version of the X will be available with a range of 340 miles.Tesla Model Y Long RangeThe Model Y is a bigger version of the Model 3 that gets 326 miles on a single charge. It starts at just under $57,000.Tesla Model Y Performance The more expensive Model Y edition (just under $62,000) still gets 303 miles on a charge. Tesla Model 3 Long Range The \"budget\" Model 3 offers a hearty 353 miles of range for under $50,000.Tesla Model 3 PerformanceThe performance version of the Model 3 has a 315-mile range and starts at $58,000.Rivian R1T\n    \n\n\n\n            \n            The electric R1T pickup truck finally made it.\n            Credit: RIVIAN\n        \n    \nWhile the electric pickup truck may be hitting some production delays, the first R1T trucks are on the road. Each boasts a 135 kWh battery with over 300 miles of range. The first \"launch edition\" starts at $73,000. A cheaper version is planned for next year.Ford Mustang Mach-E\n    \n\n\n\n            \n            Charging up the first-ever electric Mustang.\n            Credit: Ford\n        \n    \nFord's first electric Mustang has an entire line-up of SUVs. But only one edition makes it over 300 miles of range: the California Route 1 RWD and AWD versions with 305- and 300-mile ranges, respectively. It starts at just over $50,000.This list will be updated as more long-range EVs become available.","author":"Mashable","url":"https://mashable.com/article/lucid-air-long-range-electric-vehicles","link_type":"article","item_date":1635360915000,"item_id":"c6c600f3","timestamp":1635499837509,"domain":"mashable.com","item_date_formatted":"Oct 27","description_trimmed":"The jaw-dropping Lucid Air Dream edition electric vehicle has massive range — and a price tag to match. \n\nThis Saturday, the very first Lucid cars will be delivered at the company’s headquarters in Northern California. The luxury sedan can travel 520 miles on a single charge, the...","keywords":"Single Charge, Long Range, Tesla Model, Ford Ford's"},{"title":"Hertz CEO drops huge bombshell about Tesla Robo Taxi Plans","description":"https://www.youtube.com/watch?v=Ut_Tj-9_h-M","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=Ut_Tj-9_h-M","link_type":"article","item_date":1635357171000,"item_id":"a6e60a84","timestamp":1635499837531,"domain":"youtube.com","item_date_formatted":"Oct 27","description_trimmed":"https://www.youtube.com/watch?v=Ut_Tj-9_h-M","keywords":""},{"title":"Tesla launches remote sentry mode live view as new premium connectivity feature","description":"Tesla has released a new software update launching the promised remote sentry mode live view from its mobile app.\nIt’s being introduced as a new premium connectivity feature, which requires a $10 per month subscription.\n more…\nThe post Tesla launches remote sentry mode live view as new premium connectivity feature appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/27/tesla-launches-remote-sentry-mode-live-view-premium-connectivity-feature/","link_type":"article","item_date":1635355846000,"item_id":"af4213f7","timestamp":1635499837617,"domain":"electrek.co","item_date_formatted":"Oct 27","description_trimmed":"Tesla has released a new software update launching the promised remote sentry mode live view from its mobile app.\nIt’s being introduced as a new premium connectivity feature, which requires a $10 per month subscription.\n more…\nThe post Tesla launches remote sentry mode live view ...","keywords":""},{"title":"Hertz Teams With Uber, Carvana in Big Shift to Electric Cars","description":"Hertz Teams With Uber, Carvana in Big Shift to Electric Cars","author":"TeslaTracker Submissions","url":"https://www.bloomberg.com/news/articles/2021-10-27","link_type":"article","item_date":1635354675000,"item_id":"d7c6a9f3","timestamp":1635499837619,"domain":"bloomberg.com","item_date_formatted":"Oct 27","description_trimmed":"Hertz Teams With Uber, Carvana in Big Shift to Electric Cars","keywords":"Big Shift"},{"title":"Tesla for $299 a week, insured: Uber drivers eligible to rent through Hertz","description":"Although Elon Musk’s fleet of Tesla robotaxis is long overdue, an agreement among two transportation giants will make it much more likely your Uber driver will be piloting a Tesla. Hertz and Uber confirmed Wednesday that up to 50,000 Tesla vehicles will be available to Uber drivers, to rent from Hertz for use on the ride-hailing company's...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133995_tesla-299-a-week-insured-uber-drivers-eligible-to-rent-hertz","link_type":"article","item_date":1635350040000,"item_id":"fd765e77","timestamp":1635499837613,"domain":"greencarreports.com","item_date_formatted":"Oct 27","description_trimmed":"Although Elon Musk’s fleet of Tesla robotaxis is long overdue, an agreement among two transportation giants will make it much more likely your Uber driver will be piloting a Tesla. Hertz and Uber confirmed Wednesday that up to 50,000 Tesla vehicles will be available to Uber drive...","keywords":"Uber Drivers, Uber Driver"},{"title":"Lucid CEO Peter Rawlinson is obsessed with besting Tesla and Elon Musk. Here's his game plan for making it happen.","description":"Lucid CEO Peter Rawlinson is obsessed with besting Tesla and Elon Musk. Here's his game plan for making it happen.","author":"TeslaTracker Submissions","url":"https://www.businessinsider.com/how-lucid-peter-ra","link_type":"article","item_date":1635342665000,"item_id":"5eb2027c","timestamp":1635499837679,"domain":"businessinsider.com","item_date_formatted":"Oct 27","description_trimmed":"Lucid CEO Peter Rawlinson is obsessed with besting Tesla and Elon Musk. Here's his game plan for making it happen.","keywords":"Game Plan, Elon Musk"},{"title":"Dealers Say Salespeople Still Aren't Ready To Sell EVs","description":"We are entering the age of the electric car, and it sounds like dealers are coming along for the ride, too, even if they are coming along kicking and screaming. Read more...","author":"Jalopnik","url":"https://jalopnik.com/dealers-say-salespeople-still-arent-ready-to-sell-evs-1847940783","link_type":"article","item_date":1635342300000,"item_id":"1cdfcc8e","timestamp":1635499837621,"domain":"jalopnik.com","item_date_formatted":"Oct 27","description_trimmed":"We are entering the age of the electric car, and it sounds like dealers are coming along for the ride, too, even if they are coming along kicking and screaming. Read more...","keywords":"Sell Evs, Read More, Electric Car"},{"title":"Lucid confirms Air Dream Edition’s first deliveries will take place October 30th","description":"Lucid Group has confirmed that it will deliver the first Air Dream Edition all-electric sedans on Saturday, October 30, with an exclusive Dream Delivery event in California.\nAfter starting production of the Lucid Air last month at its production facility in Casa Grande, Arizona, Lucid has now confirmed that it will launch the rollout of its first-ever electric vehicle on Saturday, as a select group of reservation holders have been invited to take delivery of the Air sedan this weekend.\nLucid will not only be performing customer deliveries at the event. Additionally, customers will experience the Lucid Rally, an event hosted by members of Lucid’s leadership team on a closed course that will showcase the handling, performance, and ride capabilities of the company’s first all-electric sedan. Customers will then take their personally-configured Air Dream Edition sedans home.\n\n\n\nCredit: Lucid Group\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nLucid holds the record for the vehicle with the most EPA-estimated range, which can achieve 520 miles of driving on a single charge. The Dream Edition models of the Air are developed with a 118 kWh version of the long-range battery pack developed by Lucid, featuring 22 modules and 6,600 battery cells. The vehicle delivers 4.4 miles per kWh, which is only surpassed by the Grand Touring edition of the Air with 4.6 miles per kWh. The Dream Edition Performance tops the charts with performance metrics, however, offering 1,111 horsepower, achieving a 0-60 mph time of just 2.41 seconds and a quarter-mile time of 9.67 seconds.\nCEO and CTO of Lucid Group, Peter Rawlinson, said:\n“Creating the Lucid Air has truly been a labor of love, with customer deliveries representing the culmination of years of endeavor from the entire Lucid team. So I’m truly excited to hand the keys to our first dear customers and accompany them on an inaugural drive through the iconic California countryside.”\nLucid plans to deliver 520 customer-configured Air Dream Editions, with the Grand Touring versions beginning deliveries soon thereafter. Touring and Pure models are anticipated for delivery to customers during 2022.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Lucid confirms Air Dream Edition’s first deliveries will take place October 30th appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/lucid-air-dream-edition-first-deliveries-october-30/","link_type":"article","item_date":1635340838000,"item_id":"30a6b6e5","timestamp":1635499837376,"domain":"teslarati.com","item_date_formatted":"Oct 27","description_trimmed":"Lucid Group has confirmed that it will deliver the first Air Dream Edition all-electric sedans on Saturday, October 30, with an exclusive Dream Delivery event in California.\nAfter starting production of the Lucid Air last month at its production facility in Casa Grande, Arizona, ...","keywords":"Lucid Air, Lucid Group, Air Sedan, Lucid Rally"},{"title":"Lucid plans first deliveries of Air Dream Edition on Saturday, some in 520-mile form","description":"Lucid announced on Wednesday that it will hold a delivery event in California this Saturday, October 30, in which an initial group of customers will take delivery of their Air Dream Edition cars and be able to drive away. This will be a big moment for Lucid, as it doesn’t just formally establish the California-based company as an automaker;...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133991_lucid-plans-first-deliveries-of-air-dream-edition-on-saturday-some-in-520-mile-form","link_type":"article","item_date":1635339600000,"item_id":"c8ab49b8","timestamp":1635499837623,"domain":"greencarreports.com","item_date_formatted":"Oct 27","description_trimmed":"Lucid announced on Wednesday that it will hold a delivery event in California this Saturday, October 30, in which an initial group of customers will take delivery of their Air Dream Edition cars and be able to drive away. This will be a big moment for Lucid, as it doesn’t just fo...","keywords":"Delivery Event, Lucid Plans, Initial Group, Formally Establish"},{"title":"How Many Jobs Will Disappear With Switch To Electric Cars?","description":"When considering the transition from gasoline and diesel-powered vehicles to electric, it is easy to see the disruption this will bring to the auto industry, where fewer workers are required to construct an electrical motor than a fossil fuel powered engine. But it goes further than that. We won’t need people (or machines) who make […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/26/how-many-jobs-will-disappear-with-switch-to-electric-cars/","link_type":"article","item_date":1635306926000,"item_id":"e4f2d1c6","timestamp":1635499837673,"domain":"cleantechnica.com","item_date_formatted":"Oct 27","description_trimmed":"When considering the transition from gasoline and diesel-powered vehicles to electric, it is easy to see the disruption this will bring to the auto industry, where fewer workers are required to construct an electrical motor than a fossil fuel powered engine. But it goes further t...","keywords":"Electrical Motor, Electric Cars, Fewer Workers, Auto Industry"},{"title":"Battery removal, model 3.","description":"submitted by    /u/Rocky1268   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qgjgow/battery_removal_model_3/","link_type":"article","item_date":1635291927000,"item_id":"545aef27","timestamp":1635499837530,"domain":"reddit.com","item_date_formatted":"Oct 26","description_trimmed":"submitted by    /u/Rocky1268   [link]   [comments]","keywords":"Battery Removal"},{"title":"Tesla's prototype battery with 5 times more energy storage comes to life at Panasonic","description":"submitted by    /u/Heffeweizen   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qgaq6e/teslas_prototype_battery_with_5_times_more_energy/","link_type":"article","item_date":1635267143000,"item_id":"9f77016a","timestamp":1635499837528,"domain":"reddit.com","item_date_formatted":"Oct 26","description_trimmed":"submitted by    /u/Heffeweizen   [link]   [comments]","keywords":"Panasonic Submitted, Energy Storage"},{"title":"Tesla gets scathing criticism from NTSB Chair over FSD branding, driver monitoring: “It’s not enough”","description":"In a recent appearance at CNBC’s Squawk Box, NTSB Chairwoman Jennifer Homendy doubled down on her criticism of Tesla’s driver-assist systems. The head of the US National Transportation Safety Board’s recent comments came just a day after Homendy sent a letter to Tesla CEO Elon Musk about why the EV maker has not responded to recommendations issued by the NTSB years ago. \n\n\n\nBack in 2017, the NTSB issued two safety recommendations to Tesla following its investigation of a fatal Autopilot crash. The agency concluded that Autopilot did not effectively monitor the driver’s attention on the road, and thus, it recommended that Tesla should limit Autopilot. The NTSB also recommended that Tesla should implement better ways to determine a driver’s engagement. \n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nTesla did not respond to the NTSB directly, but it did roll out numerous safety improvements to Autopilot in the form of more stringent driver monitoring checks, and more recently, the use of in-cabin cameras to determine if a driver is paying attention to the road. Yet in her appearance at CNBC’s Squawk Box, and even with the host highlighting a comment from CEO Elon Musk stating that FSD Beta users must be extremely vigilant at all times, Homendy was firm in her stance that Tesla was not doing enough. \n\n\n\n“That’s not enough. It’s clear that if you are marketing something as full self-driving and it is not full self-driving and people are misusing the vehicles and the technology that you have a design flaw, and you have to prevent that misuse. And part of that is how you talk about your technology. It’s not full self-driving. Unless you’re saying the driver is actually driving the car. Which in this case, it isn’t full self-driving technology. It’s misleading,” the NTSB head said. \n\n\n\nWhat is rather interesting was that the NTSB’s initial recommendations for Tesla from four years ago were for Autopilot’s driver monitoring systems. This has already been addressed by Tesla through a series of over-the-air updates, from higher frequencies of visual and audible alerts to the use of in-cabin cameras. Homendy’s recent issues also seem focused on the Full Self-Driving suite, which is not the same as the FSD Beta that is being expanded to a select group of Tesla owners today. FSD Beta is only given to drivers with high safety scores, while Full Self Driving is currently being sold as a bundle of features that could be purchased today, such as Summon and Navigate on Autopilot with Automatic Lane Changes. \n\n\n\nWhat is even more interesting is that currently, there are over 38,000 Americans who die in automobile crashes per year, as per data from the National Highway Traffic Safety Administration (NHTSA). The CDC further notes that an additional 3 million people are injured or disabled annually as a result of automobile crashes. This is the issue that Tesla is trying to address with its Autopilot and FSD programs, and this is a rather grim statistic that is seemingly being ignored by the NTSB head so far. \n\n\n\nCheck out the NTSB head’s segment in CNBC’s Squawk Box in the video below. \n\n\n\n\n\n\n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla gets scathing criticism from NTSB Chair over FSD branding, driver monitoring: “It’s not enough” appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-ntsb-head-fsd-not-safe-enough/","link_type":"article","item_date":1635266100000,"item_id":"5203cdbd","timestamp":1635499837680,"domain":"teslarati.com","item_date_formatted":"Oct 26","description_trimmed":"In a recent appearance at CNBC’s Squawk Box, NTSB Chairwoman Jennifer Homendy doubled down on her criticism of Tesla’s driver-assist systems. The head of the US National Transportation Safety Board’s recent comments came just a day after Homendy sent a letter to Tesla CEO Elon Mu...","keywords":"Squawk Box, Driver Monitoring, Fsd Beta, Fsd Branding"},{"title":"Tesla releases Dojo whitepaper, Elon Musk teases as ‘more important than it may seem’","description":"Tesla has released a new whitepaper regarding a new standard for its Dojo supercomputing platform.\nCEO Elon Musk teased the paper as “more important than it may seem.”\n more…\nThe post Tesla releases Dojo whitepaper, Elon Musk teases as ‘more important than it may seem’ appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/26/tesla-releases-dojo-whitepaper-elon-musk-teases-important/","link_type":"article","item_date":1635263179000,"item_id":"c524f3a5","timestamp":1635499838025,"domain":"electrek.co","item_date_formatted":"Oct 26","description_trimmed":"Tesla has released a new whitepaper regarding a new standard for its Dojo supercomputing platform.\nCEO Elon Musk teased the paper as “more important than it may seem.”\n more…\nThe post Tesla releases Dojo whitepaper, Elon Musk teases as ‘more important than it may seem’ appeared f...","keywords":""},{"title":"Tesla has paid off six loans worth over $1B in 2021","description":"Tesla has paid off six loans so far in 2021, equating to over $1 billion in debts that have been removed from the company’s financials. The automaker, which surged to a valuation of over $1 trillion yesterday, detailed the repayment of these loans in a 10-Q filing with the SEC.\nTesla’s total repayment of its loans in 2021 amounts to $1.087 billion, according to information the automaker released in the 10-Q. The company took loans from several entities to help fund the construction and development of several projects across the globe, including a massive $614 million loan from numerous Chinese banks to build Gigafactory Shanghai and a $321 million loan for Solar Asset-backed notes, both of which are repaid.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nSolar Asset-backed Notes and Solar Loan-backed Notes\nIn October 2021, Tesla early repaid the substantial sum of these two loans, which total $374 million in total. The $321 million loan was early repaid and applied to the Solar Asset-backed Notes, while the $53 million loan was paid back early as well and applied to Solar Loan-backed Notes.\nChina Loan Agreements\nIn April 2021, Tesla fully repaid a massive $614 million in aggregate principal of its second term loan facility in connection with the construction of Gigafactory Shanghai. This applied to the “Fixed Asset Facility” and Tesla was it was terminated. This loan actually amounted to $1.4 billion in total when it was financed in December 2019. CEO Elon Musk said, “Tesla always pays its debts.”\nElon Musk confirms Tesla’s $1.4 billion loan for Giga Shanghai was paid off early\n\nAdditionally, in June 2021 Tesla’s Working Capital Contract Loan Contract, which it entered in May 202, matured and was also terminated.\nSolar Term Loan\nIn January 2021, Tesla fully repaid its matured Solar Term Loan, but did not give details on the amount.\nAutomotive Lease-backed Credit Facilities\nIn June 2021, Tesla fully repaid $32 million in aggregate principal of its Automotive Lease-backed Credit Facilities, which terminated one of the facilities, the company wrote.\nSolar Revolving Credit Facility and other Loans\nTesla fully repaid a $67 million loan for Solar Revolving Credit in April 2021. The loan was terminated.\nRemaining Debt\nTesla still does have some debt remaining, but some could be paid off with the massive $4.3 billion it just profited off of an order for 100,000 Model 3s from Hertz. According to the 10-Q, Tesla has $1.207 billion in debt in the current term, with $5.439 billion in the long term.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla has paid off six loans worth over $1B in 2021 appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-loan-payoff-debts-2021/","link_type":"article","item_date":1635262148000,"item_id":"543226e7","timestamp":1635499838016,"domain":"teslarati.com","item_date_formatted":"Oct 26","description_trimmed":"Tesla has paid off six loans so far in 2021, equating to over $1 billion in debts that have been removed from the company’s financials. The automaker, which surged to a valuation of over $1 trillion yesterday, detailed the repayment of these loans in a 10-Q filing with the SEC.\nT...","keywords":"Million Loan, Loans Worth, Credit Facilities, Aggregate Principal"},{"title":"Last Night Elon Musk Called Tesla Hertz’s Result \"Strange,\" Here is Why","description":"https://www.youtube.com/watch?v=e9svHl4X8DI","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=e9svHl4X8DI","link_type":"article","item_date":1635256352000,"item_id":"25bfef96","timestamp":1635499838024,"domain":"youtube.com","item_date_formatted":"Oct 26","description_trimmed":"https://www.youtube.com/watch?v=e9svHl4X8DI","keywords":""},{"title":"Tesla’s Big Order Win Boosts Asia EV Stocks, Lithium Makers","description":"Tesla’s Big Order Win Boosts Asia EV Stocks, Lithium Makers","author":"Hyperdrive - Bloomberg","url":"https://www.bloomberg.com/news/articles/2021-10-26/tesla-s-big-order-win-boosts-asia-ev-stocks-before-catl-earnings?srnd=hyperdrive","link_type":"article","item_date":1635253363000,"item_id":"55ba7224","timestamp":1635499837818,"domain":"bloomberg.com","item_date_formatted":"Oct 26","description_trimmed":"Tesla’s Big Order Win Boosts Asia EV Stocks, Lithium Makers","keywords":""},{"title":"Hertz’s 100k Tesla Model 3 order was bought at full price, confirms Elon Musk","description":"Elon Musk has confirmed that Hertz paid full price for its massive Tesla Model 3 order. Recently, news broke that the American car rental giant ordered 100,000 Model 3 vehicles for its fleet. “To be clear, cars sold to Hertz have no discount. Same price as to consumers,” Elon Musk pointed out on Twitter. \n\n\n\nMusk’s comment highlighted the strong demand that’s being experienced by Tesla’s vehicles worldwide. Typically, carmakers tend to implement discounts for orders as large as Hertz’s. The fact that Tesla had the car rental giant pay full price for its 100,000 Model 3s shows that the company is treating Hertz like a regular customer, similar to any other EV buyer in the market. \n\n\n\n\n\nTo be clear, cars sold to Hertz have no discount. Same price as to consumers.— Elon Musk (@elonmusk) October 26, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nOn its official website, Hertz calls the Tesla Model the “flag bearer for the electric cars market.”\n\n\n\n“Look at the reviews of Model 3 and you’ll find this best-selling electric vehicle has 5-stars nearly across the board. A sleek and compact sedan, it competes with and surpasses many equivalent gas-engine models from rival manufacturers and has the advantage of zero emissions. And, because it’s from Tesla, you can be confident that it offers the most advanced tech you’ll find in any car,” Hertz said about the Model 3.\n\n\n\nThe car rental company claims that it now has the largest electric vehicle rental fleet in North America. With 100,000 Model 3 in its fleet, Hertz certainly seems confident about Tesla and its best-selling sedan. Hertz’s Model 3 purchase also seemed to instill confidence in Tesla as a company.\n\n\n\n\n\nGOAT’s recognize GOAT’s. Introducing our all new EV fleet (@TomBrady not included) #Hertz #LetsGo pic.twitter.com/TElSE2PDKb— Hertz (@Hertz) October 25, 2021\n\n\n\n\n\n\nAfter the Hertz deal was announced, TSLA stock moved up, breaking the $1,000 barrier and resulting in the company’s market cap hitting the $1 trillion mark. Elon Musk noted that the stock’s rise was strange.\n\n\n\n“Strange that moved valuation, as Tesla is very much a production ramp problem, not a demand problem,” Musk tweeted.\n\n\n\nTesla’s demand is as potent as ever, especially since the pandemic proved the need to transition to renewable energy in almost all markets. As Musk pointed out, Tesla is still working on ramping production to meet demand.\n\n\n\n\n\nStrange that moved valuation, as Tesla is very much a production ramp problem, not a demand problem— Elon Musk (@elonmusk) October 25, 2021\n\n\n\n\n\n\nAt the last earnings call, Tesla VP of Engineering Lars Moravy pointed out that the company is focusing on ramping and improving production on its current line of products. He added that adding more vehicles to the lineup is not Tesla’s main focus for now. Moravy further mentioned the supply chain challenges Tesla has faced and possible supply chain headwinds in the future.\n\n\n\nHowever, Tesla seems to be handling supply chain challenges very well, especially as it continues to raise its production capabilities, most notably with its Gigafactories. Giga Shanghai has already proven quite effective as an export hub, dealing with demand in Asia and Europe. Giga Berlin and Gigafactory Texas will likely do the same once they begin operations.\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Hertz’s 100k Tesla Model 3 order was bought at full price, confirms Elon Musk appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-model-3-hertz-full-price-order-elon-musk/","link_type":"article","item_date":1635229194000,"item_id":"7acd02ec","timestamp":1635499837819,"domain":"teslarati.com","item_date_formatted":"Oct 26","description_trimmed":"Elon Musk has confirmed that Hertz paid full price for its massive Tesla Model 3 order. Recently, news broke that the American car rental giant ordered 100,000 Model 3 vehicles for its fleet. “To be clear, cars sold to Hertz have no discount. Same price as to consumers,” Elon Mus...","keywords":"Tesla Model, Demand Problem, Cars Sold, Full Price"},{"title":"So now you can summon your vehicle with autopilot?","description":"submitted by    /u/No-Towel7011   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qfxp7z/so_now_you_can_summon_your_vehicle_with_autopilot/","link_type":"article","item_date":1635219204000,"item_id":"3f6f2759","timestamp":1635499837523,"domain":"reddit.com","item_date_formatted":"Oct 26","description_trimmed":"submitted by    /u/No-Towel7011   [link]   [comments]","keywords":""},{"title":"Elon Musk confirms Herts ordered 100,000 Teslas at the same price consumers would pay (no fleet discounts)","description":"submitted by    /u/Lukequist   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qfuy4a/elon_musk_confirms_herts_ordered_100000_teslas_at/","link_type":"article","item_date":1635209903000,"item_id":"bf396ebe","timestamp":1635499837521,"domain":"reddit.com","item_date_formatted":"Oct 26","description_trimmed":"submitted by    /u/Lukequist   [link]   [comments]","keywords":"Price Consumers"},{"title":"The Hertz-Tesla Deal Will Help Normalize Electric Cars","description":"The Hertz-Tesla Deal Will Help Normalize Electric Cars","author":"Hyperdrive - Bloomberg","url":"https://www.bloomberg.com/opinion/articles/2021-10-25/hertz-tesla-deal-will-help-normalize-electric-cars?srnd=hyperdrive","link_type":"article","item_date":1635205612000,"item_id":"ffbee2e1","timestamp":1635499837819,"domain":"bloomberg.com","item_date_formatted":"Oct 25","description_trimmed":"The Hertz-Tesla Deal Will Help Normalize Electric Cars","keywords":"Hertz Tesla"},{"title":"Tesla (TSLA) reaches $1 trillion valuation","description":"Tesla (TSLA) has officially reached a public market valuation of $1 trillion after adding over $100 billion to its market capitalization today alone.\n more…\nThe post Tesla (TSLA) reaches $1 trillion valuation appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/25/tesla-tsla-reaches-1-trillion-valuation/","link_type":"article","item_date":1635187288000,"item_id":"8d7fb0e5","timestamp":1635499838072,"domain":"electrek.co","item_date_formatted":"Oct 25","description_trimmed":"Tesla (TSLA) has officially reached a public market valuation of $1 trillion after adding over $100 billion to its market capitalization today alone.\n more…\nThe post Tesla (TSLA) reaches $1 trillion valuation appeared first on Electrek.","keywords":""},{"title":"Tesla soars past $1tn in market value","description":"First carmaker to reach milestone after major order from Hertz for electric vehicles","author":"Electric vehicles","url":"https://www.ft.com/content/4eb7504e-94ef-4f99-937d-807aa159b282","link_type":"article","item_date":1635183566000,"item_id":"4ac6519c","timestamp":1635499838071,"domain":"ft.com","item_date_formatted":"Oct 25","description_trimmed":"First carmaker to reach milestone after major order from Hertz for electric vehicles","keywords":"Reach Milestone"},{"title":"Lucid Motors Is Delivering Cars to Customers Now","description":"Over the weekend, Lucid Motors tweeted a photo of what appears to be several production versions of its all-electric Air sedan on a truck, ready for transport. We’ve reached out to Lucid to confirm this is the case, and we’ll update this article if we hear back.Read more...","author":"Jalopnik","url":"https://jalopnik.com/lucid-motors-is-delivering-cars-to-customers-now-1847929098","link_type":"article","item_date":1635178440000,"item_id":"0a325f28","timestamp":1635499838119,"domain":"jalopnik.com","item_date_formatted":"Oct 25","description_trimmed":"Over the weekend, Lucid Motors tweeted a photo of what appears to be several production versions of its all-electric Air sedan on a truck, ready for transport. We’ve reached out to Lucid to confirm this is the case, and we’ll update this article if we hear back.Read more...","keywords":"Lucid Motors, Production Versions, Delivering Cars, Air Sedan"},{"title":"Apple seeks batteries, Hertz adds Tesla, Mercedes EQC back on, VW and tax credit: Today’s Car News","description":"The surge of the EV demand surprises even Tesla. Hertz opts to add at least 100,000 Teslas because of, in part, the experience and Supercharger network. Apple and Tesla are both looking for the same kind of batteries. The Mercedes EQC is back on, albeit not for a few years. And VW's U.S. CEO says that the higher EV tax credit being proposed isn't...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133971_apple-seeks-batteries-hertz-adds-tesla-mercedes-eqc-back-on-vw-and-tax-credit-today-s-car-news","link_type":"article","item_date":1635177300000,"item_id":"d133e82c","timestamp":1635499838108,"domain":"greencarreports.com","item_date_formatted":"Oct 25","description_trimmed":"The surge of the EV demand surprises even Tesla. Hertz opts to add at least 100,000 Teslas because of, in part, the experience and Supercharger network. Apple and Tesla are both looking for the same kind of batteries. The Mercedes EQC is back on, albeit not for a few years. And V...","keywords":"Tax Credit, Mercedes Eqc, Back On, Hertz Opts"},{"title":"Buy Tesla for the 'Giga Press.' Stay for the Manufacturing Revolution.","description":"Tesla revolutionizing manufacturing","author":"TeslaTracker Submissions","url":"https://www.barrons.com/articles/new-preferred-sto","link_type":"article","item_date":1635173242000,"item_id":"c4c5167f","timestamp":1635499838084,"domain":"barrons.com","item_date_formatted":"Oct 25","description_trimmed":"Tesla revolutionizing manufacturing","keywords":"Manufacturing Revolution, Buy Tesla"},{"title":"Tesla/Hertz: supercharged","description":"How to regain relevance as a meme stock.","author":"Electric vehicles","url":"https://www.ft.com/content/bd7847fb-22a2-49ff-a8ad-992e634585af","link_type":"article","item_date":1635167527000,"item_id":"13265562","timestamp":1635499838107,"domain":"ft.com","item_date_formatted":"Oct 25","description_trimmed":"How to regain relevance as a meme stock.","keywords":"Regain Relevance, Meme Stock"},{"title":"Hertz orders 100,000 Teslas, the single-largest EV purchase ever, with Tom Brady campaign","description":"Hertz Global Holdings Inc has placed an order for a whopping 100,000 Teslas in a huge first step toward electrifying its rental-car fleet and in the process mainstreaming EVs. \n more…\nThe post Hertz orders 100,000 Teslas, the single-largest EV purchase ever, with Tom Brady campaign appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/25/hertz-orders-100000-teslas-the-single-largest-ev-purchase-ever/","link_type":"article","item_date":1635163684000,"item_id":"b2d07432","timestamp":1635499838130,"domain":"electrek.co","item_date_formatted":"Oct 25","description_trimmed":"Hertz Global Holdings Inc has placed an order for a whopping 100,000 Teslas in a huge first step toward electrifying its rental-car fleet and in the process mainstreaming EVs. \n more…\nThe post Hertz orders 100,000 Teslas, the single-largest EV purchase ever, with Tom Brady campai...","keywords":"Single Largest"},{"title":"Tesla pulls Full Self-Driving update due to 'issues'","description":"Tesla has rolled back the latest version of its Full Self-Driving car software, from version 10.3 back to version 10.2. The Full Self-Driving (FSD) is optional software that enables a number of autonomous driving features in Tesla cars (though it does not really enabled autonomous driving without driver supervision). The company released it as limited beta software to eligible U.S. drivers in October 2020, causing controversy as some experts feared that this puts other traffic participants at risk. On Saturday, Tesla CEO Elon Musk said on Twitter that there was an issue with \"left turns at traffic lights\" in the 10.3 version of FSD. On Sunday, he followed up by saying that the company is temporarily rolling back FSD to version 10.3.\n    Tweet may have been deleted\n\n\"This is to be expected with beta software. It is impossible to test all hardware configs in all conditions with internal QA, hence public beta,\" he tweeted. \n        SEE ALSO:\n        \n            Tesla drivers become less attentive when using Autopilot, study finds\n                            \n                    \n    \nIt's hard to discern what, exactly, the issues are, and given Tesla has no PR department, we have no one to ask. But The Verge points out that some drivers who tested the FSD 10.3 update have seen phantom forward collision warning (FCW) alerts and a disappearing Autosteer option, among other issues. As Musk puts it, bugs are to be expected with beta software. But when beta software is deployed to actual, real-life drivers on real-world roads, where bugs can cause serious accidents, you have to wonder whether the whole \"beta software on public roads\" idea is the right way to go.","author":"Mashable","url":"https://mashable.com/article/tesla-fsd-10-3-roll-back","link_type":"article","item_date":1635151522000,"item_id":"16376c28","timestamp":1635499838101,"domain":"mashable.com","item_date_formatted":"Oct 25","description_trimmed":"Tesla has rolled back the latest version of its Full Self-Driving car software, from version 10.3 back to version 10.2. The Full Self-Driving (FSD) is optional software that enables a number of autonomous driving features in Tesla cars (though it does not really enabled autonomou...","keywords":"Beta Software, Public Beta, Car Software, Optional Software"},{"title":"Tesla Supplier Shows Off More Powerful Battery","description":"The new cell has five times the capacity of smaller previous models, the head of Panasonic’s battery unit said.","author":"WSJ.com: WSJD","url":"https://www.wsj.com/articles/tesla-supplier-shows-off-more-powerful-battery-11635144493?mod=rss_Technology","link_type":"article","item_date":1635144480000,"item_id":"573d0aba","timestamp":1635499838128,"domain":"wsj.com","item_date_formatted":"Oct 25","description_trimmed":"The new cell has five times the capacity of smaller previous models, the head of Panasonic’s battery unit said.","keywords":""},{"title":"Tesla FSD Beta Protects A Cyclist Running A Red Light","description":"Twitter user and Tesla FSD Beta tester @FrenchieEAP shared footage on Friday of Tesla’s FSD Beta preventing Frenchi’s car from slamming into a cyclist that didn’t stop for their light. Frenchie tweeted the video and said they were sitting at a red light and FSD Beta was engaged. As soon as the light turned green, […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/24/tesla-fsd-beta-saves-the-life-of-a-cyclist-running-a-red-light/","link_type":"article","item_date":1635134285000,"item_id":"2fd78515","timestamp":1635499838125,"domain":"cleantechnica.com","item_date_formatted":"Oct 25","description_trimmed":"Twitter user and Tesla FSD Beta tester @FrenchieEAP shared footage on Friday of Tesla’s FSD Beta preventing Frenchi’s car from slamming into a cyclist that didn’t stop for their light. Frenchie tweeted the video and said they were sitting at a red light and FSD Beta was engaged. ...","keywords":"Fsd Beta, Red Light"},{"title":"Tesla’s FSD Beta 10.3 Release Rolled Back Amid User Concerns","description":"Tesla’s FSD Beta 10.3 Release Rolled Back Amid User Concerns","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/tesla-autopilot-fsd-beta-10-3-release-issues/","link_type":"article","item_date":1635120000000,"item_id":"a5b38ab1","timestamp":1635499837625,"domain":"motortrend.com","item_date_formatted":"Oct 25","description_trimmed":"Tesla’s FSD Beta 10.3 Release Rolled Back Amid User Concerns","keywords":"Fsd Beta"},{"title":"MegaHertz: Hertz Will Start Renting Out Tesla Model 3 EVs","description":"MegaHertz: Hertz Will Start Renting Out Tesla Model 3 EVs","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/hertz-tesla-model-3-rent-ev/","link_type":"article","item_date":1635120000000,"item_id":"358ad26c","timestamp":1635499837807,"domain":"motortrend.com","item_date_formatted":"Oct 25","description_trimmed":"MegaHertz: Hertz Will Start Renting Out Tesla Model 3 EVs","keywords":"Tesla Model, Start Renting"},{"title":"Tesla’s FSD Beta 10.3 Release Rolled Back Amid User Concerns","description":"Tesla’s FSD Beta 10.3 Release Rolled Back Amid User Concerns","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/tesla-autopilot-fsd-beta-10-3-release-issues/","link_type":"article","item_date":1635120000000,"item_id":"1d8a9229","timestamp":1635499837808,"domain":"motortrend.com","item_date_formatted":"Oct 25","description_trimmed":"Tesla’s FSD Beta 10.3 Release Rolled Back Amid User Concerns","keywords":"Fsd Beta"},{"title":"Tesla FSD Beta is starting to save lives","description":"Tesla’s Autopilot and Full Self-Driving Beta are, at their core, safety systems. They may be advanced enough to make driving tasks extremely easy and convenient, but ultimately, CEO Elon Musk has been consistent with the idea that Tesla’s advanced driver-assist technologies are being developed to make the world’s roads as safe as possible. \n\n\n\nThis is something that seems to be happening now among some members of the FSD Beta group, which is currently being expanded even to drivers with a Safety Score of 99. As the company expands its fleet of vehicles that are equipped with FSD beta, some testers have started sharing stories about how the advanced driver-assist system helped them avoid potential accidents on the road. \n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nFSD Beta tester @FrenchieEAP, for example, recently shared a story about a moment when his Model 3 was sitting at a red light with the Full Self-Driving Beta engaged. When the light turned green, the all-electric sedan started moving forward — before braking suddenly. The driver initially thought that the FSD Beta was stopping for no reason, but a second later, the Model 3 owner realized that a cyclist had actually jumped a red light. The FSD Beta just saw the cyclist before he did. \n\n\n\n\n\nSitting at a red light, with FSDBeta engaged. Light turns green, car starts to take off and stops all of the sudden. I’m thinking: “Gosh, this thing is stopping for no reason”. A second passes and this cyclist jumps the red light. The car saw it way before I did. Thanks @elonmusk pic.twitter.com/ZieIYOzH2D— Frenchie (@FrenchieEAP) October 22, 2021\n\n\n\n\n\n\nFellow FSD Beta tester Geoff Coffelt, who also drives a Model 3, shared a somewhat similar experience. According to the Tesla owner, his Model 3 initially refused to go at a green light, and he later realized that this was because another motorist was coming the wrong way up a one-way road that it was turning on to. The Model 3 driver noted that he actually had no idea about the impending danger since he was solely focused on looking for other vehicles that were coming from the proper direction. \n\n\n\nThis particular FSD Beta experience is quite impressive since the advanced driver-assist system effectively prevented an accident that could very well have happened if the Tesla owner was driving manually. Very rarely does a driver assume and check for other motorists that may be counterflowing in a one-way street, after all. In such scenarios, it is far more common for drivers to pay attention to other vehicles that are following the proper flow of traffic. \n\n\n\n\n\nAnother case of Tesla FSD Beta protecting lives already: FSD Beta on Geoff Coffelt's Tesla (@Skate_a_book) detected a car coming from an illegal direction in a one way road the Tesla was turning into on a green light, well before Geoff noticed the ghost driver.Cc: @NHTSAgov https://t.co/UUglOYpX8k— 𝗧𝗲𝘀𝗹𝗮 𝗙𝗮𝗰𝘁𝘀  (@truth_tesla) October 24, 2021\n\n\n\n\n\n\nWhat is rarely discussed in the Tesla Autopilot and FSD Beta debate is the fact that humans are not really very good drivers at all. And most of the time, incidents happen because of human error. The 3,142 fatalities recorded by the National Highway Traffic Safety Administration (NHTSA) in 2019 due to distracted driving are proof that humans are hardly the most careful on the road. If Tesla could effectively refine its Autopilot and Full Self-Driving systems to the point where they could effectively navigate inner-city streets and highways with the utmost safety, then the roads could truly become a much safer place. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla FSD Beta is starting to save lives appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-fsd-beta-saves-lives/","link_type":"article","item_date":1635099983000,"item_id":"292a2dda","timestamp":1635499838273,"domain":"teslarati.com","item_date_formatted":"Oct 24","description_trimmed":"Tesla’s Autopilot and Full Self-Driving Beta are, at their core, safety systems. They may be advanced enough to make driving tasks extremely easy and convenient, but ultimately, CEO Elon Musk has been consistent with the idea that Tesla’s advanced driver-assist technologies are b...","keywords":"Red Light, Fsd Beta, Green Light, Tesla Owner"},{"title":"Tesla Model Y Occupants Walk Away After Their Car Rolls Over 3 Times in Horrific Accident","description":"Photo: Gilbert Tang/Twitter\nTesla cars have an excellent reputation for being the safest on the road. A Tesla Model Y protected its occupants from a terrible accident in which it rolled over three times.On the evening of October 22, Gilbert Tang/Twitter and his wife were driving home. The car was driven at 73 mph. Moments before the impact, Gilbert noticed the headlights of another car in the rearview mirror and realized that it was about to hit them. In such a situation, it is difficult to decide on the right action, since the car could quickly veer to overtake, so staying in the same lane was the best choice.It turned out that the other driver fell asleep at the wheel, and his foot simply dropped to the accelerator, forcing the car to pick up speed. It is difficult to determine for sure the speed at which the other vehicle was moving. Gilbert suggested that it was about 90 mph, but some members of the Tesla community, based on observations, suggested it was in excess of 100 mph. Crashing with such force, Model Y spun 270°, hit the center divider backwards, and rolled three times!Dashcam footage partially captures the terribleness of the accident, as the car can be clearly seen rolling over, continuing to hit the road surface. We can only imagine what horror Gilbert and his wife experienced. It should also be kept in mind that the bodies of the occupants of the car have experienced an incredibly strong physical impact, which could cause irreparable harm to their health and life. However, thanks to the design of Model Y, they were not seriously injured and were able to walk away.\n\nHere's the front #Dashcam. It's wild. pic.twitter.com/TG4Xvg8XeA\n— Gilbert Tang (@gtangjr) October 23, 2021\n\n\n\nThe safety of Tesla vehicles continues to impress, as protecting occupants in the event of an accident is their top priority. All cars of the company have a five-star safety rating, for which they have become some of the most coveted today. Accidents like that of Gilbert are the best proof that Tesla's occupants will be protected if an accident occurs.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-model-3-occupants-walk-away-after-their-car-rolled-over-three-times-in-a-terrible-accident","link_type":"article","item_date":1635096613000,"item_id":"8d792758","timestamp":1635499838131,"domain":"tesmanian.com","item_date_formatted":"Oct 24","description_trimmed":"Photo: Gilbert Tang/Twitter\nTesla cars have an excellent reputation for being the safest on the road. A Tesla Model Y protected its occupants from a terrible accident in which it rolled over three times.On the evening of October 22, Gilbert Tang/Twitter and his wife were driving ...","keywords":"Tesla Model, Car Rolls, Tesla Cars, Protecting Occupants"},{"title":"Tesla Cybertruck looks absolutely unreal in new teaser footage","description":"The Tesla Cybertruck’s initial production may have been moved to late 2022, but this does not mean that the excitement for the imposing all-electric pickup truck is abating anytime soon. A look at Tesla’s new minute-long Cybertruck teaser all but proves this, as it is quite difficult not to feel excited about the vehicle after viewing the short video. \n\n\n\nTesla’s new Cybertruck teaser was shared online by electric vehicle advocate Harsimran Bansal, who happened to record the clip while he was visiting one of the company’s showrooms. The video featured the Cybertruck in both urban and outdoor environments, and it’s hard to deny — the all-electric pickup truck looks pretty sick in both environments. In city streets, it looks like a vehicle from the future, and on a work site like Giga Texas, it just looks at home. \n\n\n\n\n\nHere you go, head on Cybertruck footage! pic.twitter.com/fQfGe0FWol— Harsimran Bansal (@harsimranbansal) October 20, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nArguably the most interesting scenes in the new Tesla Cybertruck teaser involved the all-electric pickup truck drifting around in a field. Due to the Cybertruck’s design, the scene almost made it seem like the vehicle was CGI or a miniature version of the truck that’s being remote-controlled in a backyard. The same goes for the Cybertruck’s scenes in Gigafactory Texas, as it looked pretty otherworldly beside the domineering construction machines being used in the complex. \n\n\n\nElon Musk has frequently commented on how the Cybertruck looks almost unreal and how the vehicle is essentially CGI in real life. Tesla’s new teaser for the all-electric pickup truck all but highlights this point even further. In several sections of the video, after all, one would almost have to look twice to confirm if the vehicle in the frame was legitimate or not. It would then be quite interesting to see how conventional drivers would react once production Cybertrucks start populating the road. \n\n\n\n\nTesla Cybertruck with side mirrors and “rear-wheel steering” spotted in the wild\n\n\n\n\n\nRecent comments from the Q3 2021 earnings call have revealed that Tesla has already built several alpha Cybertruck prototypes. One such vehicle appears to have been sighted recently while it was testing at the Castle Airport in Atwater, California. The Cybertruck prototype was spotted from a distance, but it was evident that the all-electric pickup truck was already fitted with side mirrors, which Elon Musk later noted would be removable. The updated Cybertruck also seemed to be testing its rear-wheel steering system in the sighting. \n\n\n\nWatch Tesla’s new Cybertruck teaser in the video below. \n\n\n\n\n\n\n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla Cybertruck looks absolutely unreal in new teaser footage appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-cybertruck-new-preview-video/","link_type":"article","item_date":1635092307000,"item_id":"9c54d15a","timestamp":1635499838415,"domain":"teslarati.com","item_date_formatted":"Oct 24","description_trimmed":"The Tesla Cybertruck’s initial production may have been moved to late 2022, but this does not mean that the excitement for the imposing all-electric pickup truck is abating anytime soon. A look at Tesla’s new minute-long Cybertruck teaser all but proves this, as it is quite diffi...","keywords":"Pickup Truck, Tesla Cybertruck, Cybertruck Teaser, All Electric"},{"title":"Tesla CFO: “Profound awakening” of EV desirability has caught company off-guard","description":"Tesla has never had a problem with desirability. Starting with the Model 3, consumer interest in the company’s electric cars has startled even CEO Elon Musk at times. That frenzy continued with the Cybertruck. And demand for the company’s volume models, the Model Y and Model 3, is by no means softening; even with the entry of competing...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133959_tesla-cfo-profound-awakening-of-ev-desirability-has-caught-company-off-guard","link_type":"article","item_date":1635076800000,"item_id":"c2b57bf1","timestamp":1635499838431,"domain":"greencarreports.com","item_date_formatted":"Oct 24","description_trimmed":"Tesla has never had a problem with desirability. Starting with the Model 3, consumer interest in the company’s electric cars has startled even CEO Elon Musk at times. That frenzy continued with the Cybertruck. And demand for the company’s volume models, the Model Y and Model 3, i...","keywords":"Volume Models, Tesla Cfo, Ev Desirability, Means Softening"},{"title":"Nevada Becomes 16th Clean Cars State, &amp; Model For Others","description":"Originally published by NRDC, Expert Blog. By Simon Mui Nevada became the 16th state in the nation to adopt clean cars yesterday, after the Legislative Commission approved the Clean Cars Nevada program in a bipartisan vote. The vote marked the final approval step after the Nevada State Environmental Commission voted unanimously supported the program in July. The […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/23/nevada-becomes-16th-clean-cars-state-model-for-others/","link_type":"article","item_date":1635037234000,"item_id":"b956d55b","timestamp":1635499838433,"domain":"cleantechnica.com","item_date_formatted":"Oct 24","description_trimmed":"Originally published by NRDC, Expert Blog. By Simon Mui Nevada became the 16th state in the nation to adopt clean cars yesterday, after the Legislative Commission approved the Clean Cars Nevada program in a bipartisan vote. The vote marked the final approval step after the Nevada...","keywords":""},{"title":"EXCLUSIVE Dutch forensic lab says it has decoded Tesla's driving data","description":"EXCLUSIVE Dutch forensic lab says it has decoded Tesla's driving data","author":"TeslaTracker Submissions","url":"https://www.reuters.com/business/autos-transportat","link_type":"article","item_date":1635009609000,"item_id":"e70dde42","timestamp":1635499838122,"domain":"reuters.com","item_date_formatted":"Oct 23","description_trimmed":"EXCLUSIVE Dutch forensic lab says it has decoded Tesla's driving data","keywords":""},{"title":"Tesla FSD Beta v10.3 delayed, ‘probably’ releasing Sunday, Musk says","description":"Tesla’s newest version of the Full Self-Driving Beta was delayed from Friday to Sunday, according to CEO Elon Musk. If you were expecting to receive a new bi-weekly download and didn’t receive it, it will “probably” release tomorrow, the CEO said.\nTesla has been releasing new versions of the FSD Beta to members of the Beta testing pool every other Friday. However, some releases are delayed for unexpected reasons, including bugs found in the software before release. Due to Tesla’s commitment to safety and consistent strive for perfection with the Full Self-Driving suite, it will not release an update unless everything looks perfect.\nMusk said that there were some regressions found in left turns at traffic lights, so the software team will work to iron out these bugs over the weekend. Tesla still plans to release the software by tomorrow.\n\nRegression in some left turns at traffic lights found by internal QA in 10.3. Fix in work, probably releasing tomorrow.\n— Elon Musk (@elonmusk) October 23, 2021\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTesla has done a reasonable job of staying on schedule with its software update releases for the FSD Beta. However, unexpected delays do occur, and this will prevent the newest version from performing under the company’s expectations, which has happened in the past. In August, Musk admitted that FSD Beta 9.2 was “not great,” which can be expected while the software is still in its Beta stage. Improvements occur with every mile driven thanks to Tesla’s Neural Network and the bi-weekly updates that the company rolls out.\nThe new update will roll out to Tesla drivers with a Safety Score of 99 or above, Musk confirmed. In an effort to expand its Beta program, Tesla has started rolling out Software Updates to members with scores lower than the perfect 100. However, if you are in the Beta program, it is important to remain attentive and use the Full Self-Driving suite responsibly. Tesla is committed to safety first, and any drivers utilizing the Beta program irresponsibly are being removed, Musk confirmed in a Tweet to Teslarati earlier this week.\n\nWe are\n— Elon Musk (@elonmusk) October 21, 2021\n\n\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla FSD Beta v10.3 delayed, ‘probably’ releasing Sunday, Musk says appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-full-self-driving-beta-10-3-probably-release-sunday-elon-musk/","link_type":"article","item_date":1635006582000,"item_id":"117566f6","timestamp":1635499838474,"domain":"teslarati.com","item_date_formatted":"Oct 23","description_trimmed":"Tesla’s newest version of the Full Self-Driving Beta was delayed from Friday to Sunday, according to CEO Elon Musk. If you were expecting to receive a new bi-weekly download and didn’t receive it, it will “probably” release tomorrow, the CEO said.\nTesla has been releasing new ver...","keywords":"Fsd Beta, Releasing Sunday, Beta Program, Musk Confirmed"},{"title":"Great Scott! Electrify America Hits 1.21 GW of Power with Porsche","description":"Great Scott! Electrify America Hits 1.21 GW of Power with Porsche","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/porsche-taycan-electrify-america-back-to-the-future-day-chargers/","link_type":"article","item_date":1634774400000,"item_id":"be6c7059","timestamp":1635499838432,"domain":"motortrend.com","item_date_formatted":"Oct 21","description_trimmed":"Great Scott! Electrify America Hits 1.21 GW of Power with Porsche","keywords":""}],"item_upvotes":{"81e2497b":{"auth0|615cb90b861e13006987e6c1":true},"9752f133":{"auth0|615cb90b861e13006987e6c1":true},"525fb9fc":{"auth0|615cb90b861e13006987e6c1":true},"4e4ae40f":{"auth0|615cb90b861e13006987e6c1":true},"173a96e9":{"auth0|615cb90b861e13006987e6c1":true},"38b54873":{},"08a85c3c":{"auth0|615cb90b861e13006987e6c1":true},"0b914140":{"auth0|615cb90b861e13006987e6c1":true}},"user_favorites":{"auth0|615cb90b861e13006987e6c1":[{"item_id":"4a7ed1c0","action_date":1634188847270},{"item_id":"ac1f4744","action_date":1634188998838},{"item_id":"6c12d760","action_date":1634191599061},{"item_id":"17dff6cb","action_date":1634191604066},{"item_id":"525fb9fc","action_date":1634351511045},{"item_id":"81e2497b","action_date":1634596163543},{"item_id":"4e4ae40f","action_date":1634598046648},{"item_id":"173a96e9","action_date":1634598047329},{"item_id":"38b54873","action_date":1634598068442},{"item_id":"0b914140","action_date":1636060117912}]},"user_upvotes":{"auth0|615cb90b861e13006987e6c1":[{"item_id":"81e2497b","action_date":1634353534128},{"item_id":"9752f133","action_date":1634594816949},{"item_id":"525fb9fc","action_date":1634594826435},{"item_id":"173a96e9","action_date":1634596929344},{"item_id":"4e4ae40f","action_date":1634598051844},{"item_id":"08a85c3c","action_date":1634958279039},{"item_id":"0b914140","action_date":1636060124803}]}}