{
  "etag": "W/\"39ad1a991f696169c1583d464ee39e54\"",
  "items": [
    {
      "title": "Good News: Ford and GM Are Competing on EV Investments",
      "description": "First came Ford's $11.4 billion investment in Tennessee and Kentucky. GM followed with more plans of its own. The EV competition continues to heat up.",
      "author": "Latest Content - Car and Driver",
      "url": "https://www.caranddriver.com/features/a37930458/ford-gm-ev-investments/",
      "link_type": "article",
      "item_date": 1634324400000,
      "item_id": "81e2497b",
      "timestamp": 1634328895425,
      "domain": "caranddriver.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "First came Ford's $11.4 billion investment in Tennessee and Kentucky. GM followed with more plans of its own. The EV competition continues to heat up.",
      "keywords": "Ev Investments, Billion Investment, Heat Up"
    },
    {
      "title": "Jefferies Raises Tesla TSLA PT to $950 &amp; FY’21 Adj EPS by +9%",
      "description": "Tesla (NASDAQ: TSLA) performed well throughout 2021, and the Q3 results have instilled even more confidence in investors. Despite global logistical challenges and a shortage of semiconductors, Tesla has done a much better job in manufacturing and delivering cars than any other player in the industry. In addition, the “higher capacity ramp and sustained demand” deserved an increase in price target to $950 from $850, FY'21 Adj EPS by +9% to $5.59, and FY'22 Adj EPS by +8% to $8.05 from Jefferies.In a note to investors on Friday, the managing director at Jefferies Philippe Houchois made several key takeaways, highlighting that OEMs are lagging far behind Tesla.\n\n\"We raise EBIT estimates 7-9% for 2022-23 and PT to $950 on higher capacity ramp and sustained demand, following further analysis of Q3 data and various sources of information on the soon-to-be launched Berlin facility. For some time the narrative has been legacy OEMs closing the gap; we see little evidence as Tesla continues to challenge at multiple levels. We raise EBIT and margin estimates in contrast with doubts about earnings momentum across legacy OEMs.\"\n\nCapacity ramp and demandJefferies made minor changes to the deliveries estimate for 2021 to 910k, calculating a production exit run-rate of 1.1m, and raised 2022-23 volume to 1.3-1.7m units. Modeling a linear ramp up of production at the low end of guided 5-10k units/week for two similarly sized new facilities in Austin and Berlin, Tesla is set to add at least 500k units of actual capacity in one year to 1.6 million and a solid 200-250k of actual units in 2022, wrote Houchois. The final details of Q3 also showed China domestic sales of 73.6k units, putting to rest concerns about domestic demand, while annualized Q3 output yielded 530k—i.e., demonstrating Shanghai is running at more than full capacity.Simplicity and flowFrom the information Jefferies was able to gather about the new plant in Berlin, they noted that plant design was heavily flow-driven while the aluminum casting of both front and rear underbodies may reduce by close to 40% the number of body-in-white components and robots required for welding and assembly. In a global auto industry plagued by complexity, Tesla continues to reduce complexity and set new standards for simplicity of design and assembly.Semi-conductor sourcingThe firm notes that Tesla is not immune to chip supply disruptions during 2021, but the company has vastly surpassed its competitors in sourcing them. From discussions with a senior expert in semi-conductor sourcing and manufacturing, Jefferies understands this partly reflects Tesla's in-sourcing chip design with an ability to effect rapid re-design and secure more direct sourcing than peers.Raising estimatesJefferies increases 2022-23 estimates close to 6% at revenue level on higher auto deliveries and GAAP EBIT 9-7%, taking 2022 margin above 10% (10.5%) excl ZEV of $750m (raised on expectations of US SAAR recovery in 2022 with still limited domestic EV supply from competitors). The firm's estimates include some modest support to margin from software subscriptions including FSD, which may accelerate in 2022. The firm raises FCF 7-4% including support from WC inflow on accelerated growth.Q3 results after US hours on October 20The firm forecasts Auto/Group revenue $12.5/14.5bn on unit ASP $49k, with auto gross margin 26.1% (ex-ZEV), ZEV income $250m, yielding GAAP EBIT at $1.6bn, 11.2% margin, before some negative Bitcoin mark-to-market of (est $75m), EPS $1.11/1.47 (GAAP/non GAAP), and FCF $1.4bn with support from working capital given intra-Q production seasonality.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below.\nFollow @EvaFoxU",
      "author": "TESMANIAN - Tesmanian Blog",
      "url": "https://www.tesmanian.com/blogs/tesmanian-blog/jefferies-raised-its-tesla-tsla-pt-to-950-and-fy-21-adj-eps-by-9",
      "link_type": "article",
      "item_date": 1634320323000,
      "item_id": "525fb9fc",
      "timestamp": 1634328895201,
      "domain": "tesmanian.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla (NASDAQ: TSLA) performed well throughout 2021, and the Q3 results have instilled even more confidence in investors. Despite global logistical challenges and a shortage of semiconductors, Tesla has done a much better job in manufacturing and delivering cars than any other pl...",
      "keywords": "Adj Eps, Capacity Ramp, Sustained Demand, Tesla Continues"
    },
    {
      "title": "Volkswagen Group BEV delivery numbers still a year behind Tesla, but gaining fast at 138% YOY",
      "description": "Following the release of its Q3 delivery numbers, Volkswagen Group continues to grow its presence in the BEV market, up 109% compared to Q3 last year. Nine months into 2021, Volkswagen has more than doubled its worldwide deliveries, nipping at the heels of Tesla – the current undisputed EV market leader. \nTesla continues to grow as well, and could (maybe) surpass one million deliveries in 2021, but at the rate Volkswagen is moving (up 138% this year), it could be following the trend in 2022.\n more…\nThe post Volkswagen Group BEV delivery numbers still a year behind Tesla, but gaining fast at 138% YOY appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/15/volkswagen-group-bev-delivery-numbers-still-a-year-behind-tesla-but-gaining-fast-at-138-yoy/",
      "link_type": "article",
      "item_date": 1634319260000,
      "item_id": "d0523457",
      "timestamp": 1634328895376,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Following the release of its Q3 delivery numbers, Volkswagen Group continues to grow its presence in the BEV market, up 109% compared to Q3 last year. Nine months into 2021, Volkswagen has more than doubled its worldwide deliveries, nipping at the heels of Tesla – the current und...",
      "keywords": "Gaining Fast, Delivery Numbers, Tesla Continues"
    },
    {
      "title": "Tesla Cybertruck online configurator goes through strange transformation",
      "description": "Tesla’s online Design Studio configurator for the Cybertruck has gone through a strange transformation. Last evening, Tesla removed any mention of the Cybertruck’s three variants, opting for a more straightforward “Buy Now” button that only allows you to place a deposit on the vehicle without choosing which configuration you want to buy.\nIn November 2019, Tesla unveiled the all-electric Cybertruck. Immediately following the event, Tesla owners and enthusiasts were able to put down $100 deposits for the vehicle, securing their position in the extensive Cybertruck ordering queue. Tesla had three variants of the Cybertruck: a Single Motor for $39,990, a Dual Motor for $49,990, and finally, the most robust Tri-Motor variant for $69,990. According to an online Cybertruck order tracker, the vehicle has already accumulated over 1.3 million pre-orders, making Tesla’s backlog for the vehicle extensive and spanning across several years of production efforts.\nTesla has now modified the Cybertruck order page, only giving a single “Buy Now” button that requires a $100 deposit. There is no longer any mention of the vehicle’s several variants.\n\n\n\nCredit: Tesla\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTesla has not released any details regarding the reason for changing the online configurator. Speculation points toward several reasons that include:\n\nTesla may be making changes to the available variants\nTesla’s Cybertruck production date has yet to be finalized and could be changed once again\nTesla’s backlog of orders is so extensive, it is eliminating a customer’s ability to choose a variant, which could ultimately make things easier for the automaker’s initial phases of production.\n\nThe Cybertruck has gone through several design modifications since its unveiling. During an interview, CEO Elon Musk told Joe Rogan that the vehicle would need to be reduced in size by around 3%. Perhaps Tesla could be making more changes to the design, although the company said the design was finalized.\nTesla recently changed the initial production date of the Cybertruck from late 2021 to late 2022. As Gigafactory Texas will be the site of Cybertruck production, the factory is still not yet completed. The Tesla Model Y will be the first vehicle produced at the facility anyway, which puts the Cybertruck on the back burner for the production agenda at the Texas factory.\nAdditionally, Tesla’s already overwhelming backlog of orders for the Cybertruck could be so long that the company is just allowing people to pre-order the truck in any form. It could ask pre-orderers to finalize their configuration as their production date nears.\nThe Tesla Cybertruck will be one of the first all-electric pickups on the road, following the Rivian R1T, the GMC Hummer EV, and the Ford F-150 Lightning.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla Cybertruck online configurator goes through strange transformation appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-cybertruck-online-configurator-strange-transformation/",
      "link_type": "article",
      "item_date": 1634318983000,
      "item_id": "3251471f",
      "timestamp": 1634328895355,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla’s online Design Studio configurator for the Cybertruck has gone through a strange transformation. Last evening, Tesla removed any mention of the Cybertruck’s three variants, opting for a more straightforward “Buy Now” button that only allows you to place a deposit on the ve...",
      "keywords": "Variants Tesla, Tesla Cybertruck, Cybertruck Production, Online Configurator"
    },
    {
      "title": "I'm Starting To Think There May Be A Delay With A Tesla Product",
      "description": "I hope I’m wrong. I really hope I’m wrong. But for some reason, I get the feeling that Tesla might possibly deliver a product later than it originally suggested. Read more...",
      "author": "Jalopnik",
      "url": "https://jalopnik.com/im-starting-to-think-there-may-be-a-delay-with-a-tesla-1847871863",
      "link_type": "article",
      "item_date": 1634314800000,
      "item_id": "9752f133",
      "timestamp": 1634328895962,
      "domain": "jalopnik.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "I hope I’m wrong. I really hope I’m wrong. But for some reason, I get the feeling that Tesla might possibly deliver a product later than it originally suggested. Read more...",
      "keywords": "Tesla Product, Read More"
    },
    {
      "title": "Tesla reduces premium connectivity free-period to 30 days for Model 3 and Model Y",
      "description": "Tesla has slashed its included premium connectivity period to 30 days for all Model 3 and Model Y vehicles. People are now going to have to pay sooner if they want to retain access to some of Tesla’s connectivity features.\n more…\nThe post Tesla reduces premium connectivity free-period to 30 days for Model 3 and Model Y appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/15/tesla-reduces-premium-connectivity-free-period-30-days-all-model-3-model-y/",
      "link_type": "article",
      "item_date": 1634313397000,
      "item_id": "7e902f90",
      "timestamp": 1634328895982,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla has slashed its included premium connectivity period to 30 days for all Model 3 and Model Y vehicles. People are now going to have to pay sooner if they want to retain access to some of Tesla’s connectivity features.\n more…\nThe post Tesla reduces premium connectivity free-p...",
      "keywords": ""
    },
    {
      "title": "Cylindrical cells for Tesla, Lucid, Rivian; Outlander PHEV first look; ELMS battery swapping: Today’s Car News",
      "description": "Mitsubishi teases more trail ability in its next Outlander Plug-In Hybrid. Indiana-built electric vans get leading-edge battery tech—and battery swapping. And why do Tesla, Lucid, and Rivian all use cylindrical cells? This and more, here at Green Car Reports. Lucid, Rivian, and Tesla each have the top EVs in their respective classes for...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133884_cylindrical-cells-for-tesla-lucid-rivian-outlander-phev-first-look-elms-battery-swapping-today-s-car-news",
      "link_type": "article",
      "item_date": 1634313300000,
      "item_id": "ba7ee9c8",
      "timestamp": 1634328895965,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Mitsubishi teases more trail ability in its next Outlander Plug-In Hybrid. Indiana-built electric vans get leading-edge battery tech—and battery swapping. And why do Tesla, Lucid, and Rivian all use cylindrical cells? This and more, here at Green Car Reports. Lucid, Rivian, and T...",
      "keywords": "Cylindrical Cells, Battery Swapping"
    },
    {
      "title": "Elon Musk’s Starlink to provide half-gigabit internet connectivity to airlines",
      "description": "It appears that internet connectivity in commercial airlines is about to get a serious boost. As noted by SpaceX CEO Elon Musk in a recent post on Twitter, talks are now ongoing with commercial airlines about the possibility of utilizing Starlink for in-flight internet connectivity. Musk was quite optimistic about the idea, stating that Starlink should provide “low latency, ~half-gigabit” connectivity in the air. \n\n\n\nSpaceX is a company whose mission is to make humans into a multi-planetary species. Yet Starlink, which is designed to bring internet connectivity to even the most remote areas of the globe, stands as one of the private space firm’s most ambitious projects. Starlink aims to set up a constellation of satellites around the planet, which should pave the way for global internet connectivity. \n\n\n\n\n\nYes, we are talking to airlines about installing Starlink. Please let them know if you want it on your airliner. Low latency ~half gigabit connectivity in the air!— Elon Musk (@elonmusk) October 14, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nSo far, SpaceX has launched 1,740 Starlink satellites, and the program currently has about 100,000 users in 14 countries. Starlink is still in public beta, however, with the service being priced at a rather premium $99 per month, on top of a $499 fee for the actual satellite kit. That being said, Elon Musk has noted in September that Starlink should come out of its beta phase in October 2021. \n\n\n\nInterestingly enough, this is not the first time that the idea of using Starlink for aircraft has been mentioned by SpaceX executives. Back in June, SpaceX Vice President Jonathan Hofeller also noted that the private space company is “in talks with several airlines” about adding Starlink in-flight WiFi. Hofeller remarked that SpaceX has already done some demonstrations of the technology, and it is looking to finalize the product in the near future. \n\n\n\n“We have our own aviation product in development … we’ve already done some demonstrations to date and [are] looking to get that product finalized to be put on aircraft in the very near future,” Hofeller said. \n\n\n\nThe SpaceX executive added that Starlink’s “global mesh” of satellites could provide faster internet to airline passengers. “Starlink provides a global mesh (so that) airlines are flying underneath that global mesh have connectivity anywhere they go. Passengers and customers want a great experience that (geosynchronous satellite internet) systems simply cannot provide,” Hofeller added. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Elon Musk’s Starlink to provide half-gigabit internet connectivity to airlines appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/elon-musk-starlink-airline-wifi/",
      "link_type": "article",
      "item_date": 1634312745000,
      "item_id": "38b54873",
      "timestamp": 1634328895458,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "It appears that internet connectivity in commercial airlines is about to get a serious boost. As noted by SpaceX CEO Elon Musk in a recent post on Twitter, talks are now ongoing with commercial airlines about the possibility of utilizing Starlink for in-flight internet connectivi...",
      "keywords": "Internet Connectivity, Commercial Airlines, Elon Musk, Global Mesh"
    },
    {
      "title": "Tesla opens Model Y orders in the UK, deliveries expected in early 2022",
      "description": "Tesla today opened Model Y orders in the United Kingdom, a right-hand-drive market, with deliveries expected to start in early 2022.\n more…\nThe post Tesla opens Model Y orders in the UK, deliveries expected in early 2022 appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/15/tesla-opens-model-y-orders-uk-deliveries-expected-early-2022/",
      "link_type": "article",
      "item_date": 1634311926000,
      "item_id": "173a96e9",
      "timestamp": 1634328895979,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla today opened Model Y orders in the United Kingdom, a right-hand-drive market, with deliveries expected to start in early 2022.\n more…\nThe post Tesla opens Model Y orders in the UK, deliveries expected in early 2022 appeared first on Electrek.",
      "keywords": "Deliveries Expected"
    },
    {
      "title": "Tesla Model Y for the UK at last! Prices, specifications, wait time…",
      "description": "https://www.youtube.com/watch?v=OzGKOgplM08",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=OzGKOgplM08",
      "link_type": "article",
      "item_date": 1634303385000,
      "item_id": "4e4ae40f",
      "timestamp": 1634328895853,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "https://www.youtube.com/watch?v=OzGKOgplM08",
      "keywords": "Wait Time, Tesla Model"
    },
    {
      "title": "🇸🇬 Tesla Doubles Deliveries in Singapore! (#6 Car Brand in the Country)",
      "description": "https://www.youtube.com/watch?v=3y62YBCSpK8",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=3y62YBCSpK8",
      "link_type": "article",
      "item_date": 1634303385000,
      "item_id": "74473ea7",
      "timestamp": 1634328895918,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "https://www.youtube.com/watch?v=3y62YBCSpK8",
      "keywords": ""
    },
    {
      "title": "Tesla’s Elon Musk warns and shares advice to Rivian and Lucid about mass production",
      "description": "The electric vehicle landscape is getting more and more crowded, with new companies such as Lucid Motors and Rivian Automotive expected to deliver their first production vehicles to customers soon. Amidst this momentum, and as Rivian aims to go public with an impressive target valuation, Tesla CEO Elon Musk has posted some advice — and a warning of sorts — to the newcomers of the mass EV market. \n\n\n\nMusk’s initial thoughts about new electric car makers came as a response to Tesla bull Warren Redlich, who posted an image highlighting that both Lucid and Rivian are actually yet to deliver a legitimate production vehicle to customers. This contrasts greatly with what happened to Tesla, since the company had already delivered about 1,400 Roadsters before it went public on June 29, 2010 at $17 per share. \n\n\n\n\n\nThese are strange days— Elon Musk (@elonmusk) October 14, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nRivian’s filings have revealed that the company is looking to get a valuation of about $80 billion when it goes public. This is quite substantial considering that the only deliveries of the R1T pickup truck that have been reported so far were to company employees. A recent report from Bloomberg noted that Rivian is looking to focus its deliveries this year on its Amazon electric delivery van, which would likely result in R1T deliveries being very conservative in the near future. \n\n\n\n\n\nIf it possible to start an EV company without shipping any cars &amp; get a valuation less than a billion dollars!?— Elon Musk (@elonmusk) October 14, 2021\n\n\n\n\n\n\nLucid is a bit on the same boat, as the company has gone public without first delivering its highly-anticipated Air luxury sedan. So far, Lucid has stated that it is looking to start deliveries of the Air in late October. However, Lucid is only planning on producing 577 Air sedans in 2021, as per a Forbes report. \n\n\n\nCommenting on the valuation of Lucid and Rivian, Elon Musk added that “(Is) it possible to start an EV company without shipping any cars &amp; get a valuation less than a billion dollars!?” In a later post on Twitter, Musk shared more of his thoughts. According to the Tesla CEO, he is hoping that the newcomers to the EV sphere have a high tolerance for pain since scaling production, managing the supply chain, logistics, and service is a “world of hurt.”\n\n\n\n\n\nI hope they have a high pain tolerance. Scaling production, supply chain, logistics &amp; service is a world of hurt.— Elon Musk (@elonmusk) October 14, 2021\n\n\n\n\n\n\nThis is not the first time that Elon Musk has posted a warning about the challenges of mass production. During the Q2 2021 earnings call, Musk reiterated these thoughts while describing how difficult it was to actually ramp the production of Tesla’s 4680 battery cells. Musk noted that in the 4680 batteries’ case, producing them in prototype form was incredibly easy, but ramping their output to a meaningful level was a completely different beast altogether. \n\n\n\n“Limited production is easy, prototype production is easy but high-volume production is hard. There are a number of challenges in transitioning from sort of small-scale production to a large volume production,” Musk said. Considering Tesla’s experiences with “production hell” when it was ramping the Model 3, upcoming EV makers such as Rivian and Lucid would be wise to take note of Musk’s warnings and advice. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla’s Elon Musk warns and shares advice to Rivian and Lucid about mass production appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-elon-musk-warning-advice-rivian-lucid/",
      "link_type": "article",
      "item_date": 1634302812000,
      "item_id": "a0b3669a",
      "timestamp": 1634328895535,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "The electric vehicle landscape is getting more and more crowded, with new companies such as Lucid Motors and Rivian Automotive expected to deliver their first production vehicles to customers soon. Amidst this momentum, and as Rivian aims to go public with an impressive target va...",
      "keywords": "Shares Advice, Ev Company, Scaling Production, Mass Production"
    },
    {
      "title": "2022 Porsche Taycan: A Tesla Rival That’s Eye-Catching—but Pricey",
      "description": "The all-electric Porsche Taycan Turbo S Cross Turismo costs more and has a shorter range than Tesla. But with relatively few in production, this gorgeously styled roadster has the power to make people look twice.",
      "author": "TeslaTracker Submissions",
      "url": "https://www.wsj.com/articles/2022-porsche-taycan-a",
      "link_type": "article",
      "item_date": 1634301003000,
      "item_id": "7087e148",
      "timestamp": 1634328895988,
      "domain": "wsj.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "The all-electric Porsche Taycan Turbo S Cross Turismo costs more and has a shorter range than Tesla. But with relatively few in production, this gorgeously styled roadster has the power to make people look twice.",
      "keywords": "Porsche Taycan"
    },
    {
      "title": "Jefferies raises Tesla (TSLA) price target to $950 over strong demand, growing capacity",
      "description": "Tesla stock (NASDAQ:TSLA) recently received an optimistic outlook from Jefferies Equity Research, with analyst Philippe Houchois raising his price target on the automaker from $850 to $950 per share. Jefferies cited several reasons behind its update on TSLA stock, though the analyst noted that part of it is due to the growing gap between Tesla and legacy OEMs. \n\n\n\n“We raise EBIT estimates 7-9% for 2022-23 and PT to $950 on higher capacity ramp and sustained demand, following further analysis of Q3 data and various sources of information on the soon-to-be-launched Berlin facility. For some time, the narrative has been legacy OEMs closing the gap; we see little evidence as Tesla continues to challenge at multiple levels. We raise EBIT and margin estimates in contrast with doubts about earnings momentum across legacy OEMs,” Houchois wrote in a note. \n\n\n\n\n\nAfter market close, Jefferies raised its $TSLA PT to $950 from $850, and FY’21 Adj EPS by +9% to $5.59 (Street $5.41) and FY’22 Adj EPS by +8% to $8.05 (Street $7.36). Rationale: “higher capacity ramp and sustained demand;” specifically, Berlin opening and China 3Q demand. pic.twitter.com/nNpnY3lRUu— Gary Black (@garyblack00) October 14, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nThe Jefferies analyst noted that the demand has so far been stable for Tesla, and the company’s production capacity is getting better too. With strong demand and an ability to produce more of its products, Tesla could cater to substantially more consumers in the near future. Houchois estimated that even with a linear ramp, the addition of Giga Berlin and Giga Texas should add at least 500k units of actual capacity in one year. The analyst also noted that considering China’s recent results, concerns about domestic demand in the world’s largest EV market might be overblown. \n\n\n\n“We make minor changes to 2021 delivery estimates (910k), calculating production exit run-rate of 1.1m, and raise 2022-23 volume to 1.3-1.7m units. Modeling a linear ramp-up of production at the low end of guided 5-10k units/week for two similarly sized new facilities in Austin and Berlin, Tesla is set to add at least 500k units of actual capacity in one year to 1.6million and a solid 200-250k of actual units in 2022. \n\n\n\n\nTesla China posts astounding September numbers with 56k vehicle deliveries\n\n\n\n\n\n“The final details of Q3 also showed China domestic sales of 73.6k units, putting to rest concerns about domestic demand, while annualized Q3 output yields 530k, i.e., Shanghai running at more than full capacity. Ytd Tesla delivered slightly more units than produced despite a still “immature” production network with cross-continent shipping accounting for c.20% of total production. Localizing production should improve delivery timing and associated transit costs,” Houchois wrote. \n\n\n\nApart from these, the Jefferies analyst noted that based on the information it could gather from Giga Berlin, the plant seems to be heavily designed for simplicity. This should make it easier for the company to produce vehicles like the Made-in-Germany Model Y in a manner that is extremely cost-efficient and relatively simple. This, together with Tesla’s capability to weather the chip shortage crisis by adapting its products to what components are available, should allow the company to keep an edge against its peers. \n\n\n\n\nTesla Giga Berlin’s first goal is to produce one Model Y body every 45 seconds\n\n\n\n\n\n“From the information we could gather on the new Berlin facility, we noted that plant design was heavily flow-driven while the aluminum casting of both front and rear underbodies may reduce by c.40% the number of body-in-white components and robots required for welding and assembly. In a global auto industry plagued by complexity, Tesla continues to reduce complexity and set new standards for simplicity of design and assembly.\n\n\n\n“Whilst Tesla has not been immune to supply disruptions in the course of 2021, it has outperformed peers in sourcing semi-conductors. From discussions with a senior expert in semi-conductor sourcing and manufacturing, we understand this partly reflects Tesla in-sourcing chip design with an ability to effect rapid re-design and secure more direct sourcing than peers,” the Jefferies analyst wrote. \n\n\n\nDisclaimer: I own TSLA stock. \n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Jefferies raises Tesla (TSLA) price target to $950 over strong demand, growing capacity appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-tsla-jefferies-upgrade-demand-capacity/",
      "link_type": "article",
      "item_date": 1634295291000,
      "item_id": "14eccf9c",
      "timestamp": 1634328895645,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla stock (NASDAQ:TSLA) recently received an optimistic outlook from Jefferies Equity Research, with analyst Philippe Houchois raising his price target on the automaker from $850 to $950 per share. Jefferies cited several reasons behind its update on TSLA stock, though the anal...",
      "keywords": "Strong Demand, Sustained Demand, Domestic Demand, Berlin Facility"
    },
    {
      "title": "Tesla debuts new car insurance that uses Texans’ real-time driving behavior",
      "description": "Mariella Moon\n\t\t\t\t\t\tContributor\n\t\t\n\n\t\t\t\n\n\t\t\n\t\tMariella Moon is an associate editor at Engadget.\t\n\t\n\t\t\n\t\tMore posts by this contributor\n\t\t\n\t\t\t\t\t\t1Password’s new feature lets you safely share passwords using just a link\n\t\t\t\t\t\tAlphabet’s Wing tests drone deliveries from shopping center rooftops in Australia\n\t\t\t\t\t\n\t\n\t\nTesla now offers car insurance in Texas, its new home state, a couple of years after launching the product in California. According to Electrek, though, the insurance available to Texans is quite different than the one owners can get in The Golden State: It calculates for a customer’s insurance premium using their real-time driving behavior. Their credit, age and gender that are typically used by other insurance providers apparently don’t matter to Tesla. The automaker says it won’t even look at customers’ claim history and driving records.\nInstead, Tesla will look at their “safety scores,” which is a feature it introduced with the Full Self-Driving Beta version released in September. That could make things quite tricky, since the premium that needs to be paid can change every month based on the conditions the driver encounters on the road. Every forced collision warning and forced Autopilot disengagement will affect their score. Following other vehicles from an unsafe distance, braking too hard and turning corners aggressively could lower their score, as well. Safety score is still a beta feature at this point, and Tesla said it should improve over time.\nOwners can now apply for a quote, wherein which the automaker will assume a 90 safety score to start their policy. The price will depend on the client’s performance after that, and it could be higher or lower than what a traditional provider charges. During Tesla’s shareholder meeting, where its new home state was also revealed, Elon Musk said the company plans to upgrade its offering in California to be based on real-time driving behavior, as well. It’s not allowed to implement the change just yet, but it’s currently trying to ask permission from regulators.\nEditor’s note: This article originally appeared on Engadget.",
      "author": "TechCrunch",
      "url": "https://techcrunch.com/2021/10/15/tesla-debuts-new-car-insurance-that-uses-texans-real-time-driving-behavior/",
      "link_type": "article",
      "item_date": 1634294558000,
      "item_id": "d15e6ff1",
      "timestamp": 1634328896064,
      "domain": "techcrunch.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Mariella Moon\n\t\t\t\t\t\tContributor\n\t\t\n\n\t\t\t\n\n\t\t\n\t\tMariella Moon is an associate editor at Engadget.\t\n\t\n\t\t\n\t\tMore posts by this contributor\n\t\t\n\t\t\t\t\t\t1Password’s new feature lets you safely share passwords using just a link\n\t\t\t\t\t\tAlphabet’s Wing tests drone deliveries from shopping cen...",
      "keywords": "Safety Score, Real Time, Driving Behavior, Home State"
    },
    {
      "title": "Tesla Megapack batteries in Victoria return with a flourish with new output record",
      "description": "submitted by    /u/chrisdh79   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/q8l6nb/tesla_megapack_batteries_in_victoria_return_with/",
      "link_type": "article",
      "item_date": 1634291938000,
      "item_id": "b4a05fbf",
      "timestamp": 1634328895960,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "submitted by    /u/chrisdh79   [link]   [comments]",
      "keywords": "Victoria Return"
    },
    {
      "title": "Tesla removes Cybertruck specs and prices from its website",
      "description": "Tesla has updated its Cybertruck webpage to removes Cybertruck specs and prices for each configuration of the electric pickup truck.\nIt comes after the highly-anticipated electric vehicle has been delayed to next year.\n more…\nThe post Tesla removes Cybertruck specs and prices from its website appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/15/tesla-removes-cybertruck-specs-prices-from-website/",
      "link_type": "article",
      "item_date": 1634291587000,
      "item_id": "2d44e1ab",
      "timestamp": 1634328896116,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla has updated its Cybertruck webpage to removes Cybertruck specs and prices for each configuration of the electric pickup truck.\nIt comes after the highly-anticipated electric vehicle has been delayed to next year.\n more…\nThe post Tesla removes Cybertruck specs and prices fro...",
      "keywords": "Cybertruck Webpage"
    },
    {
      "title": "Tesla removes Cybertruck configurations from website. No mentions of locking in FSD price.",
      "description": "submitted by    /u/Smadanek   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/q8jbfa/tesla_removes_cybertruck_configurations_from/",
      "link_type": "article",
      "item_date": 1634283295000,
      "item_id": "25f21fbe",
      "timestamp": 1634328895990,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "submitted by    /u/Smadanek   [link]   [comments]",
      "keywords": "Fsd Price"
    },
    {
      "title": "The battle for Motor City: why Ford chose Tennessee for its electric factory",
      "description": "US automaker drawn by ‘shovel ready’ sites, incentives and cheap energy costs",
      "author": "Electric vehicles",
      "url": "https://www.ft.com/content/a91a1349-84d2-4a66-bd64-891a65e6792e",
      "link_type": "article",
      "item_date": 1634270430000,
      "item_id": "775eea97",
      "timestamp": 1634328896101,
      "domain": "ft.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "US automaker drawn by ‘shovel ready’ sites, incentives and cheap energy costs",
      "keywords": "Motor City, Electric Factory"
    },
    {
      "title": "SunPower &amp; Tesla Solar — Rooftop Solar Comparison",
      "description": "As part of my family’s journey to learn more about residential renewable energy, I decided to look into solar panels for our house. We are in the middle of Texas, and who can forget power going out for one week across the entire state in February. We were fortunate, but many of our neighbors had […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/14/sunpower-tesla-solar-rooftop-solar-comparison/",
      "link_type": "article",
      "item_date": 1634270234000,
      "item_id": "e6ddd300",
      "timestamp": 1634328895985,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "As part of my family’s journey to learn more about residential renewable energy, I decided to look into solar panels for our house. We are in the middle of Texas, and who can forget power going out for one week across the entire state in February. We were fortunate, but many of o...",
      "keywords": "Tesla Solar, Solar Panels, Sunpower Amp, Forget Power"
    },
    {
      "title": "All Tesla Superchargers to have WiFi access, reaffirms Elon Musk",
      "description": "Recently, Elon Musk reaffirmed that Tesla owners will have WiFi access at Superchargers. The EV maker is expected to open its Supercharger Network to non-Tesla electric vehicles soon. It would then be an excellent time for the company to upgrade its Supercharger stations with WiFi for incoming drivers. \n\n\n\nBack in April 2019, Elon Musk stated that all Tesla Superchargers will have free WiFi over time. “It will enable video when parked &amp; connected to WiFi. All Tesla Superchargers will have WiFi over time,” Musk answered, replying to a question on Twitter. \n\n\n\n\n\nThey will— Elon Musk (@elonmusk) October 14, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nBased on a recent Twitter interaction, Tesla still plans to give WiFi access to drivers using the Supercharger Network. Some Supercharger stations still don’t offer WiFi to drivers, but Musk reiterated that all of them will eventually. \n\n\n\nOver the next few months to years, the electric car maker will likely revisit its existing Supercharger stations worldwide because it plans to open them to non-Tesla EVs. Tesla plans to open its Supercharger Network to other EV brands soon. Based on recent reports, the company might open Supercharger stations in Europe first. \n\n\n\nOpening Supercharger stalls to non-Tesla owners will likely increase the foot traffic and wait times at stations. To accommodate Tesla vehicles and other EVs, the company would likely have to add more Supercharger stalls to its stations. As it adds more Supercharger stalls, Tesla could also start setting up WiFi hotspots at each station. \n\n\n\nOne viable strategy Tesla could adopt to add WiFi connection to Supercharger stations is to work with SpaceX. Elon Musk’s private space company has been steadily making headways with its Starlink satellite internet service. In September, Musk said that Starlink would come out of the beta phase this month. A Tesla-SpaceX partnership is not totally out of the question. Both Elon Musk-led companies have intermingled now and then. \n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post All Tesla Superchargers to have WiFi access, reaffirms Elon Musk appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/all-tesla-superchargers-to-have-wifi-access-reaffirms-elon-musk/",
      "link_type": "article",
      "item_date": 1634262776000,
      "item_id": "0d69b481",
      "timestamp": 1634328896020,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Recently, Elon Musk reaffirmed that Tesla owners will have WiFi access at Superchargers. The EV maker is expected to open its Supercharger Network to non-Tesla electric vehicles soon. It would then be an excellent time for the company to upgrade its Supercharger stations with WiF...",
      "keywords": "Tesla Superchargers, Supercharger Stations, Supercharger Network, Wifi Access"
    },
    {
      "title": "Tesla officially launches its insurance using ‘real-time driving behavior’, starting in Texas",
      "description": "Tesla has now officially launched its insurance product using “real-time driving behavior”.\nThe product is only available in Texas for now.\n more…\nThe post Tesla officially launches its insurance using ‘real-time driving behavior’, starting in Texas appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/14/tesla-officially-launches-insurance-using-real-time-driving-behavior-texas/",
      "link_type": "article",
      "item_date": 1634262700000,
      "item_id": "9741a647",
      "timestamp": 1634328896117,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "Tesla has now officially launched its insurance product using “real-time driving behavior”.\nThe product is only available in Texas for now.\n more…\nThe post Tesla officially launches its insurance using ‘real-time driving behavior’, starting in Texas appeared first on Electrek.",
      "keywords": "Driving Behavior, Real Time, Officially Launched"
    },
    {
      "title": "The NHTSA Wants Tesla To Declare A Recall For An Industry-Leading Software Update",
      "description": "By Zach Shahan and Johnna Crider The Associated Press reports that the National Highway Traffic Safety Administration (NHTSA) is upset over a Tesla software update to some of its vehicles. The update allowed them to detect and slow down for emergency response lights. Yes, you read that right. The transportation safety agency is unhappy Tesla […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/14/the-nhtsa-wants-tesla-to-declare-a-recall-for-a-software-update/",
      "link_type": "article",
      "item_date": 1634260101000,
      "item_id": "0be91411",
      "timestamp": 1634328896158,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "By Zach Shahan and Johnna Crider The Associated Press reports that the National Highway Traffic Safety Administration (NHTSA) is upset over a Tesla software update to some of its vehicles. The update allowed them to detect and slow down for emergency response lights. Yes, you rea...",
      "keywords": "Software Update, Update Allowed, Unhappy Tesla, Zach Shahan"
    },
    {
      "title": "2022 Ford Mustang Mach-E Pros and Cons Review: SUV or Sports Car?",
      "description": "2022 Ford Mustang Mach-E Pros and Cons Review: SUV or Sports Car?",
      "author": "EV News - The Latest Electric Car, Truck, and SUV News and Updates",
      "url": "https://www.motortrend.com/news/ford-mustang-mach-e-motortrend-suv-of-the-year-finalist/",
      "link_type": "article",
      "item_date": 1634256000000,
      "item_id": "b6efe506",
      "timestamp": 1634328896018,
      "domain": "motortrend.com",
      "item_date_formatted": "Oct 15",
      "description_trimmed": "2022 Ford Mustang Mach-E Pros and Cons Review: SUV or Sports Car?",
      "keywords": "Sports Car"
    },
    {
      "title": "ElectraMeccanica begins customer deliveries of its SOLO EV",
      "description": "EV manufacturer ElectraMeccanica has officially begun customer deliveries of its flagship SOLO EV. The three-wheeled one-seat electric vehicle has been on our radar for quite some time, and ElectraMeccanica has worked for years to reach this point of scaled production and deliveries.\n more…\nThe post ElectraMeccanica begins customer deliveries of its SOLO EV appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/14/electrameccanica-begins-customer-deliveries-of-its-solo-ev/",
      "link_type": "article",
      "item_date": 1634255491000,
      "item_id": "9676b8ae",
      "timestamp": 1634328896376,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "EV manufacturer ElectraMeccanica has officially begun customer deliveries of its flagship SOLO EV. The three-wheeled one-seat electric vehicle has been on our radar for quite some time, and ElectraMeccanica has worked for years to reach this point of scaled production and deliver...",
      "keywords": "Scaled Production"
    },
    {
      "title": "China May Soon Beat Tesla at Its Own Game",
      "description": "China May Soon Beat Tesla at Its Own Game",
      "author": "Hyperdrive - Bloomberg",
      "url": "https://www.bloomberg.com/news/articles/2021-10-13/how-green-giant-china-may-soon-beat-tesla-at-its-own-game?srnd=hyperdrive",
      "link_type": "article",
      "item_date": 1634252484000,
      "item_id": "0deae7e9",
      "timestamp": 1634328896119,
      "domain": "bloomberg.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "China May Soon Beat Tesla at Its Own Game",
      "keywords": "Beat Tesla"
    },
    {
      "title": "Tesla holds lowest vehicle price increase rate as new car prices hit all-time high",
      "description": "Tesla has the lowest vehicle price increase rate from September 2020 to September 2021 of all major automotive manufacturers, a study from Kelley Blue Book shows. The average price of a new car has hit an all-time high in the United States with the average cost increasing by 3.7% from August 2021 to September 2021. The average price of a new car now sits at $45,031.\nKBB data shows the rate of pricing increases from major automakers globally. While every car company in the world was forced to increase prices due to semiconductor shortages and supply chain bottlenecks, the variance of each rate increase was dependent on the automaker. However, some car companies hiked prices significantly more than others. The same cannot be said for Tesla, which increased prices the least of any automaker, and by a considerable margin.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nData from the KBB study shows Tesla’s prices increased by only 1.5% from September 2020 to September 2021. The industry average was 12.1%, mainly driven up by Daimler, which saw 25.8% price increases in the same time period. Other automakers with over 20% price increase rates included Mitsubishi (23.8%), and General Motors (21.6%). The two car companies with the smallest increases were Tesla and Subaru, which only increased prices Year-over-Year by 6.3%.\n\n\n\nCredit: Kelley Blue Book\n\n\n\nTesla’s only sub-$40,000 vehicle is actually the Tesla Cybertruck’s Single Motor variant, which is not scheduled to be built for several years as the company is prioritizing the more expensive, but more capable Dual and Tri-Motor configurations. The Cybertruck will be built at Tesla’s Gigafactory Texas in Austin.\nThe supply chain shortages were not the only thing to blame for the hike in average new car prices, according to KBB’s report. In fact, buyer preferences also helped the average cost of a vehicle go up considerably. KBB said, “the vehicle mix shifted in September away from lower-priced sedans, compacts and entry-level segments toward more-expensive pickups, SUVs and the luxury market.”\nCox Automotive analyst Kayla Reynolds said that September saw a drastic jump in midsize SUV sales compared to August. Full-sized pickup trucks also saw a spike in sales, as well.  “Sales of lower-priced compact and midsize cars, which had been commanding more share during the summer, faded in September. As long as new-vehicle inventory remains tight, we believe prices will remain elevated,” Reynolds added.\nTesla has increased prices of its vehicles on several occasions this year due to demand and parts shortages. However, the most affordable vehicle from the company, the Model 3 SR+, still remains under the national average new car price at $41,990.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla holds lowest vehicle price increase rate as new car prices hit all-time high appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-holds-lowest-vehicle-price-increase-rate-as-new-car-prices-hit-all-time-high/",
      "link_type": "article",
      "item_date": 1634250579000,
      "item_id": "54a1796d",
      "timestamp": 1634328896216,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla has the lowest vehicle price increase rate from September 2020 to September 2021 of all major automotive manufacturers, a study from Kelley Blue Book shows. The average price of a new car has hit an all-time high in the United States with the average cost increasing by 3.7%...",
      "keywords": "Increased Prices, Average Price, Pricing Increases, Prices Increased"
    },
    {
      "title": "Tesla pushes ‘Full Self-Driving Beta’ to investor with poor ‘safety score’ while requiring perfect score from others",
      "description": "Tesla has pushed its “Full Self-Driving Beta” to an investor who had a terrible “safety driving score” based on the automaker’s own scoring system.\nIt comes as Tesla says that it is only pushing the software to owners who scored 100 out of 100.\n more…\nThe post Tesla pushes ‘Full Self-Driving Beta’ to investor with poor ‘safety score’ while requiring perfect score from others appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/14/tesla-pushes-full-self-driving-beta-investor-without-perfect-safety-score/",
      "link_type": "article",
      "item_date": 1634245537000,
      "item_id": "37fbcc85",
      "timestamp": 1634328896377,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla has pushed its “Full Self-Driving Beta” to an investor who had a terrible “safety driving score” based on the automaker’s own scoring system.\nIt comes as Tesla says that it is only pushing the software to owners who scored 100 out of 100.\n more…\nThe post Tesla pushes ‘Full ...",
      "keywords": "Self Driving, Poor Safety"
    },
    {
      "title": "Tesla shareholders vote overwhelmingly to retain Kimbal Musk, James Murdoch on Board",
      "description": "Tesla (NASDAQ: TSLA) shareholders voted overwhelmingly to retain Kimbal Musk, brother of CEO Elon Musk, and James Murdoch on Tesla’s Board of Directors, according to an 8-K filing with the SEC that revealed the number of votes to re-elect the two to the company’s Board for three more years.\nOn October 13th, Tesla filed an 8-K form with the SEC that revealed the number of votes that supported or were against the re-election of both Kimbal Musk and James Murdoch to the Tesla Board. The number of votes for other proposals was also revealed. However, prior to the company’s 2021 Shareholder Meeting on October 7th, proxy advisory firm Institutional Shareholder Services, or ISS, urged Tesla investors to oust both Musk and Murdoch from the Board. Their reasoning was based on the belief that the two non-executive board members did not present any advantages to the automaker’s governance.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n“Votes AGAINST directors James Murdoch and Kimbal Musk are warranted due to concerns regarding excessive compensation to named executive officers and to non-executive directors,” ISS wrote in a note to investors. The firm was adamant that Kimbal’s payout package was not necessarily logical for the company as he did not serve on any board committees. Additionally, ISS felt that Murdoch’s presence on the Tesla Board of Directors also was not justified due to his service on Audit and Governance Committees. The Audit Committee pledged a large sum of company stock to directors, which raised questions regarding its risk oversight. The Governance Committee failed to react appropriately to last year’s Shareholder proposal, which was supported by the majority of voters.\nCEO Elon Musk, Kimbal’s brother, did not support the suggestion, calling ISS “ISIS” in reference to a radical Jihadist group.\n\n“ISIS”\n— Elon Musk (@elonmusk) September 27, 2021\n\n\nTesla Shareholders were evidently not supportive of ISS’ suggestions, either. 411,565,464 Shareholders voted in favor of Murdoch’s retention as a board member, while 473,486,890 supported Kimbal staying on. 175,158,627 and 117,345,144 voted against Murdoch and Kimbal being granted three more years on the Board, respectively.\n“The individuals listed below [Murdoch and Kimbal Musk] were elected as Class II directors at the Annual Meeting to serve on Tesla’s Board of Directors (“Board”) for a term of three years or until their respective successors are duly elected and qualified,” Tesla said in the filing.\nAt the time of writing, Tesla shares were up .70%, trading at $816.95.\nDisclosure: Joey Klender is a TSLA Shareholder.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla shareholders vote overwhelmingly to retain Kimbal Musk, James Murdoch on Board appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-shareholders-vote-overwhelmingly-kimbal-musk-james-murdoch-board-of-directors/",
      "link_type": "article",
      "item_date": 1634245175000,
      "item_id": "da16e39d",
      "timestamp": 1634328896170,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla (NASDAQ: TSLA) shareholders voted overwhelmingly to retain Kimbal Musk, brother of CEO Elon Musk, and James Murdoch on Tesla’s Board of Directors, according to an 8-K filing with the SEC that revealed the number of votes to re-elect the two to the company’s Board for three ...",
      "keywords": "James Murdoch, Kimbal Musk, Tesla Board, October Th"
    },
    {
      "title": "Tesla Has Now Raised Over $1B on its Bitcoin Investment as the Cryptocurrency Nears $58,000",
      "description": "Tesla has now raised over $1 billion on its Bitcoin investment as the price of the cryptocurrency nears $58,000, for the first time since May. The electric car producer originally invested $1.5 billion in Bitcoin, and its investment is now worth about $2.5 billion.According to Bitcoin Magazine's assumptions, Tesla owns 43,200 BTC, which is nearly $2.5 billion at the time of this writing. On February 8, the manufacturer announced that it had updated its investment policy to give itself more flexibility to further diversify and increase the return on its cash, and had acquired $1.5 billion in Bitcoin cryptocurrency. Although the purchase price of the crypto coin was not disclosed, it is reported that the purchase was made in January.Tesla sold 10% of its Bitcoin in Q2 at an average price of about $50,000 per token. CEO Elon Musk later tweeted that Tesla sold 10% of its Bitcoin assets to prove the asset's liquidity and viability as an alternative to cash on its balance sheet. In June, he also wrote that Tesla owns less than 42,069 Bitcoins, although that that number is close. In its Q2 earnings report, Tesla announced that it made a $128 million profit from the sale of Bitcoin.So it is estimated that, since the initial investment in Bitcoin, the carmaker has gained roughly 65%, which equates to roughly $1 billion. In comparison, this is the same as its revenue from the sale of approximately 201,000 vehicles in Q2.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU",
      "author": "TESMANIAN - Tesmanian Blog",
      "url": "https://www.tesmanian.com/blogs/tesmanian-blog/tesla-is-now-raised-over-1-billion-on-its-bitcoin-investment-as-the-price-of-the-cryptocurrency-nears-58-000",
      "link_type": "article",
      "item_date": 1634240843000,
      "item_id": "c0209ea3",
      "timestamp": 1634328896421,
      "domain": "tesmanian.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla has now raised over $1 billion on its Bitcoin investment as the price of the cryptocurrency nears $58,000, for the first time since May. The electric car producer originally invested $1.5 billion in Bitcoin, and its investment is now worth about $2.5 billion.According to Bi...",
      "keywords": "Tesla Owns, Bitcoin Investment, Cryptocurrency Nears, Bitcoin Cryptocurrency"
    },
    {
      "title": "Tesla begins expansion of Kettleman City Supercharger with 56 new stalls, bringing total to 96",
      "description": "Tesla’s planned expansion of the Kettleman City Supercharger in California is evidently underway. The expansion will bring 56 additional V3 Supercharger stalls to the Kettleman City station, bringing the grand total to 96, supplementing the 40-already existing chargers at the site.\nTesla’s Kettleman City Supercharger is one of the most popular in the world. The site not only has 40 Superchargers, some of which already have V3 capabilities allowing for 250kW charging rates, but also a 24-hour customer lounge with restrooms and a gift shop.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTesla initially filed to expand the Kettleman City Supercharging station in late May 2021. Since the location is one of the most popular and also located near Tesla’s Fremont factory, where the company’s vehicles are produced, Tesla owners visit the site frequently to recharge their all-electric vehicles. However, 40 Supercharging stalls just did not seem to be doing the job, so Tesla filed to expand the site, and the construction is underway.\nNew photos from Tesla Motors Club forum member ElectricCyclist, who took several photographs of the ongoing progress of Kettleman City’s expansion. As seen in the pictures, the Superchargers are already placed. The next portion of the project appears to be excavation, asphalt, and line painting. It seems all of the relevant electrical work is already completed, so Tesla may be able to open the site before the end of the year if all goes well.\n\n\n\n\n\n\n\nKettleman City will be among the largest Supercharger stations in the world. The largest will be in Harris Ranch, California, with 100 stalls. There is also a massive 72-stall station in Shanghai and a 56-stall location in Firebaugh, California.\nTesla has had a plan to expand its footprint of V3 Superchargers for some time. Tesla CEO Elon Musk has even hinted that it will upgrade the V3 Superchargers to equip charging speeds of up to 300kW, which would give owners incredibly fast charging speeds. 250kW charge rates allow for up to 1,000 miles per hour of charging time.\nTesla currently has over 25,000 active Supercharger locations worldwide, with plenty more on the way. However, more charging options may be available in the coming years as evidence of an aggressive expansion has been noted on several occasions recently. In China, Tesla launched a dedicated V3 Supercharger production facility that would accelerate the rollout of the company’s fastest Superchargers as the Chinese market continues to adopt EVs.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla begins expansion of Kettleman City Supercharger with 56 new stalls, bringing total to 96 appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-kettleman-city-supercharger-expansion-96-stalls-v3/",
      "link_type": "article",
      "item_date": 1634237955000,
      "item_id": "02387c1f",
      "timestamp": 1634328896458,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla’s planned expansion of the Kettleman City Supercharger in California is evidently underway. The expansion will bring 56 additional V3 Supercharger stalls to the Kettleman City station, bringing the grand total to 96, supplementing the 40-already existing chargers at the sit...",
      "keywords": "Kettleman City, Bringing Total, Supercharging Stalls, Supercharger Stalls"
    },
    {
      "title": "Looking More Closely At Victoria’s Road Usage Tax For Electric Vehicles",
      "description": "Recently, Victoria became the first jurisdiction in the world to introduce a road usage tax for Plug In Electric Vehicles. Other states are planning to follow here in Australia. Victorian EV owners were coerced into sending their odometer details to the government so that the tax can be calculated. If they do not comply, they […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/14/looking-more-closely-at-victorias-road-usage-tax-for-electric-vehicles/",
      "link_type": "article",
      "item_date": 1634237714000,
      "item_id": "331d5848",
      "timestamp": 1634328896472,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Recently, Victoria became the first jurisdiction in the world to introduce a road usage tax for Plug In Electric Vehicles. Other states are planning to follow here in Australia. Victorian EV owners were coerced into sending their odometer details to the government so that the tax...",
      "keywords": "Electric Vehicles, Odometer Details"
    },
    {
      "title": "Tesla Charging &amp; Driving Tips",
      "description": "By William Goodwin FNP As a new owner of a 2016 Tesla Model S 90D for about 6 months now, I have fine tuned a few things that have really improved my driving experience and efficiency. I want to share with new Tesla owners or anyone else who might be interested. Charging: I was charging to […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/14/tesla-charging-driving-tips/",
      "link_type": "article",
      "item_date": 1634232588000,
      "item_id": "54dd2b71",
      "timestamp": 1634328896474,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "By William Goodwin FNP As a new owner of a 2016 Tesla Model S 90D for about 6 months now, I have fine tuned a few things that have really improved my driving experience and efficiency. I want to share with new Tesla owners or anyone else who might be interested. Charging: I was c...",
      "keywords": "Tesla Owners, Tesla Model"
    },
    {
      "title": "Tesla Model S Plaid returns to Nürburgring with active rear spoiler and ‘Track Pack’",
      "description": "Tesla’s insane Model S Plaid active spoiler has been spotted at the Nürburgring racetrack in Germany. Tesla has been attempting to break its own lap record at the raceway, which it set on September 9th.\nTeslarati caught exclusive photos of the Model S Plaid’s active spoiler at the Ring earlier today. Tesla has been at the Nürburgring since August, testing and pushing the limits of the Model S Plaid, the world’s fastest production vehicle. CEO Elon Musk confirmed on September 9th that the Model S Plaid had officially broken the record at the track, nicknamed the Green Hell due to its treacherous course surrounded by thick forestry, with a time of 7:30.909. The vehicle used to set that time was unmodified and was shipped directly to Germany from Tesla’s Fremont factory.\n\nOn the Model S spotted by Teslarati earlier today is an active rear spoiler, which improves aerodynamic performance, including downforce in corners and speed. The spoiler can be adjusted to different angles, allowing the car to run with variable settings to see which would be best for a high-speed run.\n\n\n\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTesla was testing three Model S Plaid units in total: Deep Blue Metallic with the active spoiler and one Red Multi-Coat and a Solid Black. The Red and Black Model S Plaids spotted at the track were not fitted with the active spoiler. Additionally, the Blue and Red Model S Plaid units were also equipped with drilled brakes, allowing harder and faster braking, fitting for a performance setting. Tesla is likely benchmarking the Model S Plaids against one another to see which modifications are providing the most improvements in speed, braking, downforce, and aerodynamics. This will give Tesla the most effective data in determining which settings will create the fastest car.\n\n\n\n\n\n\n\n\n\nIn typical Tesla fashion, the company is not satisfied with just holding a record. It is constantly looking to improve upon perfection, especially when some of the world’s most renowned automakers are frequently at the Nürburgring looking to break speed records and lap times. While the Model S Plaid in stock form holds the track record at the raceway, competitors will have an even more difficult time catching up to Tesla as it has brought modifications that could be a part of an aforementioned “Track Pack” to Germany to drive in its domination even further.\nTesla CEO Elon Musk stated just after the record-setting run at the Ring in September that the automaker would be modifying a Plaid Model S for future runs. Musk said, “Next will be modified Plaid with added aero surfaces, carbon brakes &amp; track tires (all things that can be done without Tesla being in the loop.” Musk was likely referring to the active spoiler and the noticeable front splitter when mentioning added aero surfaces. Brakes and track tires are also being equipped by Tesla here to improve performance.\n\n\n\n\n\nThe Tesla active spoiler on the Model S Plaid was first spotted in May 2021 while the company was testing multiple vehicle units at the Laguna Seca Raceway in California.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla Model S Plaid returns to Nürburgring with active rear spoiler and ‘Track Pack’ appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-model-s-plaid-nurburgring-active-spoiler-track-pack/",
      "link_type": "article",
      "item_date": 1634231371000,
      "item_id": "f79b1812",
      "timestamp": 1634328896438,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla’s insane Model S Plaid active spoiler has been spotted at the Nürburgring racetrack in Germany. Tesla has been attempting to break its own lap record at the raceway, which it set on September 9th.\nTeslarati caught exclusive photos of the Model S Plaid’s active spoiler at th...",
      "keywords": "Active Spoiler, Track Tires, Plaid Returns, September Th"
    },
    {
      "title": "Tesla’s (TSLA) Bitcoin investment is already up by $1 billion",
      "description": "Tesla (TSLA) must be feeling pretty good about its move into cryptocurrency holding, as its stake in Bitcoin is already up by $1 billion.\n more…\nThe post Tesla’s (TSLA) Bitcoin investment is already up by $1 billion appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/14/tesla-tsla-bitcoin-investment-already-up-by-1-billion/",
      "link_type": "article",
      "item_date": 1634228026000,
      "item_id": "81fed695",
      "timestamp": 1634328896476,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla (TSLA) must be feeling pretty good about its move into cryptocurrency holding, as its stake in Bitcoin is already up by $1 billion.\n more…\nThe post Tesla’s (TSLA) Bitcoin investment is already up by $1 billion appeared first on Electrek.",
      "keywords": "Post Tesla, Billion Appeared"
    },
    {
      "title": "Solid-state battery safety, Aptera “never charge” details, Lucid as Tesla rival: Today’s Car News",
      "description": "Solid-state cells pass some first tests for safety. Jay Leno drives the high-mileage Aptera solar EV. And we take a look at what shapes Lucid up, potentially, to become the most direct rival yet to Tesla. This and more, here at Green Car Reports. And Lucid is showing different priorities than other electric vehicle startups and legacy...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133873_solid-state-battery-safety-aptera-never-charge-details-lucid-as-tesla-rival-today-s-car-news",
      "link_type": "article",
      "item_date": 1634226900000,
      "item_id": "c65f06b6",
      "timestamp": 1634328896478,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Solid-state cells pass some first tests for safety. Jay Leno drives the high-mileage Aptera solar EV. And we take a look at what shapes Lucid up, potentially, to become the most direct rival yet to Tesla. This and more, here at Green Car Reports. And Lucid is showing different pr...",
      "keywords": "Tesla Rival, Battery Safety"
    },
    {
      "title": "Efficiency, not range, is what drives Lucid: Is it the first true rival to Tesla?",
      "description": "Rivalry is a good thing. And the electric-car field doesn’t have near enough of it. There’s a delightful start of some happening between Tesla and upstart Lucid, and it’s already shown through in fits and starts. In September 2020, a few weeks after Lucid revealed preliminary range numbers of up to 517 miles for a top version of...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133872_efficiency-not-range-is-what-drives-lucid-is-it-the-first-true-rival-to-tesla",
      "link_type": "article",
      "item_date": 1634225400000,
      "item_id": "96975acc",
      "timestamp": 1634328896477,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Rivalry is a good thing. And the electric-car field doesn’t have near enough of it. There’s a delightful start of some happening between Tesla and upstart Lucid, and it’s already shown through in fits and starts. In September 2020, a few weeks after Lucid revealed preliminary ran...",
      "keywords": "Delightful Start, Upstart Lucid, Drives Lucid, True Rival"
    },
    {
      "title": "NADA to Get Car Dealers Educated So They Can Help Shoppers Buy EVs",
      "description": "The National Auto Dealers Association has selected Chargeway to help its dealer members get comfortable explaining charging, range, and other aspects of EV ownership.",
      "author": "Latest Content - Car and Driver",
      "url": "https://www.caranddriver.com/news/a37954876/nada-car-dealers-help-shoppers-buy-electric-vehicles/",
      "link_type": "article",
      "item_date": 1634223600000,
      "item_id": "e747fbab",
      "timestamp": 1634328896552,
      "domain": "caranddriver.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "The National Auto Dealers Association has selected Chargeway to help its dealer members get comfortable explaining charging, range, and other aspects of EV ownership.",
      "keywords": ""
    },
    {
      "title": "Better Interior Renders in the Tesla App",
      "description": "submitted by    /u/decrego641   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/q818fn/better_interior_renders_in_the_tesla_app/",
      "link_type": "article",
      "item_date": 1634222870000,
      "item_id": "2f816611",
      "timestamp": 1634328896469,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "submitted by    /u/decrego641   [link]   [comments]",
      "keywords": "Interior Renders"
    },
    {
      "title": "Tesla app update adds widgets, Powerwall features, hints at remote live view from Autopilot cameras",
      "description": "Tesla has released a new mobile app update with a few new small features, but it also shows that the automaker has made some progress toward delivering a remote live view from Autopilot cameras on your car.\n more…\nThe post Tesla app update adds widgets, Powerwall features, hints at remote live view from Autopilot cameras appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/14/tesla-app-update-widgets-powerwall-features-remote-live-view-autopilot-cameras/",
      "link_type": "article",
      "item_date": 1634222617000,
      "item_id": "5903f756",
      "timestamp": 1634328896553,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Tesla has released a new mobile app update with a few new small features, but it also shows that the automaker has made some progress toward delivering a remote live view from Autopilot cameras on your car.\n more…\nThe post Tesla app update adds widgets, Powerwall features, hints ...",
      "keywords": "Powerwall Features"
    },
    {
      "title": "Tesla Prepares to Provide Dashcam Live Streaming for Car Owners, Mobile App Source Code Hints",
      "description": "Image: @teslascope/Twitter\nTesla prepares to provide Dashcam Live Streaming for car owners, as mobile app source code hints. In addition, owners will be able to speak into the microphone of their mobile phone and project their voice through the external speaker of the vehicle.Tesla cars have always distinguished themselves in that they could provide additional protection. With external cameras and Sentry Mode, vehicles gain a unique level of protection, continuously monitoring their surroundings when left unattended. When enabled, Sentry Mode enters a “Standby” state, like many home alarm systems, which uses the car’s external cameras to detect potential threats. If a minimal threat is detected, such as someone leaning on a car, Sentry Mode switches to an “Alert” state and displays a message on the touchscreen warning that its cameras are recording. If a more severe threat is detected, such as someone breaking a window, Sentry Mode switches to an “Alarm” state, which activates the car alarm, increases the brightness of the center display, and plays music at maximum volume from the car's audio system.While such a feature is already a great addition in itself, Tesla decided to go even further and provide owners with the ability to watch video footage of the car in real-time. According to @teslascope/Twitter, Tesla is close to presenting the ability to watch video from its cars on owners' mobile devices in real-time, which was discovered in source code. It is reported that this feature may become available in vehicle software update 2021.40. It is not yet clear whether this feature will provide the ability to view footage only in Sentry Mode or receive a live feed from any of the vehicle's cameras.Another feature hidden in the source code is the ability to save the clip after watching it, which is very handy. At the moment, it remains unclear exactly where the clip will be saved—directly to a mobile device or to a car's USB drive.Apart from these already cool things, Tesla decided to provide owners with another awesome feature. According to the source code, the owners will have access to the transmission of their voice through the car speaker. The owner will be able to speak into the microphone of their mobile phone and project it through the car's external speaker. This can greatly help protect your vehicle if suspicious activity is seen near it. Unfortunately, Tesla cars sometimes fall prey to hater aggression. If the owner has access to live video and can say something to an attacker who is trying to harm the vehicle, then this can stop the aggressive behavior.\n\nDashcam Live Streaming is now CONFIRMED in addition to viewing Dashcam clips!You will also be able to speak directly via your mobile phone and project your voice via the PWS (Pedestrian Warning System). pic.twitter.com/g9DVRJVAB6\n— Teslascope (@teslascope) October 14, 2021\n\n\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU",
      "author": "TESMANIAN - Tesmanian Blog",
      "url": "https://www.tesmanian.com/blogs/tesmanian-blog/tesla-prepares-to-provide-dashcam-live-streaming-for-car-owners-mobile-app-code-hints",
      "link_type": "article",
      "item_date": 1634218567000,
      "item_id": "ad1bc8fa",
      "timestamp": 1634328896480,
      "domain": "tesmanian.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Image: @teslascope/Twitter\nTesla prepares to provide Dashcam Live Streaming for car owners, as mobile app source code hints. In addition, owners will be able to speak into the microphone of their mobile phone and project their voice through the external speaker of the vehicle.Tes...",
      "keywords": "Source Code, Mobile Phone, Sentry Mode, Car Owners"
    },
    {
      "title": "Tesla App alerts once the cabin has reached desired temperature. Staring with software version 2021.36 and app version 4.1.1",
      "description": "submitted by    /u/Jazz87   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/q7zr2d/tesla_app_alerts_once_the_cabin_has_reached/",
      "link_type": "article",
      "item_date": 1634218213000,
      "item_id": "a3bceb3f",
      "timestamp": 1634328896374,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "submitted by    /u/Jazz87   [link]   [comments]",
      "keywords": "App Version, Software Version"
    },
    {
      "title": "US asks Tesla why it did not recall Autopilot after software changes",
      "description": "US asks Tesla why it did not recall Autopilot after software changes",
      "author": "TeslaTracker Submissions",
      "url": "https://economictimes.indiatimes.com/tech/tech-byt",
      "link_type": "article",
      "item_date": 1634217467000,
      "item_id": "1d8d752f",
      "timestamp": 1634328896650,
      "domain": "economictimes.indiatimes.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "US asks Tesla why it did not recall Autopilot after software changes",
      "keywords": "Recall Autopilot"
    },
    {
      "title": "Tesla App now shows EDD in the app! Also so close to mine arriving",
      "description": "submitted by    /u/xxTigerShark   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/q7zb74/tesla_app_now_shows_edd_in_the_app_also_so_close/",
      "link_type": "article",
      "item_date": 1634216705000,
      "item_id": "8746eaf0",
      "timestamp": 1634328896550,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "submitted by    /u/xxTigerShark   [link]   [comments]",
      "keywords": "Tesla App, Shows Edd"
    },
    {
      "title": "Tesla Model 3 is now the quickest-selling used car and sometimes even sells for higher price than new",
      "description": "The Tesla Model 3 is now considered the best-selling used car in the US, and it is so popular that it even sometimes sells for higher prices than new.\n more…\nThe post Tesla Model 3 is now the quickest-selling used car and sometimes even sells for higher price than new appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/14/tesla-model-3-is-best-selling-used-car-sells-for-higher-price-than-new/",
      "link_type": "article",
      "item_date": 1634205638000,
      "item_id": "47658ddd",
      "timestamp": 1634328896650,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "The Tesla Model 3 is now considered the best-selling used car in the US, and it is so popular that it even sometimes sells for higher prices than new.\n more…\nThe post Tesla Model 3 is now the quickest-selling used car and sometimes even sells for higher price than new appeared fi...",
      "keywords": "Higher Price, Tesla Model, Higher Prices"
    },
    {
      "title": "A first glimpse of the UI relating to the live-streaming of the Dashcam on the @Tesla mobile app.",
      "description": "submitted by    /u/casualomlette44   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/q7udhy/a_first_glimpse_of_the_ui_relating_to_the/",
      "link_type": "article",
      "item_date": 1634194638000,
      "item_id": "62d1e07c",
      "timestamp": 1634328896541,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "submitted by    /u/casualomlette44   [link]   [comments]",
      "keywords": "Ui Relating, Mobile App"
    },
    {
      "title": "Three Quick Tips for a Higher Tesla Safety Score… and One Secret Weapon",
      "description": "Many Tesla owners who paid for FSD (Full Self Driving) were excited to find out that the FSD Beta test program was being expanded. CEO Elon Musk invited customers to apply to the program and informed them (us) that invitations would be prioritized based on driver behavior. To help make this happen, the company launched  […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/14/three-quick-tips-for-a-higher-tesla-safety-score-and-one-secret-weapon/",
      "link_type": "article",
      "item_date": 1634189831000,
      "item_id": "cb1a6e5e",
      "timestamp": 1634328896651,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 14",
      "description_trimmed": "Many Tesla owners who paid for FSD (Full Self Driving) were excited to find out that the FSD Beta test program was being expanded. CEO Elon Musk invited customers to apply to the program and informed them (us) that invitations would be prioritized based on driver behavior. To hel...",
      "keywords": "Tesla Owners, Fsd Full, Secret Weapon, Quick Tips"
    },
    {
      "title": "Auto-Safety Regulator Questions Tesla Over Driver-Assistance Software",
      "description": "The National Highway Traffic Safety Administration is scrutinizing the electric-car maker over its recent software update and its use of nondisclosure agreements.",
      "author": "WSJ.com: WSJD",
      "url": "https://www.wsj.com/articles/auto-safety-regulator-questions-tesla-over-driver-assistance-software-11634139538?mod=rss_Technology",
      "link_type": "article",
      "item_date": 1634139480000,
      "item_id": "217f002d",
      "timestamp": 1634328896420,
      "domain": "wsj.com",
      "item_date_formatted": "Oct 13",
      "description_trimmed": "The National Highway Traffic Safety Administration is scrutinizing the electric-car maker over its recent software update and its use of nondisclosure agreements.",
      "keywords": "Nondisclosure Agreements"
    },
    {
      "title": "White Tesla Seats After 2 Years",
      "description": "I've owned a White Seat Tesla Model S for over 2 years and 50,000 miles. This video is a review of how the seats have held up against blue jean stain, and wear and tear of my adventures.\n\nWe also cover how to protect your Tesla seats with ceramic coating to make sure your white seats look good for the long term.\n\nOptimum No Rinse Wash &amp; Shine: https://amzn.to/2vjWUjL\nGYEON Quartz LeatherShield 50ml: https://amzn.to/3bFPWGC\n\nCheck out how the seats looked after 1 year here: https://youtu.be/4gdfo8u5zEk",
      "author": "My Tesla Adventure",
      "url": "https://www.youtube.com/watch?v=_GptNE44SgU",
      "link_type": "article",
      "item_date": 1634067660000,
      "item_id": "76690290",
      "timestamp": 1634328895991,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 12",
      "description_trimmed": "I've owned a White Seat Tesla Model S for over 2 years and 50,000 miles. This video is a review of how the seats have held up against blue jean stain, and wear and tear of my adventures.\n\nWe also cover how to protect your Tesla seats with ceramic coating to make sure your white s...",
      "keywords": "White Seats, Tesla Seats, Seats Looked, Year Here"
    },
    {
      "title": "UK energy prices risk deterring car industry investors, warns trade body",
      "description": "SMMT chief says high costs compared with European rivals put sector at ‘competitive disadvantage’",
      "author": "Electric vehicles",
      "url": "https://www.ft.com/content/e1a7860a-02d0-4b10-aeb1-80e6b52fd6dd",
      "link_type": "article",
      "item_date": 1634043551000,
      "item_id": "22823546",
      "timestamp": 1634328895963,
      "domain": "ft.com",
      "item_date_formatted": "Oct 12",
      "description_trimmed": "SMMT chief says high costs compared with European rivals put sector at ‘competitive disadvantage’",
      "keywords": ""
    }
  ],
  "item_upvotes": {
    "81e2497b": {
      "auth0|615cb90b861e13006987e6c1": true
    }
  },
  "user_favorites": {
    "auth0|615cb90b861e13006987e6c1": [
      { "item_id": "4a7ed1c0", "action_date": 1634188847270 },
      { "item_id": "ac1f4744", "action_date": 1634188998838 },
      { "item_id": "6c12d760", "action_date": 1634191599061 },
      { "item_id": "17dff6cb", "action_date": 1634191604066 },
      { "item_id": "525fb9fc", "action_date": 1634351511045 }
    ]
  },
  "user_upvotes": {
    "auth0|615cb90b861e13006987e6c1": [
      { "item_id": "81e2497b", "action_date": 1634353534128 }
    ]
  }
}
