{
  "etag": "W/\"39ad1a991f696169c1583d464ee39e54\"",
  "items": [
    {
      "title": "Elon Musk says supply-chain issues have forced Tesla to increase prices multiple times this year, pushing its cheapest model to $42,000",
      "description": "Tesla CEO Elon Musk.\nPatrick Pleul/picture alliance via Getty Images\n\n\nTesla CEO Elon Musk said Tesla has been forced to raise prices to combat supply-chain issues.\nThe carmaker raised prices for its Model 3 and Model Y by $2,000 this week.\nTesla has hiked prices across its line-up multiple times this year.\nTesla has raised its car prices multiple times this year.In the beginning of the year, the electric carmaker implemented a series of price hikes across its line-up , and again in July. Most recently, Tesla increased its prices for the Model 3 and Model Y in an overnight update on its website on Wednesday in the US - tacking on a $2,000 price increase to its cheapest vehicle.The Model 3 Standard Range Plus hit a $41,990 price point, while the Model 3 Performance price climbed to $57,990. Model Y prices also climbed $1,000 to $2,000 higher.The starting prices for the Model 3 and Model Y were cut earlier in 2021, but have since been raised twice - making the Model 3 Standard Range Plus $5,000 more than it was in February and much more expensive than the $35,000 price point that was available before the pandemic started.During the company's annual shareholder meeting on Thursday, Tesla CEO Elon Musk said the supply-chain crisis has necessitated the price hikes.\"We are seeing significant cost pressure in our supply chain,\" Musk said. \"So we've had to increase vehicle prices, at least temporarily, but we do hope to actually reduce the prices over time and make them more affordable.\"A Tesla spokesperson did not immediately respond to a request for comment.Musk pointed out that Tesla has had to shell out extra money to fly in parts in order to avoid major bottlenecks at US ports. In the past, Musk has said the automaker has faced \"super crazy shortages\" and \"insane difficulties\" from the global computer chip shortage, as well as port delays and COVID-19 restrictions in China. In 2020, Musk promised Tesla would release a cheaper vehicle near a $25,000 price point by 2023 - nearly half of the price tag for the automaker's current cheapest vehicle. As with any timeline Musk gives, take it with a grain of salt, as he has previously said hitting specific product deadlines isn't his strong suit. Despite the supply-chain snags, Tesla posted its most profitable quarter to date in June after it started raising its prices, hitting a net income exceeding $1 billion. Read the original article on Business Insider",
      "author": "All Content from Business Insider",
      "url": "https://www.businessinsider.com/elon-musk-supply-chain-crisis-forced-tesla-raise-prices-2021-10",
      "link_type": "article",
      "item_date": 1633702855000,
      "item_id": "def248a8",
      "timestamp": 1633704571339,
      "domain": "businessinsider.com",
      "item_date_formatted": "Oct 8, 2:20 pm",
      "description_trimmed": "Tesla CEO Elon Musk.\nPatrick Pleul/picture alliance via Getty Images\n\n\nTesla CEO Elon Musk said Tesla has been forced to raise prices to combat supply-chain issues.\nThe carmaker raised prices for its Model 3 and Model Y by $2,000 this week.\nTesla has hiked prices across its line-...",
      "keywords": "Price Point, Supply Chain, Standard Range, Cheapest Model"
    },
    {
      "title": "The new Tesla Roadster finally gets an updated release date",
      "description": "The next-generation Tesla Roadster has finally received an updated estimated release date. During the recently-held 2021 Annual Shareholder Meeting, Tesla CEO Elon Musk remarked that the new Roadster, which would outperform even the frighteningly quick Model S Plaid, would likely see a release date of 2023, barring any unexpected challenges. \n\n\n\nMusk’s update about the all-electric supercar was related while the CEO was addressing an inquiry about the Cybertruck’s production. The Tesla Cybertruck was initially set to enter initial production in late 2021, but the ongoing supply chain shortages, as well as apparent challenges with the 4680 cell production ramp, have pushed the all-electric pickup truck’s release to late 2022 instead. \n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nExplaining this further, Musk noted that the ramp of its vehicles like the Cybertruck would likely depend on how well the company handles its ongoing supply chain issues. If Tesla could accomplish this goal, even side projects like the release of the next-generation Roadster could finally happen. \n\n\n\n“This year has been just a constant struggle with parts supply. So just to be clear, if we had like five extra products, we would not change our vehicle output at all because we are just basically limited by multiple supply chain shortages. Like so many types, not just chips. There were lots of supply chain shortages. So it really wouldn’t matter if we had like the Semi or the Cybertruck or anything. We would not be able to make it. \n\n\n\n“The Semi in particular needs a lot of cells and a lot of chips. We gotta have enough. Otherwise, it’s pointless, so I think most likely, what we’ll see is Cybertruck will start production in the next year and then reach volume production in 2023. Hopefully, we can also be producing the Semi and the new Roadster in ’23 as well. So we should be through our severe supply chain shortages in ’23. I’m optimistic that will be the case,” Musk said. \n\n\n\nThe next-generation Tesla Roadster has been described by Elon Musk in the past as a “dessert” of sorts since the vehicle would not be produced in volumes similar to the Model 3 or Model Y, or even the Model S and Model X. Instead, the new Roadster would be a true halo car for Tesla, with only about 10,000 or so being produced annually. Musk has also mentioned that the halo car would likely be produced at the Fremont Factory. \n\n\n\nThe specs of the new Roadster are quite out of this world. With its expected cold gas thrusters, Elon Musk has mentioned that the all-electric supercar would likely be able to accelerate from 0-60 mph in as little as 1.1 seconds. The range of the new next-generation Roadster when it was announced was 620 miles as well, though Tesla’s battery tech has substantially improved since its unveiling back in late 2017. With the company’s newer 4680 cells, the range of the new Roadster would likely be even more impressive. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post The new Tesla Roadster finally gets an updated release date appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-roadster-final-release-date/",
      "link_type": "article",
      "item_date": 1633694415000,
      "item_id": "025d93d1",
      "timestamp": 1633704571933,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 8, 12:00 pm",
      "description_trimmed": "The next-generation Tesla Roadster has finally received an updated estimated release date. During the recently-held 2021 Annual Shareholder Meeting, Tesla CEO Elon Musk remarked that the new Roadster, which would outperform even the frighteningly quick Model S Plaid, would likely...",
      "keywords": "Tesla Roadster, Next Generation, All Electric, Elon Musk"
    },
    {
      "title": "Elon Musk: Tesla Cyberquad will be the safest ATV",
      "description": "Elon Musk commented on the Tesla Cyberquad for the first time since he unveiled the electric ATV with the Cybertruck in 2019.\nThe CEO said that it will be the safest ATV in the world.\n more…\nThe post Elon Musk: Tesla Cyberquad will be the safest ATV appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/07/elon-musk-tesla-cyberquad-will-be-the-safest-atv/",
      "link_type": "article",
      "item_date": 1633653082000,
      "item_id": "122c3287",
      "timestamp": 1633704572051,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 8, 12:31 am",
      "description_trimmed": "Elon Musk commented on the Tesla Cyberquad for the first time since he unveiled the electric ATV with the Cybertruck in 2019.\nThe CEO said that it will be the safest ATV in the world.\n more…\nThe post Elon Musk: Tesla Cyberquad will be the safest ATV appeared first on Electrek.",
      "keywords": "Tesla Cyberquad, Safest Atv"
    },
    {
      "title": "Tesla formally moves headquarters to Austin, TX",
      "description": "Elon Musk announced that Austin, Texas has formally become the site of the company’s main headquarters. The update was shared at the 2021 Shareholders Meeting. \n\n\n\n“I’m excited to announce that we’ll be moving our headquarters to Austin, Texas,” Elon Musk said to much applause at the latest Annual Shareholders Meeting.\n\n\n\nTexas’ new place in Tesla’s operations may not come as a surprise to those following the developments surrounding the company’s newest Gigafactory. Elon Musk’s other companies have seemingly moved to Texas as well, including The Boring Company. \n\n\n\nThe Tesla CEO listed a few milestones Giga Texas might hit in the near term. He estimated that Giga Texas Model Y production could start by the end of this year and would probably reach volume production by the end of next year. Musk predicted that Tesla would deliver a few Model Y vehicles from Giga Texas this year. \n\n\n\n\nThe Cybertruck is now the cheapest Tesla that customers could order today\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nEven though Tesla is moving its headquarters to Texas, the company will still operate its factory in Fremont and Nevada. In fact, Tesla plans to increase the Fremont Factory and Giga Nevada’s capacity. \n\n\n\n“Just to be clear, though, we will be continuing to expand our activities in California. This is not a matter of Tesla leaving California,” Musk clarified. “As I said, our intention is to actually increase output from Fremont and Giga Nevada by 50%.” \n\n\n\nHowever, Tesla has reached a point where it’s become quite difficult to scale up in the Bay Area. California’s rising housing prices have also become hard on Tesla’s employees. \n\n\n\n“It’s tough for people to afford houses, and lots of people have to come in from far away. We’re taking this as far as possible, but there’s a limit to how much you can scale in the Bay Area. But here in Austin, the factory is five minutes from the airport and 15 minutes from downtown,” Musk said. \n\n\n\nMusk also remarked that while 4680 cell production in Texas will not be starting soon, Tesla’s pilot line at Kato Rd, which is only a mile away from the Fremont factory, would have enough capacity for now. \n\n\n\n“We are making 4680s at our pilot plant in California, which is a big plant by normal standards. It’s like capable of 10GWh a year. That factory will be able to make more than enough cells for Giga Texas to scale Model Y production,” Musk explained. \n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla formally moves headquarters to Austin, TX appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-new-headquarters-austin-tx-confirmed/",
      "link_type": "article",
      "item_date": 1633649634000,
      "item_id": "4fe65d91",
      "timestamp": 1633704571769,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 7, 11:33 pm",
      "description_trimmed": "Elon Musk announced that Austin, Texas has formally become the site of the company’s main headquarters. The update was shared at the 2021 Shareholders Meeting. \n\n\n\n“I’m excited to announce that we’ll be moving our headquarters to Austin, Texas,” Elon Musk said to much applause at...",
      "keywords": "Giga Texas, Fremont Factory, Giga Nevada, Elon Musk"
    },
    {
      "title": "Loup's Gene Munster on how to trade Tesla stock",
      "description": "https://www.youtube.com/watch?v=797uAIxrYdM(Feed generated with FetchRSS)",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=797uAIxrYdM",
      "link_type": "article",
      "item_date": 1633649415000,
      "item_id": "33055be2",
      "timestamp": 1633704571232,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 7, 11:30 pm",
      "description_trimmed": "https://www.youtube.com/watch?v=797uAIxrYdM(Feed generated with FetchRSS)",
      "keywords": ""
    },
    {
      "title": "Tesla Finally Moves Its Headquarters From Fremont To Texas",
      "description": "Elon Musk hasn’t made a secret of his recent distaste for California, and his preference for Texas. He called the California’s COVID restrictions “fascist,” he’s expressed a concerning lack of opinion on Texas’s anti-abortion law, and he’s already moved into a tiny home on SpaceX’s Austin campus. Read more...",
      "author": "Jalopnik",
      "url": "https://jalopnik.com/tesla-finally-moves-its-headquarters-from-fremont-to-te-1847822701",
      "link_type": "article",
      "item_date": 1633648500000,
      "item_id": "4a9aff33",
      "timestamp": 1633704571199,
      "domain": "jalopnik.com",
      "item_date_formatted": "Oct 7, 11:15 pm",
      "description_trimmed": "Elon Musk hasn’t made a secret of his recent distaste for California, and his preference for Texas. He called the California’s COVID restrictions “fascist,” he’s expressed a concerning lack of opinion on Texas’s anti-abortion law, and he’s already moved into a tiny home on SpaceX...",
      "keywords": "Tiny Home, Recent Distaste"
    },
    {
      "title": "Tesla to Move Headquarters From California to Texas, Elon Musk Says",
      "description": "The electric-vehicle maker is moving its headquarters to Austin, Texas, cementing Chief Executive Elon Musk’s commitment to the Lone Star State and adding to a handful of Silicon Valley companies that have relocated there.",
      "author": "WSJ.com: WSJD",
      "url": "https://www.wsj.com/articles/tesla-to-move-headquarters-to-austin-texas-musk-says-11633646229?mod=rss_Technology",
      "link_type": "article",
      "item_date": 1633646220000,
      "item_id": "9c2364e8",
      "timestamp": 1633704571233,
      "domain": "wsj.com",
      "item_date_formatted": "Oct 7, 10:37 pm",
      "description_trimmed": "The electric-vehicle maker is moving its headquarters to Austin, Texas, cementing Chief Executive Elon Musk’s commitment to the Lone Star State and adding to a handful of Silicon Valley companies that have relocated there.",
      "keywords": "Move Headquarters, Elon Musk"
    },
    {
      "title": "Tesla accuses Rivian of STEALING its 4680 battery technology",
      "description": "https://www.youtube.com/watch?v=my39LD_0Lyo",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=my39LD_0Lyo",
      "link_type": "article",
      "item_date": 1633642215000,
      "item_id": "c9e9bcda",
      "timestamp": 1633704571230,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 7, 9:30 pm",
      "description_trimmed": "https://www.youtube.com/watch?v=my39LD_0Lyo",
      "keywords": ""
    },
    {
      "title": "This is why Lamborghini is going all HYBRID * Tesla Plaid at low charge vs Huracan EVO Drag Race",
      "description": "https://www.youtube.com/watch?v=QWl5yB9oir0",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=QWl5yB9oir0",
      "link_type": "article",
      "item_date": 1633638615000,
      "item_id": "99de97bc",
      "timestamp": 1633704571228,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 7, 8:30 pm",
      "description_trimmed": "https://www.youtube.com/watch?v=QWl5yB9oir0",
      "keywords": "Tesla Plaid"
    },
    {
      "title": "BREAKING NEWS! Tesla Employee JUST LEAKED New Cybertruck 2022 Redesign Exclusive Footage",
      "description": "https://www.youtube.com/watch?v=_WDnga8AOTg",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=_WDnga8AOTg",
      "link_type": "article",
      "item_date": 1633635015000,
      "item_id": "b50d035f",
      "timestamp": 1633704571223,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 7, 7:30 pm",
      "description_trimmed": "https://www.youtube.com/watch?v=_WDnga8AOTg",
      "keywords": "Tesla Employee"
    },
    {
      "title": "Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000",
      "description": "Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000",
      "author": "TeslaTracker Submissions",
      "url": "https://electrek.co/2021/10/06/tesla-increases-mod",
      "link_type": "article",
      "item_date": 1633630605000,
      "item_id": "41e861ae",
      "timestamp": 1633704572050,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 7, 6:16 pm",
      "description_trimmed": "Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000",
      "keywords": "Cheapest Car"
    },
    {
      "title": "Tesla price hike, GM electric pickups, $9,000 EV for China, Midwest charging: Today’s Car News",
      "description": "Tesla raised prices sharply on Model 3 and Model Y. Geely is introducing a sub-$10,000 electric crossover in China. Governors in the U.S. Midwest agree on the need for more EV charging. And GM gives another glimpse of its more affordable electric pickups, and introduces Ultra Cruise to rival Tesla Autopilot. This and more, here at Green Car...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133809_tesla-price-hike-gm-electric-pickups-9-000-ev-for-china-midwest-charging-today-s-car-news",
      "link_type": "article",
      "item_date": 1633622100000,
      "item_id": "a944d62d",
      "timestamp": 1633704572045,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 7, 3:55 pm",
      "description_trimmed": "Tesla raised prices sharply on Model 3 and Model Y. Geely is introducing a sub-$10,000 electric crossover in China. Governors in the U.S. Midwest agree on the need for more EV charging. And GM gives another glimpse of its more affordable electric pickups, and introduces Ultra Cru...",
      "keywords": ""
    },
    {
      "title": "Elon Musk releases more details about Tesla’s ‘Full Self-Driving Beta’ wider release",
      "description": "Elon Musk has released a few additional details about Tesla’s “Full Self-Driving Beta” wider release, which should start tomorrow.\n more…\nThe post Elon Musk releases more details about Tesla’s ‘Full Self-Driving Beta’ wider release appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/07/elon-musk-releases-more-details-tesla-full-self-driving-beta-wider-release/",
      "link_type": "article",
      "item_date": 1633620141000,
      "item_id": "bc37584c",
      "timestamp": 1633704571306,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 7, 3:22 pm",
      "description_trimmed": "Elon Musk has released a few additional details about Tesla’s “Full Self-Driving Beta” wider release, which should start tomorrow.\n more…\nThe post Elon Musk releases more details about Tesla’s ‘Full Self-Driving Beta’ wider release appeared first on Electrek.",
      "keywords": "Self Driving"
    },
    {
      "title": "German EV Rental Car Company Makes Tesla Its Only Brand",
      "description": "ElektroHub, a German battery electric vehicle company that once offered a variety of EVs for rent, is changing its selection to only renting out Tesla vehicles. Alex Voigt shared a video on Twitter about this and added that this is why he sharply criticizes auto manufacturers for offering battery electric vehicles (BEVs) that are not […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/07/german-ev-rental-car-company-makes-tesla-its-only-brand/",
      "link_type": "article",
      "item_date": 1633618854000,
      "item_id": "cd0f6acb",
      "timestamp": 1633704572216,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 7, 3:00 pm",
      "description_trimmed": "ElektroHub, a German battery electric vehicle company that once offered a variety of EVs for rent, is changing its selection to only renting out Tesla vehicles. Alex Voigt shared a video on Twitter about this and added that this is why he sharply criticizes auto manufacturers for...",
      "keywords": "Tesla Vehicles"
    },
    {
      "title": "Tesla becomes last EV standing after car rental company purges its BEV fleet",
      "description": "The electric vehicle market is getting more crowded, with more and more electric cars being released every year. This was particularly true for Miete Deinen Tesla, a German electric vehicle rental company that expanded its operations by purchasing more EVs from other automakers. In a recent announcement, the BEV rental company noted that it is purging its EV fleet save for its Teslas since the ownership experience of other electric cars is a bit lacking, at least for now. \n\n\n\nThe car rental company outlined its decision in a recent video, which was uploaded on its YouTube channel. In the video, the company noted that it is actually very sad to see some of its EVs go, especially the Porsche Taycan 4S, an otherwise stunning electric car that is bogged down by its charging infrastructure. Other electric cars that the company bought from manufacturers like Volkswagen and Hyundai also presented their own fair share of challenges — challenges which do not make them as good as Teslas for business. \n\n\n\n\n\nGerman BEV rental company abandons all BEVs after 2.5 years of experience, except Tesla because IDs, Enyaq, Taycan, Kona, Ioniq had a lot of problems with software, charging and repairsThey didn't get cars other BEVs bc they talk positively about Teslahttps://t.co/gijilIWwU7— Alex (@alex_avoigt) October 6, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nMiete Deinen Tesla mentioned some of the issues that they experienced over the time they operated with a fleet of EVs from different automakers. According to the company, issues that were prevalent with non-Tesla electric cars included software, charging, and repair, to name a few. For example, Volkswagen’s ID series are yet to have over-the-air software update capabilities, which means that owners typically have to go to dealers just to update their vehicles. \n\n\n\nThe BEV rental company noted that it would continue to support the electric vehicle movement by featuring non-Tesla electric cars in its YouTube channel on a regular basis. But for its actual business, the car rental company would be focusing on a Tesla-only fleet for now. This is quite understandable considering that Tesla’s electric vehicles are very well rounded, and their rapid charging infrastructure makes them ideal alternatives to fossil fuel-powered cars. \n\n\n\nIf there are any lessons that could be learned from the experience of the German electric vehicle rental company, it is that the ownership experience of EVs matters a lot. Electric cars may be stunning and their capabilities as a vehicle per se may be impressive, but without the necessary ecosystem, the ownership experience could easily get bogged down. Fortunately, this is something that Tesla particularly excels at, despite the company’s areas of improvement when it comes to service and repair. \n\n\n\nTesla’s mastery of over-the-air updates is also a key advantage, as it allows the company to address minor issues and even add features from time to time by a software update that’s not unlike those utilized by smartphone-makers like Apple. \n\n\n\n\n\n\n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla becomes last EV standing after car rental company purges its BEV fleet appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-last-ev-standing-germany/",
      "link_type": "article",
      "item_date": 1633614587000,
      "item_id": "b849e2f3",
      "timestamp": 1633704572312,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 7, 1:49 pm",
      "description_trimmed": "The electric vehicle market is getting more crowded, with more and more electric cars being released every year. This was particularly true for Miete Deinen Tesla, a German electric vehicle rental company that expanded its operations by purchasing more EVs from other automakers. ...",
      "keywords": "Electric Cars, Ownership Experience, Ev Standing, Youtube Channel"
    },
    {
      "title": "FSD Beta 10.2 rolls out Friday midnight to ~1000 owners with perfect 100/100 safety scores. \n\nRollouts will hold for several day...",
      "description": "FSD Beta 10.2 rolls out Friday midnight to ~1000 owners with perfect 100/100 safety scores. \n\nRollouts will hold for several days after that to see how it goes. \n\nIf that looks good, beta will gradually begin rolling out to 99 scores &amp; below.",
      "author": "@elonmusk on Twitter",
      "url": "https://twitter.com/elonmusk/status/1446104772092772352",
      "link_type": "article",
      "item_date": 1633613219000,
      "item_id": "e54eee53",
      "timestamp": 1633704572415,
      "domain": "twitter.com",
      "item_date_formatted": "Oct 7, 1:26 pm",
      "description_trimmed": "FSD Beta 10.2 rolls out Friday midnight to ~1000 owners with perfect 100/100 safety scores. \n\nRollouts will hold for several days after that to see how it goes. \n\nIf that looks good, beta will gradually begin rolling out to 99 scores &amp; below.",
      "keywords": "Fsd Beta, Safety Scores, Friday Midnight"
    },
    {
      "title": "Tesla rolls out updates to the Model S Plaid’s steering yoke to make it more intuitive",
      "description": "There is no doubt that the new Tesla Model S’ steering yoke is controversial. Largely deemed as an Achilles Heel of sorts to an otherwise perfect car, the steering yoke has seen heavy criticism from some of the vehicle’s reviewers. Fortunately for Model S owners who have already taken delivery of the flagship sedan, Tesla has started rolling out some improvements to the steering yoke to make it more intuitive. \nThe updates to the Model S’ steering yoke were rolled out with update 2021.36. With the updates in place, the new Model S’ turn signals will now automatically cancel on completion of a maneuver. Pressing and holding the “high beams” button would also activate the windshield washers. Tesla describes these changes in 2021.36’s Release Notes. \n\n2021.36 #TeslaReleaseNotesYoke changes: Autocancel of turn signals on completion of maneuverAutoturn on of turn signal if navigation suggests it (the car commands YOU to change)press and hold the \"high beams\" button to activate washers (very intuitive).vision autopark S@refr pic.twitter.com/zrNSBwfF7z\n— green (@greentheonly) October 6, 2021\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n“Your turn signals will now automatically turn off when the vehicle detects a merge, fork or lane change maneuver has been completed. If an upcoming navigation event is detected in the direction of the turn signal, or if the vehicle detects a subsequent lane change, the turn signal will not turn off until the maneuver is complete. Turn signals will always latch when pressed. Additionally, you can now press and hold to latch high beam, and to activate the windshield washer.\n“Note: Turn signals will cancel based on steering angle regardless of the selected setting for Automatic turn signals.”\nThese updates to the new Model S’ steering yoke would go a long way towards making the flagship sedan more convenient to use. Tesla appears to have designed the new Model S and the upcoming Model X with convenience and automation in mind, after all, which is likely one of the reasons why the flagship vehicles were designed with no turn stalks or physical shift levers. This suggests that the user experience of the Model S and Model X would likely rely on how well Tesla could optimize the automated features of the vehicles for everyday use. \nTesla’s 2021.36 update also introduced some cold weather improvements, such as one which allows vehicles to automatically adjust their windshield wiper wash sequence to a car’s moving speed, thereby ensuring that salt and grime are cleaned well. Improvements to battery preconditioning systems were also introduced to prepare vehicles better for a Supercharging session. Autopark has also been improved to identify perpendicular parking spots as well, and Bioweapon Defense Mode could now be engaged through the Tesla mobile app. \nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla rolls out updates to the Model S Plaid’s steering yoke to make it more intuitive appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-steering-yoke-update-new-features/",
      "link_type": "article",
      "item_date": 1633610037000,
      "item_id": "f4f80d31",
      "timestamp": 1633704571627,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 7, 12:33 pm",
      "description_trimmed": "There is no doubt that the new Tesla Model S’ steering yoke is controversial. Largely deemed as an Achilles Heel of sorts to an otherwise perfect car, the steering yoke has seen heavy criticism from some of the vehicle’s reviewers. Fortunately for Model S owners who have already ...",
      "keywords": "Steering Yoke, Turn Signals, Turn Signal, Vehicle Detects"
    },
    {
      "title": "GM Needs to Walk the Tesla Talk",
      "description": "The company painted a wildly ambitious picture of growth at its much-anticipated 2021 investor conference. What investors really need from the company, though, isn’t more talk.",
      "author": "WSJ.com: WSJD",
      "url": "https://www.wsj.com/articles/gm-needs-to-walk-the-tesla-talk-11633609360?mod=rss_Technology",
      "link_type": "article",
      "item_date": 1633609320000,
      "item_id": "38cc7d21",
      "timestamp": 1633704572215,
      "domain": "wsj.com",
      "item_date_formatted": "Oct 7, 12:22 pm",
      "description_trimmed": "The company painted a wildly ambitious picture of growth at its much-anticipated 2021 investor conference. What investors really need from the company, though, isn’t more talk.",
      "keywords": "Tesla Talk, Investor Conference, Company Painted"
    },
    {
      "title": "Tesla raises Model 3 and Model Y base prices by $2,000",
      "description": "Tesla has raised the base prices of the Model 3 and Model Y by $2,000, the latest in a series of price changes this year. First spotted by Electrek, Tesla's online configurator now shows the price of the base rear-wheel drive Model 3 Standard Range Plus as $41,990 instead of the previous $39,990. The starting price of the Model 3 Performance also...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133799_tesla-raises-model-3-and-model-y-base-prices-by-2-000",
      "link_type": "article",
      "item_date": 1633608000000,
      "item_id": "88a29191",
      "timestamp": 1633704572413,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 7, 12:00 pm",
      "description_trimmed": "Tesla has raised the base prices of the Model 3 and Model Y by $2,000, the latest in a series of price changes this year. First spotted by Electrek, Tesla's online configurator now shows the price of the base rear-wheel drive Model 3 Standard Range Plus as $41,990 instead of the ...",
      "keywords": "Base Prices, Starting Price, Drive Model"
    },
    {
      "title": "Tesla shareholders will vote today on whether to kick Elon Musk's brother off the company's board",
      "description": "Elon Musk's brother Kimbal Musk.\nAxelle/Bauer-Griffin/FilmMagic\n\n\nTesla is holding its annual shareholder meeting on Thursday.\nShareholders will vote on the future of Kimbal Musk and James Murdoch on the company's board.\nAdvisory firm ISS has urged shareholders to oust the pair, saying Tesla board members are overpaid.\n\nSee more stories on Insider's business page.\nTesla shareholders are due to vote Thursday on whether to oust James Murdoch and Kimbal Musk, the brother of CEO Elon Musk, from the company's board. The vote on the pair's possible reelection will take place at Tesla's annual shareholder meeting on Thursday, which it will host at its factory in Austin, Texas.Shareholder proxy advisor Institutional Shareholder Services (ISS) wrote to clients on September 24 saying Tesla's board members were overpaid compared to board members at similar companies, Bloomberg reported at the time.Murdoch, son of media mogul Rupert Murdoch, received $32,500 for serving on Tesla's board last year, and Kimbal Musk received $20,000, per a Tesla Securities and Exchange Commission (SEC) filing.Other directors make much more money, but Murdoch and Musk are the only members up for reelection this year. ISS said they should be denied the chance to continue serving, The New York Times reported. Chair of the board Robyn Denholm was paid $5.7 million last year and board member Hiromichi Mizuno was paid $9 million. Both Denholm and Mizuno were paid largely in stock options. ISS made a similar recommendation to investors in 2018 to oust Murdoch and now-outgoing director Antonio Gracias.Separately, a proposal from Morgan Stanley-owned Calvert Research and Management that is due to be voted on calls for more transparency on Tesla's diversity and inclusion efforts, SEC filings show.Nia Impact Capital, a small shareholder, also submitted a proposal that would force Tesla to publish a report on its inclusion of mandatory arbitration in employee contracts, the filings show. Mandatory arbitration means employees can't bring disputes to court.On Monday, Tesla was ordered to pay former elevator operator Owen Diaz $137 million after he filed a racial harassment lawsuit against the company.Attorneys for Diaz, who was a contractor and not directly employed by Tesla, told CNBC he was only able to bring the case because he had not signed an arbitration agreement.Another proposal submitted by shareholder Sisters of the Good Shepherd would force Tesla to commission an independent third-party report on whether it's ensuring there are no human rights abuses in its supply chain.In an SEC filing, Tesla urged investors to reelect Musk and Murdoch. It also urged investors to vote against the proposals from Calvert Research and Management, Nia Impact Capital, and Sisters of the Good Shepherd in an SEC filing. Read the original article on Business Insider",
      "author": "All Content from Business Insider",
      "url": "https://www.businessinsider.com/activist-tesla-investors-try-to-oust-kimbal-musk-2021-10",
      "link_type": "article",
      "item_date": 1633606419000,
      "item_id": "d8ea315b",
      "timestamp": 1633704572162,
      "domain": "businessinsider.com",
      "item_date_formatted": "Oct 7, 11:33 am",
      "description_trimmed": "Elon Musk's brother Kimbal Musk.\nAxelle/Bauer-Griffin/FilmMagic\n\n\nTesla is holding its annual shareholder meeting on Thursday.\nShareholders will vote on the future of Kimbal Musk and James Murdoch on the company's board.\nAdvisory firm ISS has urged shareholders to oust the pair, ...",
      "keywords": "Kimbal Musk, Force Tesla, Tesla Shareholders, Sec Filing"
    },
    {
      "title": "HOURS AGO! GM Wants To Overtake Tesla as EV Leader With New $30,000 EV",
      "description": "https://www.youtube.com/watch?v=_OdLh_wvBP8",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=_OdLh_wvBP8",
      "link_type": "article",
      "item_date": 1633577787000,
      "item_id": "2b005567",
      "timestamp": 1633704572330,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 7, 3:36 am",
      "description_trimmed": "https://www.youtube.com/watch?v=_OdLh_wvBP8",
      "keywords": "Ev Leader"
    },
    {
      "title": "$137 Million Tesla Racism Verdict Could Be Cut If Company Appeals",
      "description": "$137 Million Tesla Racism Verdict Could Be Cut If Company Appeals(Feed generated with FetchRSS)",
      "author": "Hyperdrive - Bloomberg",
      "url": "https://www.bloomberg.com/news/articles/2021-10-06/eye-popping-tesla-racism-verdict-poised-to-be-cut-if-appealed?srnd=hyperdrive",
      "link_type": "article",
      "item_date": 1633560416000,
      "item_id": "955ebdd9",
      "timestamp": 1633704571240,
      "domain": "bloomberg.com",
      "item_date_formatted": "Oct 6, 10:46 pm",
      "description_trimmed": "$137 Million Tesla Racism Verdict Could Be Cut If Company Appeals(Feed generated with FetchRSS)",
      "keywords": ""
    },
    {
      "title": "Tesla Shareholder Day 2021: Here’s What Investors Will Ask Elon Musk and Co.",
      "description": "Tesla (NASDAQ: TSLA) will hold its 2021 Annual Shareholder’s Meeting on Thursday, October 7, 2021. The meeting will be held at Tesla Gigafactory Texas in Austin and will begin at 5:30 PM EDT.\nTesla utilizes Say Investor Relations, a platform used by several large companies to handle questions for quarterly earnings calls and shareholder meetings. Say has been used by Tesla in the past in each of the Quarterly Earnings Calls that Teslarati has covered.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTop Voted Questions\nThe following questions that are listed have been upvoted by Tesla Shareholders the most, indicating that they are the inquiries they are most concerned with heading into the 2021 Annual Shareholder Meeting.\n\nDoes Tesla plan to offer any dividends to its shareholders in the next two years?\nWith $TSLA stock price back into the $700-800 range, and likely heading higher, would you consider another split to allow retail investors to continue adding shares at a decent per share price?\nIs there any guidance on when Cybertruck production will begin and at what rate the ramp-up will happen?\nCan Tesla provide quarterly updates on Energy Business along with Automotive Reporting Deliveries and Production?\nAre we going to see 4680 batter cell this year in Texas? If not, what part of production is holding it up?\n\nMost Shares Represented\nThe following questions that are listed are represented by the most shares of $TSLA Stock. This means that if the question was upvoted, it takes the number of shares that each upvoter has and accumulates them. It is not representative of the number of shares owned by the person asking the question. Some of the questions are repeated.\n\nIs there any guidance on when Cybertruck production will begin and at what rate the ramp-up will happen?\nWith $TSLA stock price back into the $700-800 range, and likely heading higher, would you consider another split to allow retail investors to continue adding shares at a decent per share price?\nAre we going to see 4680 batter cell this year in Texas? If not, what part of production is holding it up?\nDoes Tesla plan to offer any dividends to its shareholders in the next two years?\nCan Tesla provide quarterly updates on Energy Business along with Automotive Reporting Deliveries and Production?\n\nSome other notable questions include predictions regarding the production of the Tesla Roadster, whether Tesla will begin accepting Dogecoin as payment for its vehicles, and updates on the development of the rumored $25,000 vehicle.\nAll stockholders as of the close of business on October 7th, 2021, are eligible to attend and cast their votes at the 2021 Annual Meeting from the Fremont Production facility. The company indicated it will announce more specific details regarding check-in procedures for the meeting closer to the date of the event.\nTesla to hold 2021 Shareholders Meeting on Oct. 7: Here’s what will be discussed\n\nDisclosure: Joey Klender is a TSLA Shareholder.\nThe post Tesla Shareholder Day 2021: Here’s What Investors Will Ask Elon Musk and Co. appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-shareholder-meeting-2021-questions-investors-elon-musk/",
      "link_type": "article",
      "item_date": 1633546755000,
      "item_id": "38054ab5",
      "timestamp": 1633704571548,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 6, 6:59 pm",
      "description_trimmed": "Tesla (NASDAQ: TSLA) will hold its 2021 Annual Shareholder’s Meeting on Thursday, October 7, 2021. The meeting will be held at Tesla Gigafactory Texas in Austin and will begin at 5:30 PM EDT.\nTesla utilizes Say Investor Relations, a platform used by several large companies to han...",
      "keywords": "Share Price, Cybertruck Production, Retail Investors, Tesla Plan"
    },
    {
      "title": "Elon Musk confirms Tesla’s $1.4 billion loan for Giga Shanghai was paid off early",
      "description": "Tesla CEO Elon Musk confirmed on Twitter several days ago that the company’s $1.4 billion loan for its Gigafactory Shanghai facility in China was paid off.\nOn October 4, 2021, @jpr007, a Tesla enthusiast on Twitter, showed documentation that Tesla had officially paid off its entire $1.4 billion loan, which was granted from Chinese banks, in just sixteen months. The loan was announced in December 2019, and appeared to have no balance as of Tesla’s Q2 2021 financial documentation. Musk later confirmed the story by stating, “Tesla always pays its debts.” His statement was a response to a CleanTechnica article.\n\nTesla always pays its debts\n— Elon Musk (@elonmusk) October 5, 2021\n\n\nJPR stated that the $1.4 billion loan was paid off in just 16 months, as the terms of the loan had a five-year, or sixty month, pay-off period. This would entail that Tesla paid off the tremendous loan massively early, and it appears that the entire balance was paid with profits from the Shanghai factory. The loan was provided by several banks, including China Construction Bank, Agricultural Bank of China, Industrial and Commercial Bank of China, and Shanghai Pudong Development Bank, according to a report from Reuters.\nTesla has a reputation for paying back its federal loans, whether from the United States government or a foreign entity, rather quickly and well ahead of schedule. In May 2013, Tesla, then Tesla Motors, announced that it had paid off a massive loan from the U.S. Department of Energy, sending its final wire on May 22 worth $451.8 million. Tesla paid the loan back nine years early.\nIf speculation is correct and Tesla utilized only profits from the Shanghai factory to pay back the $1.4 billion loan from Chinese banks, this was likely fueled by the widened gross margins Tesla was receiving from its vehicle sales. Tesla has become a mainstay in the Chinese electric vehicle market, being one of the top manufacturers in the region in terms of sales figures. Additionally, the company was rumored to have a 39% gross margin on its China-built Model 3, and 29.4% on the Model Y. The increased gross margin came from increased vertical integration and manufacturing efficiencies which made Tesla’s vehicles easier and more affordable to produce.\nPaying back loans early is a great look for the electric automaker, as Tesla is utilizing strategic financial strategies to eliminate its debts while also increasing profitability. Tesla has already accumulated eight consecutive quarters of profitability, dating back to Q3 2019.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Elon Musk confirms Tesla’s $1.4 billion loan for Giga Shanghai was paid off early appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-giga-shanghai-loan-paid-off-elon-musk/",
      "link_type": "article",
      "item_date": 1633539592000,
      "item_id": "2b7a0d26",
      "timestamp": 1633704572220,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 6, 4:59 pm",
      "description_trimmed": "Tesla CEO Elon Musk confirmed on Twitter several days ago that the company’s $1.4 billion loan for its Gigafactory Shanghai facility in China was paid off.\nOn October 4, 2021, @jpr007, a Tesla enthusiast on Twitter, showed documentation that Tesla had officially paid off its enti...",
      "keywords": "Billion Loan, Tesla Paid, Shanghai Factory, Giga Shanghai"
    },
    {
      "title": "Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000",
      "description": "Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000",
      "author": "TeslaTracker Submissions",
      "url": "https://electrek.co/2021/10/06/tesla-increases-mod",
      "link_type": "article",
      "item_date": 1633537742000,
      "item_id": "4b56d31d",
      "timestamp": 1633704572416,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 6, 4:29 pm",
      "description_trimmed": "Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000",
      "keywords": "Cheapest Car"
    },
    {
      "title": "Federal Court Orders Tesla To Pay $137 Million To Former Black Employee Over Racism",
      "description": "https://www.youtube.com/watch?v=lJyUF5ZoOdk",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=lJyUF5ZoOdk",
      "link_type": "article",
      "item_date": 1633532268000,
      "item_id": "a2774d53",
      "timestamp": 1633704572160,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 6, 2:57 pm",
      "description_trimmed": "https://www.youtube.com/watch?v=lJyUF5ZoOdk",
      "keywords": ""
    },
    {
      "title": "Tesla’s latest round of price increases make the base Model 3 a $42k vehicle",
      "description": "While Tesla largely maintained its vehicle prices during the third quarter, the company has now started Q4 2021 with a new round of price increases. The new price increases affect the Tesla Model 3 and Model Y, the company’s two high-volume vehicles. \n\n\n\nTesla’s vehicle prices this year were subjected to numerous adjustments, with prices across the company’s current S3XY lineup being adjusted several times during the first half of 2021. The price adjustments were tempered down in the third quarter, however, save for the company adjusting the cost of the base Model S and Model X in August. \n\n\n\nCredit: Tesla\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nWith the recent price adjustments in place, the Tesla Model 3 Standard Range Plus now starts at $41,990 before incentives, a $2,000 increase. The Model 3 Performance also saw a $1,000 price increase, with the vehicle now starting at $57,990 before incentives. Interestingly enough, the price of the Model 3 Dual Motor AWD remained stable at $49,990 before incentives. \n\n\n\nThe Tesla Model 3 Standard Range Plus is currently listed with an estimated delivery date of April 2022. Orders for the Model 3 Dual Motor AWD are listed with an estimated delivery date of December 2021, and Model 3 Performance orders are listed with a November 2021 delivery estimate. \n\n\n\nCredit: Tesla\n\n\n\nOn the Model Y front, Tesla has adjusted the price of the vehicle’s Long Range variant by $1,000, with the all-electric crossover now starting at $54,990 before incentives. The Tesla Model Y Performance’s price also saw a $1,000 price increase to $61,990 before incentives. Estimated delivery dates for the Model Y Long Range are listed at April 2022, while the Model Y Performance is listed with a December 2021 estimated delivery date. \n\n\n\nThe Tesla Model S and Model X were not affected by the recent round of price adjustments. \n\n\n\nTesla’s prices this year have been volatile, but despite this, the demand for the company’s electric cars seems to be stable. Tesla’s numbers have so far continued to grow every quarter this year, with Q3 2021 outperforming even estimates from TSLA bulls with 241,300 vehicle deliveries. For context, Tesla delivered half a million vehicles in all of 2020, which was already a remarkable achievement on its own. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla’s latest round of price increases make the base Model 3 a $42k vehicle appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-model-3-42k-price-update/",
      "link_type": "article",
      "item_date": 1633522183000,
      "item_id": "4516be76",
      "timestamp": 1633704571535,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 6, 12:09 pm",
      "description_trimmed": "While Tesla largely maintained its vehicle prices during the third quarter, the company has now started Q4 2021 with a new round of price increases. The new price increases affect the Tesla Model 3 and Model Y, the company’s two high-volume vehicles. \n\n\n\nTesla’s vehicle prices th...",
      "keywords": "Tesla Model, Base Model, Price Increase, Vehicle Prices"
    },
    {
      "title": "Report: Tesla is alleging theft of battery trade secrets by Rivian",
      "description": "Tesla is continuing its trade secrets fight with Rivian, alleging that the electric-truck hopeful poached employees and stole \"highly proprietary\" battery technology, according to a Bloomberg report. The Silicon Valley firm filed a lawsuit against Rivian 14 months ago, but claims the company has continued poaching its staff, and using them to...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133767_report-tesla-is-alleging-theft-of-battery-trade-secrets-by-rivian",
      "link_type": "article",
      "item_date": 1633521600000,
      "item_id": "5237114e",
      "timestamp": 1633704572411,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 6, 12:00 pm",
      "description_trimmed": "Tesla is continuing its trade secrets fight with Rivian, alleging that the electric-truck hopeful poached employees and stole \"highly proprietary\" battery technology, according to a Bloomberg report. The Silicon Valley firm filed a lawsuit against Rivian 14 months ago, but claims...",
      "keywords": "Rivian Tesla, Continued Poaching, Bloomberg Report"
    },
    {
      "title": "Tesla Model Y Performance nearly sold out for 2021",
      "description": "Tesla’s Model Y Performance variant, which is the fastest available configuration of the all-electric crossover, is nearly sold out for 2021, according to the company’s online Design Studio.\nTesla has dealt with widespread demand for its electric vehicles in 2021. As the movement and transition to electrification continues to accelerate, Tesla is among the most sought-after brands of EVs, and demand for its cars continuously grows on a daily basis.\nDespite working toward opening two new production facilities by the end of 2021, one in the United States and one in Germany, Tesla is still dealing with delivery projection dates being pushed back. It appears that the Model Y, which is the company’s most popular car, is now nearing a complete sell-out for 2021.\nWhile this could be attributed to the global semiconductor shortage that has plagued automakers globally, Tesla has done a tremendous job of averting this crisis.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nThe Model Y Long Range All-Wheel-Drive variant has been sold out for the year for several months. Tesla currently projects deliveries of that variant of the crossover for April 2022. However, Tesla customers can still order a Model Y Performance with hopes of it being delivered by the end of the year. With the growing demand for the company’s cars, who knows how long it will last.\nTesla’s online Design Studio now has deliveries of the Model Y Performance set for December. Tesla enthusiast Sawyer Merritt first noticed the change in the Model Y Performance’s projected delivery date.\n\nNew US Model Y Performance orders now showing estimated delivery date of December (from November). Model Y almost sold out for 2021. pic.twitter.com/mRkVtGBnXX\n— Sawyer Merritt  (@SawyerMerritt) October 3, 2021\n\n\nAs previously mentioned, Tesla’s delayed delivery dates could be attributed to parts shortages. However, the company is coming off of its best quarter in company history in terms of Delivery and Production rates. On Saturday morning, Tesla revealed that it had delivered 241,300 vehicles in Q3, beating Wall Street estimates by 9%. Growth has not been an issue for Tesla, and the company has been able to avert the semiconductor chip issue by developing 19 of its own microcontrollers. Additionally, Morgan Stanley released a new investor note this week that attributed Tesla’s ability to avert the chip shortage crisis through vertical integration, scalability, negotiations with suppliers, and product sophistication.\nCEO Elon Musk stated that it was an “extremely difficult” challenge to avoid production stoppages due to parts shortages, but Tesla’s team of engineers, supply chain experts, production employees, and suppliers helped the automaker attain its most successful quarter to date.\n\nThis was *extremely* difficult. Huge props to Tesla engineering, supply chain, production &amp; key suppliers.\n— Elon Musk (@elonmusk) October 4, 2021\n\n\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla Model Y Performance nearly sold out for 2021 appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-model-y-performance-2021-sell-out-near/",
      "link_type": "article",
      "item_date": 1633463997000,
      "item_id": "9e3ee72a",
      "timestamp": 1633704571444,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 5, 7:59 pm",
      "description_trimmed": "Tesla’s Model Y Performance variant, which is the fastest available configuration of the all-electric crossover, is nearly sold out for 2021, according to the company’s online Design Studio.\nTesla has dealt with widespread demand for its electric vehicles in 2021. As the movement...",
      "keywords": "Parts Shortages, Tesla Model, Projects Deliveries, Attributed Tesla"
    },
    {
      "title": "Tesla Amps Up Fight With Rivian, Cites Battery Secrets Theft",
      "description": "Tesla Amps Up Fight With Rivian, Cites Battery Secrets Theft",
      "author": "Hyperdrive - Bloomberg",
      "url": "https://www.bloomberg.com/news/articles/2021-10-03/tesla-amps-up-rivian-poaching-fight-cites-battery-secrets-theft?srnd=hyperdrive",
      "link_type": "article",
      "item_date": 1633452747000,
      "item_id": "b4d621c4",
      "timestamp": 1633704571312,
      "domain": "bloomberg.com",
      "item_date_formatted": "Oct 5, 4:52 pm",
      "description_trimmed": "Tesla Amps Up Fight With Rivian, Cites Battery Secrets Theft",
      "keywords": ""
    },
    {
      "title": "Lidar developer Ouster agrees to buy Sense Photonics as it takes aim at the auto industry",
      "description": "Ouster, a lidar company that went public this year via a SPAC merger, said it would acquire solid-state lidar startup Sense Photonics in an all-stock deal that was valued at around $68 million at close of markets on Monday.\nOnce the acquisition is complete, Ouster said it would establish a new business arm, Ouster Automotive, which will be headed by Sense CEO Shauna McIntyre. That business will integrate Sense’s 200-meter range solid-state lidar into a new lidar suite. San Francisco-based Sense’s claim to fame is also its improved field of view, as TechCrunch’s Devin Coldewey explained.\n\nSense Photonics flashes onto the lidar scene with a new approach and $26M\n\n\nAccording to a news statement, Ouster Automotive will also aim to advance negotiations with five automotive OEMs, though additional details about these potential deals were not provided. Should they turn into something solid, production would begin in 2025 or 2026.\nLidar is a key sensor in most autonomous driving stacks. The sensor, whose name is a shortened form of “light detection and ranging,” measures distance using lasers to generate a 3D map of the world. Along with radar, cameras and software, lidar is a critical part of the AV systems of some of the leading developers today, including companies like Waymo and Argo AI.\nIn February, Ouster CEO Angus Pacala said on the podcast “Shift” that the future of the lidar industry would be marked by consolidation. “There’s going to be three to five lidar companies within the next five years,” he said. This new acquisition is a mark that Ouster will be at the forefront of turning this prediction into a reality.\nEarlier this year, Ouster completed a merger with a blank-check firm in a deal valued at $1.9 billion. It joined rival lidar companies Luminar, Innoviz and Velodyne in taking the SPAC route to the public market. Ouster’s stock hit a year-to-date trading high of $15.39 in February; today, it’s trading for $7.41.\nUpdate: A spokesperson for Ouster confirmed to TechCrunch that the company expects the majority of Sense’s 80 employees to join McIntyre in joining Ouster.\nThe spokesperson added, “Ouster’s perspective has always been that auto OEMs want a multi-sensor suite of solid-state lidar, long to short-range, that can be manufactured at scale and integrated into the body of the vehicle for the low hundreds of dollars. That’s exactly what we’re planning to offer.”",
      "author": "TechCrunch",
      "url": "https://techcrunch.com/2021/10/05/lidar-developer-ouster-agrees-to-buy-sense-photonics-as-it-takes-aim-at-the-auto-industry/",
      "link_type": "article",
      "item_date": 1633451213000,
      "item_id": "43447e6d",
      "timestamp": 1633704572430,
      "domain": "techcrunch.com",
      "item_date_formatted": "Oct 5, 4:26 pm",
      "description_trimmed": "Ouster, a lidar company that went public this year via a SPAC merger, said it would acquire solid-state lidar startup Sense Photonics in an all-stock deal that was valued at around $68 million at close of markets on Monday.\nOnce the acquisition is complete, Ouster said it would e...",
      "keywords": "Ouster Automotive, Lidar Company, Lidar Companies, Lidar Suite"
    },
    {
      "title": "Lucid Air driven, Jeep Grand Cherokee 4xe, GM battery innovation: Today’s Car News",
      "description": "GM is focusing in on the batteries as the key to achieving a longer range and to lower costs. The Jeep Grand Cherokee plug-in hybrid will tow and go off-roading. And we drive the Lucid Air. This and more, here at Green Car Reports. The 2022 Lucid Air is already beating top numbers from Tesla in range and charging. But as we found in a very brief...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133778_lucid-air-driven-jeep-grand-cherokee-4xe-gm-battery-innovation-today-s-car-news",
      "link_type": "article",
      "item_date": 1633449300000,
      "item_id": "83ffac5a",
      "timestamp": 1633704572426,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 5, 3:55 pm",
      "description_trimmed": "GM is focusing in on the batteries as the key to achieving a longer range and to lower costs. The Jeep Grand Cherokee plug-in hybrid will tow and go off-roading. And we drive the Lucid Air. This and more, here at Green Car Reports. The 2022 Lucid Air is already beating top number...",
      "keywords": "Lucid Air, Longer Range"
    },
    {
      "title": "Tekion, the automotive retail platform headed by a former Tesla CIO, just tripled in value",
      "description": "A year ago, we told you about the opportunity that former Tesla CIO Jay Vijayan was chasing. His plan? To pull car dealers into the 21st century with a snazzy end-to-end automative SaaS platform like the one he helped develop inside Tesla. Customers could use it to order a car to their precise specifications; dealers could use it to see in real time to understand their inventory and seamlessly check in customers for service appointment; OEMs could use it to see exactly which of their parts were where, relative to said dealerships.\nThe list of ways the software would produce savings and improve efficiencies for both dealers and OEMs went on and on, as Vijayan explained it. Apparently, his Pleasanton, Calif., company, Tekion, is gaining meaningful traction, too.\nAccording to Vijayan, the company’s revenue has grown threefold over the last year; the number of states where dealers are using Tekion’s software has grown to 39 from 28; and the company just began working with its first dealership in Canada as part of a plan to become an international outfit.\nAccordingly, the company is today announcing $250 million in Series D financing that bumps its valuation a year ago from $1 billion to $3.5 billion today, and its total funding from $185 million to $435 million. Alkeon Capital and Durable Capital co-led the round. Other investors include Hyundai Motor Company, several dealer groups across the U.S., and earlier backers Advent International, Index Ventures and FM Capital.\nInterestingly, the global chip shortage and other parts-supply disruptions that drove down new vehicles sales down a whopping 26% last month, is only having a positive impact on Tekion, and a recent piece in Morning Brew suggests why.\n\nThis former Tesla CIO just raised $150 million more to pull car dealers into the 21st century\n\n\nWhen the outlet talked with the president of an automotive group in Columbus, Ohio, he said that because inventory is scarce, a sale that would have taken four hours to make before the chip shortage now closes in 52 minutes. That scarcity is also driving profits through the roof, with buyers paying more for both new and used inventory, and auto retailers benefiting from lower operating costs with less inventory. (A dealership in Fort Lauderdale, Fla., tells Morning Brew that its profits jumped 197% in Q1 2021 compared to Q1 2020.)\nCourtesy of tech from Tekion and some of its legacy competitors, retailers are presumably also able to operate faster when it comes to servicing the consumers who are waiting out the shortage and hoping to make their cars last longer.\n“The supply is less but the demand is strong, so everyone is making a lot of money,” Vijayan tells TechCrunch. “The dealers, the OEMs — they’re making a good amount of margin.”\nTekion, Vijayan adds, has been “very strong through that growth,” but he anticipates that next year will be even better when he foresees that inventory will begin to catch up to demand.\n\nFord expects semiconductor rebound, new vehicle demand to increase 2021 profits\n\n\n“I believe sometime next year there will be some level of correction in the market and that our technology platform will help both dealers and OEMs navigate the correction much more smoothly because it will continue to learn and evolve to provide insights on where they should focus their business.”\nIn the meantime, the growth of Tekion — whose operations are split between California and Bangalore, India —  appears to largely organic. Though the automotive world is known for spending lavishly on marketing and for aggressive sales tactics, just 17 of Tekion’s employees now 1,350 employees work in sales. “We don’t spend any money in marketing, or it’s very negligible. [We’re growing through] word of mouth,” Vijayan says.\nA deal struck back in March with General Motors — which is an early investor in Tekion, as is BMW and the Nissan-Renault-Mitsubishi Alliance — is also surely helping. Though it’s up to each franchise to opt in or out, GM dealers broadly are beginning to use Tekion’s white-labeled dealer management software to make it easier for customers to purchase an Chevy, Cadillac, Buick or GMC brand electric vehicle.\nThe platform reportedly operates similar to  GM’s existing Shop. Click. Drive. program, which allows users to search for certain GM vehicles at dealerships near them and complete a portion of the transaction online. It’s a lot better, though. So said one Chevrolet VP in conversation earlier this year with Automotive News, who described Tekion’s software as akin to GM’s internal program “on steroids.”",
      "author": "TechCrunch",
      "url": "https://techcrunch.com/2021/10/05/tekion-the-automotive-retail-platform-headed-by-a-former-tesla-cio-just-tripled-in-value/",
      "link_type": "article",
      "item_date": 1633448671000,
      "item_id": "a7f38a4b",
      "timestamp": 1633704572134,
      "domain": "techcrunch.com",
      "item_date_formatted": "Oct 5, 3:44 pm",
      "description_trimmed": "A year ago, we told you about the opportunity that former Tesla CIO Jay Vijayan was chasing. His plan? To pull car dealers into the 21st century with a snazzy end-to-end automative SaaS platform like the one he helped develop inside Tesla. Customers could use it to order a car to...",
      "keywords": "Year Ago, Tesla Cio, Dealer Groups, Chip Shortage"
    },
    {
      "title": "Regarding Today’s Jury Verdict",
      "description": "*Sharing this recent note to employees from Valerie Capers Workman, VP People:\nHi Team,\nEarlier today, a jury in San Francisco decided that in late 2015 and early 2016 Tesla failed to make sure that one contract employee (Owen Diaz) was not racially harassed while he worked at the Tesla Fremont factory.  I heard the testimony of every witness. I was at the defense table for Tesla every day during the trial because I wanted to hear firsthand what Mr. Diaz said happened to him.\n\n    \n  \n(Feed generated with FetchRSS)",
      "author": "News | Tesla",
      "url": "https://www.tesla.com/blog/regarding-todays-jury-verdict",
      "link_type": "article",
      "item_date": 1633401872000,
      "item_id": "7fb44ccd",
      "timestamp": 1633704572332,
      "domain": "tesla.com",
      "item_date_formatted": "Oct 5, 2:44 am",
      "description_trimmed": "*Sharing this recent note to employees from Valerie Capers Workman, VP People:\nHi Team,\nEarlier today, a jury in San Francisco decided that in late 2015 and early 2016 Tesla failed to make sure that one contract employee (Owen Diaz) was not racially harassed while he worked at th...",
      "keywords": "Tesla Failed, Earlier Today, Vp People, Recent Note"
    },
    {
      "title": "Tesla short-sellers are becoming a rare breed, market analysis shows",
      "description": "Tesla (NASDAQ: TSLA) short-sellers are becoming a rare breed, new data from IHS Markit Ltd., a London-based information company, shows.\nFor years, Tesla has been among the most shorted stocks on Wall Street. In the past, the company has had vocal critics like David Einhorn, Jim Chanos, Michael Burry, and others. However, $TSLA stock’s incredible run-up over the past two years has caused many of these short sellers to abandon their positions.\n\n\n\nTesla Showroom in Century City, California\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWhile Chanos essentially admitted defeat in an interview this year where he told CEO Elon Musk that he had done a great job, others have remained relatively vocal regarding their positions on Tesla stock. It seems many short sellers have followed in Chanos’ footsteps, as the data shows short levels are at their lowest since 2010 when Tesla went public at $13 per share.\nBloomberg stated in their report of the short interest that just 1.1% of available Tesla shares are borrowed by traders, which is a standard measure of short interest. This is based on IHS Markit’s data as of Thursday, September 30. S3 Partners, another data company that competes with IHS, indicated that their short interest calculations for Tesla stock came in at a slightly higher 3.2%. This is still the lowest-ever recorded short-interest percentage metric that S3 has ever captured for Tesla stock. S3 spokesperson Ihor Dusaniwsky stated that shares shorted decreased by 1.55 million shares last month.\nShort interest in Tesla hit record lows in December 2020, when many of the company’s skeptics began to abandon negative positions. At the tail end of last year, Tesla short-sellers suffered an estimated $28.5 billion in losses. Short interest had fallen to 31.4 million in December, as, just eleven months earlier in January 2020, it was at its peak of 93.6 million. 2020, despite being such a challenging year for so many entities, was perhaps Tesla’s most incredible year. It was without a doubt if you go off of stock price alone, which surged over 700% last year.\n2021 did not get off to a good start for shorts, either. Some reports had indicated that Tesla short-sellers had lost over $1 billion within the first five days of trading in 2021. In 2020, Tesla shorts felt $38 billion in losses alone.\nIf history is any indication of what short sellers will feel this year, it could be the reason for such decreased bets against Tesla. The company is coming off of its most successful quarter in history, as it reported 241,300 vehicle deliveries in Q3, with production coming in slightly lower. Both figures were the best in Tesla’s short but storied history, and the company is now within striking distance of attaining one million vehicle deliveries for the year if it can ramp Giga Texas and Giga Berlin production early in Q4.\nAt the time of writing, Tesla shares were up 1%, trading at $782.59.\nDisclosure: Joey Klender is a TSLA Shareholder.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla short-sellers are becoming a rare breed, market analysis shows appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-short-sellers-interest-decrease-2021/",
      "link_type": "article",
      "item_date": 1633377567000,
      "item_id": "3b51f070",
      "timestamp": 1633704572053,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 4, 7:59 pm",
      "description_trimmed": "Tesla (NASDAQ: TSLA) short-sellers are becoming a rare breed, new data from IHS Markit Ltd., a London-based information company, shows.\nFor years, Tesla has been among the most shorted stocks on Wall Street. In the past, the company has had vocal critics like David Einhorn, Jim C...",
      "keywords": "Short Interest, Rare Breed, Short Sellers, Tesla Stock"
    },
    {
      "title": "Tesla Loses China Fraud Case in Latest Setback in Key Market",
      "description": "Tesla Loses China Fraud Case in Latest Setback in Key Market",
      "author": "Hyperdrive - Bloomberg",
      "url": "https://www.bloomberg.com/news/articles/2021-09-30/tesla-loses-china-fraud-case-in-latest-setback-in-key-market?srnd=hyperdrive",
      "link_type": "article",
      "item_date": 1633080826000,
      "item_id": "c08ba9b3",
      "timestamp": 1633704571238,
      "domain": "bloomberg.com",
      "item_date_formatted": "Oct 1, 9:33 am",
      "description_trimmed": "Tesla Loses China Fraud Case in Latest Setback in Key Market",
      "keywords": ""
    },
    {
      "title": "Horrific Accident Involving A Tesla; Driver’s Life Saved By The Vehicle",
      "description": "Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a video and said that he was […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/09/30/horrific-accident-involving-a-tesla-drivers-life-saved-by-the-vehicle/",
      "link_type": "article",
      "item_date": 1633039797000,
      "item_id": "141c4e3c",
      "timestamp": 1633704572523,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Sep 30, 10:09 pm",
      "description_trimmed": "Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a vid...",
      "keywords": "Life Saved, Car Saved, Incredibly Lucky"
    },
    {
      "title": "Buying a Polestar is as easy as a Tesla, but with real customer service",
      "description": "Buying a Polestar has been billed by the automaker as simple as a few clicks on a smartphone. How very Tesla like. In reality, there are some slight growing pains as the new EV brand takes advantage of its relationship with an established automaker, Volvo. But the slick process first modeled by Tesla is coming along. Polestar and Volvo...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133653_how-to-buy-a-polestar",
      "link_type": "article",
      "item_date": 1633014000000,
      "item_id": "143dcf6a",
      "timestamp": 1633704572029,
      "domain": "greencarreports.com",
      "item_date_formatted": "Sep 30, 3:00 pm",
      "description_trimmed": "Buying a Polestar has been billed by the automaker as simple as a few clicks on a smartphone. How very Tesla like. In reality, there are some slight growing pains as the new EV brand takes advantage of its relationship with an established automaker, Volvo. But the slick process f...",
      "keywords": "Tesla Like"
    },
    {
      "title": "Model Y Achieves 5-Star Overall Safety Rating from NHTSA",
      "description": "Since the launch of Model S in 2012, we have engineered every Tesla around the same advanced architecture that maximizes occupant safety. Today, Model Y, Tesla’s mid-size Sport Utility Vehicle (SUV), is the latest Tesla vehicle to earn a 5-star safety rating in every category from the National Highway Traffic Safety Administration (NHTSA).",
      "author": "News | Tesla",
      "url": "https://www.tesla.com/blog/model-y-achieves-5-star-overall-safety-rating-nhtsa",
      "link_type": "article",
      "item_date": 1610568716000,
      "item_id": "d0e5b5d1",
      "timestamp": 1633704571218,
      "domain": "tesla.com",
      "item_date_formatted": "Jan 13, 8:11 pm",
      "description_trimmed": "Since the launch of Model S in 2012, we have engineered every Tesla around the same advanced architecture that maximizes occupant safety. Today, Model Y, Tesla’s mid-size Sport Utility Vehicle (SUV), is the latest Tesla vehicle to earn a 5-star safety rating in every category fro...",
      "keywords": "Safety Rating"
    },
    {
      "title": "U.S. Diversity, Equity and Inclusion Report",
      "description": "Today, we are publishing our first ever U.S. Diversity, Equity and Inclusion Report which outlines the current state of our DEI position and actions we are taking to engage with employees, candidates and community members, as we encourage talented people from all backgrounds to join us on our mission to accelerate the world’s transition to sustainable energy. We look forward to sharing further progress in future reports as we continue to innovate and enhance our diversity, equity and inclusion practices.",
      "author": "News | Tesla",
      "url": "https://www.tesla.com/blog/us-diversity-equity-and-inclusion-report",
      "link_type": "article",
      "item_date": 1607136975000,
      "item_id": "3290ee8c",
      "timestamp": 1633704571216,
      "domain": "tesla.com",
      "item_date_formatted": "Dec 5, 2:56 am",
      "description_trimmed": "Today, we are publishing our first ever U.S. Diversity, Equity and Inclusion Report which outlines the current state of our DEI position and actions we are taking to engage with employees, candidates and community members, as we encourage talented people from all backgrounds to j...",
      "keywords": "Inclusion Report, Inclusion Practices, Future Reports, Sustainable Energy"
    }
  ]
}
