{"etag":"W/\"39ad1a991f696169c1583d464ee39e54\"","items":[{"title":"Sun Tzu &amp; The Art Of The EV Tax Credit: How To Not Get Ripped Off By Dealers (Part 1)","description":"I know it’s not wise to count your chickens before they hatch, especially when you’re depending on the US Congress for something. So, I may be getting ahead of myself by discussing upcoming EV tax credits. As currently written, they’d give GM and Tesla buyers access to the tax credits again, but give US-made and […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/03/sun-tzu-the-art-of-the-ev-tax-credit-how-to-not-get-ripped-off-by-dealers-part-1/","link_type":"article","item_date":1635953851000,"item_id":"564e2ba7","timestamp":1636121442198,"domain":"cleantechnica.com","item_date_formatted":"Nov 3","description_trimmed":"I know it’s not wise to count your chickens before they hatch, especially when you’re depending on the US Congress for something. So, I may be getting ahead of myself by discussing upcoming EV tax credits. As currently written, they’d give GM and Tesla buyers access to the tax cr...","keywords":"Give Gm, Dealers Part"},{"title":"Tesla Deploys New Car Software Update for Cold Weather, Active Noise Reduction, TIDAL Music &amp; More","description":"Image: @greentheonly/Twitter\nTesla has begun rolling out a new software update that brings cold weather improvements, active noise reduction, TIDAL, and much more. The updates should significantly improve the experience of using its cars and make them even more user-friendly.Tesla recently began rolling out the new software, 2021.40, which has many interesting features that will undoubtedly make the user experience more enjoyable. The company has introduced a new TIDAL music streaming option so that owners can enjoy quality sound from the high-end audio systems installed in their vehicles. TIDAL is a Norwegian music, podcast, and video subscription streaming service recently acquired by Jack Dorsey's Square. Although it has fewer subscribers than other popular similar services, TIDAL offers original content and carefully curated playlists with over 70 million tracks and 250,000 music videos.\n\nTIDAL\nTIDAL streaming is now available from the Media menu with a TIDAL account. You can listen to TIDAL playlists or albums in high-quality audio by connecting to Wi-Fi and pressing Download on the selected content.\n\nThe software update also brings improved vehicle performance in cold weather. Tesla has optimized automatic battery pre-conditioning to consume less energy. In addition, you can now enable front defrost and maintain your climate settings when clearing ice and snow.\n\nCold Weather Improvements\nYou can now enable front defrost and maintain your climate settings when clearing ice and snow. As usual, tap the fan icon and select Keep Climate On when parked.Additionally, when using climate controls on the Tesla App, automatic battery pre-conditioning has been optimized to consume less energy.\n\nThe updated Model S and Model X have added Active Road Noise Reduction, which uses new microphones to enable active noise canceling.\n\nActive Road Noise Reduction\nYour vehicle now has the ability to actively reduce low-frequency road noise while driving on rough surfaces. To accomplish this, the system uses the seat microphones to measure the noise in the cabin, then generates anti-noise through the speakers to create quiet zones around the occupants.To access, tap Audio Settings &gt; Options &gt; Active Road Noise Reduction.\n\nTraffic Aware Cruise Control Chime, which was previously launched in China, will now also be added to its cars. When Traffic-Aware Cruise Control is activated, the car beeps, which was done in order to warn drivers if they accidentally activated TACC.\n\nTraffic Aware Cruise Control Chime\nYou will now receive an audio alert when Traffic-Aware Cruise Control is enabled. To disable, tap Controls&gt; Autopilot&gt; Traffic-Aware Cruise Control Chime.\n\nIn addition, Tesla added “British English” as an official language.\n\nNew Language Support\nYou can now select British English as your language. To update your language setting, tap Controls &gt; Display and select the desired option from the Language drop down menu.\n\n\n2021.40 Tesla Release Notes via Not a Tesla App\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-deploys-new-software-update-that-brings-to-vehicles-cold-weather-improvements-active-noise-reduction-tidal-and-more","link_type":"article","item_date":1635946095000,"item_id":"c8c3e5df","timestamp":1636121442107,"domain":"tesmanian.com","item_date_formatted":"Nov 3","description_trimmed":"Image: @greentheonly/Twitter\nTesla has begun rolling out a new software update that brings cold weather improvements, active noise reduction, TIDAL, and much more. The updates should significantly improve the experience of using its cars and make them even more user-friendly.Tesl...","keywords":"Cruise Control, Cold Weather, Software Update, Traffic Aware"},{"title":"Tesla Shares Slump After Musk Tweets That Hertz Deal Isn’t Done Yet","description":"Tesla Shares Slump After Musk Tweets That Hertz Deal Isn’t Done Yet","author":"Hyperdrive - Bloomberg","url":"https://www.bloomberg.com/news/articles/2021-11-02/tesla-shares-slump-after-musk-tweet-that-hertz-deal-not-done-yet?srnd=hyperdrive","link_type":"article","item_date":1635939918000,"item_id":"b6dc5534","timestamp":1636121442203,"domain":"bloomberg.com","item_date_formatted":"Nov 3","description_trimmed":"Tesla Shares Slump After Musk Tweets That Hertz Deal Isn’t Done Yet","keywords":""},{"title":"Uber London Adds Tesla Vehicles For Drivers Wanting To Buy Or Lease EVs","description":"Starting on November 3, Tesla vehicles will be available for Uber drivers in London wanting to buy or lease a clean energy vehicle, Reuters reports. This is part of a plan to encourage Uber’s customers to use EVs. The article noted that over 135 million pounds had been collected for drivers to use toward environmentally-friendly […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/11/02/uber-london-adds-tesla-vehicles-for-drivers-wanting-to-buy-or-lease-evs/","link_type":"article","item_date":1635908819000,"item_id":"119d662a","timestamp":1636121442196,"domain":"cleantechnica.com","item_date_formatted":"Nov 3","description_trimmed":"Starting on November 3, Tesla vehicles will be available for Uber drivers in London wanting to buy or lease a clean energy vehicle, Reuters reports. This is part of a plan to encourage Uber’s customers to use EVs. The article noted that over 135 million pounds had been collected ...","keywords":"Drivers Wanting, Uber Drivers, Tesla Vehicles"},{"title":"2021 Tesla Model X Refresh - First Look","description":"2021 Tesla Model X Refresh - First Look","author":"TeslaTracker Submissions","url":"https://youtu.be/PXif-YcFpig","link_type":"article","item_date":1635891488000,"item_id":"29fa8428","timestamp":1636121442320,"domain":"youtube.com","item_date_formatted":"Nov 2","description_trimmed":"2021 Tesla Model X Refresh - First Look","keywords":"Tesla Model"},{"title":"Supercharging non-Teslas, 10-minute wireless Taycan charge, Volvo mild hybrids driven: Today’s Car News","description":"Volvo is applying mild-hybrid tech to the rest of its lineup on the way to all-electric. Volkswagen is seeking a way to charge the Taycan and other premium EVs very quickly without charge cords. And Tesla is now accepting other brands’ EVs at a select few Supercharger stations. This and more, here at Green Car Reports. Tesla has said for...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134047_supercharging-non-teslas-10-minute-wireless-taycan-charge-volvo-mild-hybrids-driven-today-s-car-news","link_type":"article","item_date":1635868500000,"item_id":"3700a0a3","timestamp":1636121442312,"domain":"greencarreports.com","item_date_formatted":"Nov 2","description_trimmed":"Volvo is applying mild-hybrid tech to the rest of its lineup on the way to all-electric. Volkswagen is seeking a way to charge the Taycan and other premium EVs very quickly without charge cords. And Tesla is now accepting other brands’ EVs at a select few Supercharger stations. T...","keywords":"Premium Evs, Charge Cords, Supercharger Stations"},{"title":"Tesla and Hertz have no binding contract in massive Model 3 deal","description":"Tesla (NASDAQ: TSLA) and rental agency Hertz have no binding deal, according to Tesla CEO Elon Musk, who stated the two companies had not entered a legal partnership that would secure Hertz’s purchase of 100,000 Model 3 sedans.\nLast week, Tesla secured a massive order from Hertz for 100,000 units of the Model 3 electric sedan. Later in the week, Hertz confirmed that it would purchase between 150,000 and 200,000 units in total, with some units heading to ride-sharing platform Uber. A move that was likely secured by the ongoing transition to electrification, Tesla stock went soaring, giving the automaker its first trillion-dollar valuation. Hertz is already offering Model 3 units on its website, and a statement from the company shortly after the deal indicated some vehicles would be available sometime in November.\nCEO Elon Musk confirmed last week that Hertz did not receive any specific discounts or deals in purchasing the Model 3s. However, last night, he also stated that Hertz and Tesla had not entered a written or contractual partnership in response to the company’s massive surge in stock price over the previous week.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n“If any of this [stock price] is based on Hertz, I’d like to emphasize that no contract has been signed yet. Tesla has far more demand than production, therefore we will only sell cars to Hertz for the same margin as to consumers. Hertz deal has zero effect on our economics,” Musk Tweeted.\n\nYou’re welcome!\nIf any of this is based on Hertz, I’d like to emphasize that no contract has been signed yet.\nTesla has far more demand than production, therefore we will only sell cars to Hertz for the same margin as to consumers.\nHertz deal has zero effect on our economics.\n— Elon Musk (@elonmusk) November 2, 2021\n\n\nHertz responded to Musk’s statement but never acknowledged the lack of legally binding paperwork that would effectively confirm the company’s purchase of 100,000 cars. “As we announced last week, Hertz has made an initial order of 100,000 Tesla electric vehicles and is investing in new EV charging infrastructure across the company’s global operations,” Hertz said to Bloomberg in an emailed statement. “Deliveries of the Teslas already have started. We are seeing very strong early demand for Teslas in our rental fleet, which reflects market demand for Tesla vehicles.”\nTechnically, Hertz could pull out of the 150,000 vehicle figure and purchase fewer units. However, that seems unlikely due to the plans it has to send at least 50,000 units to Uber for ride-sharing and rental services. Additionally, the company has already started offering the Model 3 as a potential vehicle in some markets. Additionally, Hertz Interim CEO Mark Fields said that “initial interest is exceeding our expectations. It shows that our message got through.”\nTesla stock has gained over 50% of its value in the past month. However, Musk’s Tweet caused a slight slide, with shares dropping as much as 5.2% in the morning. The stock has rebounded slightly and is only down 1.65% at the time of writing.\nI’d love to hear from you! If you have any comments, concerns, or questions, please email me at joey@teslarati.com. You can also reach me on Twitter @KlenderJoey, or if you have news tips, you can email us at tips@teslarati.com.\nDisclosure: Joey Klender is a TSLA Shareholder.\nThe post Tesla and Hertz have no binding contract in massive Model 3 deal appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-tsla-hertz-model-3-deal-no-contract/","link_type":"article","item_date":1635866959000,"item_id":"2af2bb50","timestamp":1636121442213,"domain":"teslarati.com","item_date_formatted":"Nov 2","description_trimmed":"Tesla (NASDAQ: TSLA) and rental agency Hertz have no binding deal, according to Tesla CEO Elon Musk, who stated the two companies had not entered a legal partnership that would secure Hertz’s purchase of 100,000 Model 3 sedans.\nLast week, Tesla secured a massive order from Hertz ...","keywords":"Massive Model, Tesla Stock, Hertz Deal, Binding Contract"},{"title":"Tesla’s rally stalls as Elon Musk questions Hertz deal","description":"Electric car chief insists ‘no contract’ for rental car order but Hertz says deliveries have begun","author":"Electric vehicles","url":"https://www.ft.com/content/5b082961-a29c-4f98-92c8-1e469e75080b","link_type":"article","item_date":1635864836000,"item_id":"ec50c427","timestamp":1636121442319,"domain":"ft.com","item_date_formatted":"Nov 2","description_trimmed":"Electric car chief insists ‘no contract’ for rental car order but Hertz says deliveries have begun","keywords":"Rally Stalls"},{"title":"First tests of non-Tesla Supercharger sessions in the Netherlands shared online","description":"Tesla officially opened its Supercharger Network to non-Tesla EV owners in the Netherlands on November 1st. Non-Tesla EV owners have already started sharing their experiences with the Supercharger Network online.\n\n\n\nHyundai Ioniq owner Inse van houts shared his experience at a Tesla Supercharger station at Tilburg, the wool capital of the Netherlands, located in the southern province of North Brabant. He gets footage of Tesla employees test charging a Porsche Taycan at the station, showing the company’s efforts to provide service to all EVs.\n\n\n\n\n\nIt works! Charging the Ford Mach-e on a Tesla Supercharger in Naarden pic.twitter.com/QScMjxlwAy— Luc (@lucbronk) November 1, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nThen the EV owner starts charging his 2017 Hyundai Ioniq 2 using the Tesla app. After opening the app and connecting his vehicle, he discussed Tesla’s charging rates, including the company’s membership program.\n\n\n\nNon-Tesla owners who join the program will be charged the same charging rates as Tesla owners. The Ioniq 2 owner learns that the membership program will be €13 ($15) a month. The charging membership reveals Tesla’s ever-growing revenue opportunities.\n\n\n\n“The good thing about the membership is you can cancel it monthly, like basically, you can get a membership just to go on holiday and then afterward you can cancel it. It’sIt’s crazy good,” the Ioniq 2 owner stated.\n\n\n\n\n\nJust charged with the @PolestarCars Polestar 2 on the @Tesla @TeslaCharging in Breukelen the Netherlands. Good experience, charging starts within 10 seconds, max charging rate 46 kW (cold battery; 62% soc). Only cable length will be a challange for non-Tesla EVs! pic.twitter.com/k3mcmYlKbE— Reijer Kok (@ReijerKok) November 1, 2021\n\n\n\n\n\n\nThe Ioniq 2 owner shares that the only issue with charging at the Tesla station is the adapter, which does not connect perfectly with his car because of the charging port’s design. However, his vehicle does complete a charging session with no issues. In its announcement, Tesla notes that EV owners have 2 minutes to connect the charging cable to their cars after selecting the charting stall number in the app. The company also stated that only EVs with CCS connections could use Superchargers during the pilot stage.\n\n\n\nEarlier this year, Elon Musk shared that Europe, China, and most parts of the world use the same connector, so opening the Supercharger Network would be “fairly easy to do.” Recent videos, like the one discussed above, and pictures reveal that is pretty much the case with the open Supercharger Network in the Netherlands. Musk said that an adapter would be needed for EVs in North America.\n\n\n\n“So we developed our own connector, which in my opinion actually the best connector. It’sIt’s small and light and looks good. So an adapter is needed to work for EVs in North America. But people could buy this adapter. And we anticipate having it available at the Superchargers as well if people don’t sort of steal them or something,” he said.\n\n\n\nCheck out Telsa’s open Supercharger stations in the Netherlands below!\n\n\n\n\n\n\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post First tests of non-Tesla Supercharger sessions in the Netherlands shared online appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-supercharger-hyundai-ioniq-mach-e-test-video/","link_type":"article","item_date":1635821704000,"item_id":"9106941c","timestamp":1636121442418,"domain":"teslarati.com","item_date_formatted":"Nov 2","description_trimmed":"Tesla officially opened its Supercharger Network to non-Tesla EV owners in the Netherlands on November 1st. Non-Tesla EV owners have already started sharing their experiences with the Supercharger Network online.\n\n\n\nHyundai Ioniq owner Inse van houts shared his experience at a Te...","keywords":"Non Tesla, Ev Owners, Supercharger Network, Supercharger Sessions"},{"title":"@teslaownersSV You’re welcome!\n\nIf any of this is based on Hertz, I’d like to emphasize that no contract has been signed yet.\n\nT...","description":"@teslaownersSV You’re welcome!\n\nIf any of this is based on Hertz, I’d like to emphasize that no contract has been signed yet.\n\nTesla has far more demand than production, therefore we will only sell cars to Hertz for the same margin as to consumers.\n\nHertz deal has zero effect on our economics.","author":"@elonmusk on Twitter","url":"https://twitter.com/elonmusk/status/1455351085170823169","link_type":"article","item_date":1635817712000,"item_id":"7925ea4e","timestamp":1636121442409,"domain":"twitter.com","item_date_formatted":"Nov 2","description_trimmed":"@teslaownersSV You’re welcome!\n\nIf any of this is based on Hertz, I’d like to emphasize that no contract has been signed yet.\n\nTesla has far more demand than production, therefore we will only sell cars to Hertz for the same margin as to consumers.\n\nHertz deal has zero effect on ...","keywords":"Signed Yet, You Re"},{"title":"Non-Tesla Supercharger Pilot","description":"Non-Tesla Supercharger Pilot","author":"TeslaTracker Submissions","url":"https://www.tesla.com/support/non-tesla-supercharg","link_type":"article","item_date":1635805762000,"item_id":"8fb5586d","timestamp":1636121442411,"domain":"tesla.com","item_date_formatted":"Nov 1","description_trimmed":"Non-Tesla Supercharger Pilot","keywords":""},{"title":"REV Group receives order to build first fully-electric fire truck in North America","description":"REV Group, a specialty vehicle designer and manufacturer, announced it has received an order to build its all-electric, E-ONE Vector fire truck for the Mesa Fire and Medical Department in Arizona. When completed and delivered, the Vector will be the first fully-electric fire truck in North America. \n more…\nThe post REV Group receives order to build first fully-electric fire truck in North America appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/11/01/rev-group-receives-order-to-build-first-fully-electric-fire-truck-in-north-america/","link_type":"article","item_date":1635798448000,"item_id":"92829c75","timestamp":1636121442414,"domain":"electrek.co","item_date_formatted":"Nov 1","description_trimmed":"REV Group, a specialty vehicle designer and manufacturer, announced it has received an order to build its all-electric, E-ONE Vector fire truck for the Mesa Fire and Medical Department in Arizona. When completed and delivered, the Vector will be the first fully-electric fire truc...","keywords":"Fire Truck, Fully Electric"},{"title":"Tesla launches a new home charger that works with all electric cars","description":"Today, Tesla is launching a new home charger that comes with a J1772 plug, which works with all electric cars in North America – not just Tesla vehicles.\n more…\nThe post Tesla launches a new home charger that works with all electric cars appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/11/01/tesla-launches-new-home-charger-that-works-j1772-all-electric-cars/","link_type":"article","item_date":1635797681000,"item_id":"23a441be","timestamp":1636121442412,"domain":"electrek.co","item_date_formatted":"Nov 1","description_trimmed":"Today, Tesla is launching a new home charger that comes with a J1772 plug, which works with all electric cars in North America – not just Tesla vehicles.\n more…\nThe post Tesla launches a new home charger that works with all electric cars appeared first on Electrek.","keywords":"Home Charger"},{"title":"Tesla Experiments With Opening Superchargers To Other EVs","description":"For years, Tesla charging has been all take and no give. Tesla cars can charge at any charging station, but Superchargers won’t work for competing EVs. Now, based on the results of a ten-charger pilot in the Netherlands, that could be starting to change — but it’s not guaranteed.Read more...","author":"Jalopnik","url":"https://jalopnik.com/tesla-experiments-with-opening-superchargers-to-other-e-1847976207","link_type":"article","item_date":1635795300000,"item_id":"b7dfe1a7","timestamp":1636121442431,"domain":"jalopnik.com","item_date_formatted":"Nov 1","description_trimmed":"For years, Tesla charging has been all take and no give. Tesla cars can charge at any charging station, but Superchargers won’t work for competing EVs. Now, based on the results of a ten-charger pilot in the Netherlands, that could be starting to change — but it’s not guaranteed....","keywords":"Tesla Charging, Charging Station, Tesla Experiments, Tesla Cars"},{"title":"https://www.reuters.com/business/autos-transportation/tesla-opens-charging-network-other-evs-netherlands-2021-11-01/","description":"https://www.reuters.com/business/autos-transportation/tesla-opens-charging-network-other-evs-netherlands-2021-11-01/","author":"TeslaTracker Submissions","url":"https://www.reuters.com/business/autos-transportat","link_type":"article","item_date":1635792146000,"item_id":"1abd132e","timestamp":1636121442534,"domain":"reuters.com","item_date_formatted":"Nov 1","description_trimmed":"https://www.reuters.com/business/autos-transportation/tesla-opens-charging-network-other-evs-netherlands-2021-11-01/","keywords":""},{"title":"Toyota EV tech, Tesla recall, E-Tron range update, DOE on EV edge vs. gasoline: Today’s Car News","description":"Toyota shows that EVs aren’t tedious, with some technology firsts in its upcoming bZ4X. The 2019 Audi E-Tron SUV is getting more range. Some Tesla models are being recalled. And yes, EVs emit less than other vehicle types over their lifetime. This and more, here at Green Car Reports. A steering yoke, a solar roof, radiant heat, and...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134037_toyota-ev-tech-tesla-recall-e-tron-range-update-doe-on-ev-edge-vs-gasoline-today-s-car-news","link_type":"article","item_date":1635782100000,"item_id":"cd8884c9","timestamp":1636121442510,"domain":"greencarreports.com","item_date_formatted":"Nov 1","description_trimmed":"Toyota shows that EVs aren’t tedious, with some technology firsts in its upcoming bZ4X. The 2019 Audi E-Tron SUV is getting more range. Some Tesla models are being recalled. And yes, EVs emit less than other vehicle types over their lifetime. This and more, here at Green Car Repo...","keywords":"Tesla Recall, Range Update, Audi Tron, Evs Emit"},{"title":"First Tesla Superchargers for other automakers begin service, higher fees and membership offered","description":"Tesla is launching a pilot program for non-Tesla electric vehicles to use its Supercharger network for the first time.\nThe pilot program is based at 10 Supercharger locations in the Netherlands.\n more…\nThe post First Tesla Superchargers for other automakers begin service, higher fees and membership offered appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/11/01/tesla-launches-pilot-program-for-non-tesla-evs-open-supercharger-network/","link_type":"article","item_date":1635773483000,"item_id":"b71aa7cf","timestamp":1636121442515,"domain":"electrek.co","item_date_formatted":"Nov 1","description_trimmed":"Tesla is launching a pilot program for non-Tesla electric vehicles to use its Supercharger network for the first time.\nThe pilot program is based at 10 Supercharger locations in the Netherlands.\n more…\nThe post First Tesla Superchargers for other automakers begin service, higher ...","keywords":"Pilot Program, Higher Fees, Tesla Superchargers"},{"title":"Some 2019-2021 Tesla models recalled for suspension issue","description":"Tesla is recalling certain 2019-2021 Model 3 and 2020-2021 Model Y electric cars to address front suspension lateral link fasteners that could loosen over time. A pair of these fasteners attach the lateral link to a vehicle's subframe. If not secured to the proper specification, the fasteners could loosen or separate from the subframe, according...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134023_some-2019-2021-tesla-models-recalled-for-suspension-issue","link_type":"article","item_date":1635768000000,"item_id":"02c0bbdd","timestamp":1636121442507,"domain":"greencarreports.com","item_date_formatted":"Nov 1","description_trimmed":"Tesla is recalling certain 2019-2021 Model 3 and 2020-2021 Model Y electric cars to address front suspension lateral link fasteners that could loosen over time. A pair of these fasteners attach the lateral link to a vehicle's subframe. If not secured to the proper specification, ...","keywords":"Lateral Link"},{"title":"Inside Volvo-backed Polestar’s plan to compete with Tesla in the U.S.","description":"Inside Volvo-backed Polestar’s plan to compete with Tesla in the U.S.","author":"TeslaTracker Submissions","url":"https://www.cnbc.com/2021/07/02/polestar-backed-by","link_type":"article","item_date":1635730465000,"item_id":"6c240322","timestamp":1636121442706,"domain":"cnbc.com","item_date_formatted":"Nov 1","description_trimmed":"Inside Volvo-backed Polestar’s plan to compete with Tesla in the U.S.","keywords":""},{"title":"Indonesia and Foxconn in talks over electric vehicle investment","description":"Jakarta says plan in place but iPhone assembler only confirms discussions held","author":"Electric vehicles","url":"https://www.ft.com/content/f1a805aa-82ac-4f24-ad22-58e43712091e","link_type":"article","item_date":1635721206000,"item_id":"fea63aef","timestamp":1636121442515,"domain":"ft.com","item_date_formatted":"Oct 31","description_trimmed":"Jakarta says plan in place but iPhone assembler only confirms discussions held","keywords":"Iphone Assembler"},{"title":"Tesla Cybertruck in matte black looks stunning and daunting at the same time","description":"Not long after the Cybertruck was unveiled, Elon Musk confirmed on Twitter that Tesla would be offering a matte black option for the all-electric pickup truck. What has been relatively unknown until today was that Tesla seems to have created such a vehicle, or at least a model of the Cybertruck in matte black. And just as expected, it looks absolutely incredible. \n\n\n\nThe image of the matte black Cybertruck was recently shared on the r/TeslaMotors subreddit, though it was taken from the Instagram page of a former Tesla Aerodynamics Engineer. The picture was simple, showing the Cybertruck in the background and the next-generation Roadster in the foreground. The Cybertruck’s color was an unmistakable matte black in the photo, which gave the vehicle a very domineering look. \n\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nSo far, Tesla has built at least two functioning silver Cybertruck prototypes. One was the vehicle that was used for demonstrations and test drives during the Cybertruck unveiling in late 2019, and another was recently sighted at the Castle Airport in Atwater, California. The recently-sighted Cybertruck seemed different than the initial functional silver prototype, as it was fitted with side mirrors, what appeared to be a larger windshield, and a shorter hood. \n\n\n\nTesla has also showcased some non-functional Cybertruck models, however. During the unveiling, the company brought out what appeared to be a full-scale model of the Cybertruck finished in matte gray. The model provided a good contrast to the brushed silver look of the fully functional prototype, and it also gave a pretty fair idea of how the all-electric pickup truck would look like with a wrap. Considering that no matte black Cybertrucks have been spotted in motion to date, the vehicle in the recently shared image might be a full-sized model as well. \n\n\n\nTesla Cybertruck on stage at unveiling event in Los Angeles. Nov. 21, 2019 (Photo: Teslarati)\n\n\n\nIt will not be surprising if more Cybertrucks with different color options are spotted in the coming months. So far, Tesla has noted that it would start initial Cybertruck production at Gigafactory Texas by the end of 2022. As the company approaches this date, more Cybertrucks would likely be tested on public roads. Tesla already seems to be moving towards this, with the company confirming during the Q3 2021 earnings call that it had already built multiple Cybertruck alpha prototypes. \n\n\n\n“As you may have seen recently in social media, we’ve built a number of alphas and are currently testing those to further mature the design. And while those point out a few key additions like rear steer, there are also a number of smaller or less visible improvements though the product is largely true to the initial vision. We’ll continue to work through the product in the beta stages that we’re in now and look to launch that by next year,” Tesla Vice President of Vehicle Engineering Lars Moravy said. \n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla Cybertruck in matte black looks stunning and daunting at the same time appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-cybertruck-matte-black-photo/","link_type":"article","item_date":1635716885000,"item_id":"6f485c27","timestamp":1636121442544,"domain":"teslarati.com","item_date_formatted":"Oct 31","description_trimmed":"Not long after the Cybertruck was unveiled, Elon Musk confirmed on Twitter that Tesla would be offering a matte black option for the all-electric pickup truck. What has been relatively unknown until today was that Tesla seems to have created such a vehicle, or at least a model of...","keywords":"Matte Black, Tesla Cybertruck, Pickup Truck, Recently Sighted"},{"title":"Italy’s EV Market Keeps Growing — Plug-In Vehicles Reach 8.5% In Q3 2021","description":"Originally published on opportunity:energy. It’s been a stellar year so far for electric car sales. Throughout Europe, new records keep coming, with emerging markets consolidating into double-digit share for plug-in vehicles. In the wake of September records, Italy — Europe’s fourth largest auto market — has now entered a new phase in the race to […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/31/italys-ev-market-keeps-growing-plug-in-vehicles-reach-8-5-in-q3-2021/","link_type":"article","item_date":1635703022000,"item_id":"b04e1600","timestamp":1636121442704,"domain":"cleantechnica.com","item_date_formatted":"Oct 31","description_trimmed":"Originally published on opportunity:energy. It’s been a stellar year so far for electric car sales. Throughout Europe, new records keep coming, with emerging markets consolidating into double-digit share for plug-in vehicles. In the wake of September records, Italy — Europe’s fou...","keywords":"Plug In, Vehicles Reach, September Records"},{"title":"Toyota EV tech details; EV tax credit controversy; Tesla, Hertz, and Uber: The Week in Reverse","description":"Which company aims to help install 40,000 more destination chargers? Which EV startup plans to use Panasonic cylindrical cells, like Tesla? This is our look back at the Week In Reverse—right here at Green Car Reports—for the week ending October 30, 2021. In a review update of the 2021 Kia Sorento Hybrid, we found that it meets the mark...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134026_toyota-ev-tech-details-ev-tax-credit-controversy-tesla-hertz-and-uber-the-week-in-reverse","link_type":"article","item_date":1635681600000,"item_id":"d08ab905","timestamp":1636121442631,"domain":"greencarreports.com","item_date_formatted":"Oct 31","description_trimmed":"Which company aims to help install 40,000 more destination chargers? Which EV startup plans to use Panasonic cylindrical cells, like Tesla? This is our look back at the Week In Reverse—right here at Green Car Reports—for the week ending October 30, 2021. In a review update of the...","keywords":""},{"title":"Tesla recalls","description":"Tesla recalls","author":"TeslaTracker Submissions","url":"https://electrek.co/2021/10/29/tesla-recalls-2700-","link_type":"article","item_date":1635605299000,"item_id":"13646588","timestamp":1636121442793,"domain":"electrek.co","item_date_formatted":"Oct 30","description_trimmed":"Tesla recalls","keywords":""},{"title":"Energy secretary defends tax credits for EVs made by unionized automakers","description":"Energy secretary defends tax credits for EVs made by unionized automakers","author":"TeslaTracker Submissions","url":"https://www.cnbc.com/2021/10/29/energy-secretary-d","link_type":"article","item_date":1635601951000,"item_id":"937486e7","timestamp":1636121442718,"domain":"cnbc.com","item_date_formatted":"Oct 30","description_trimmed":"Energy secretary defends tax credits for EVs made by unionized automakers","keywords":""},{"title":"Panasonic Will Power Future Teslas with Way Larger, Higher-Capacity Cylindrical Battery Cells","description":"Panasonic Will Power Future Teslas with Way Larger, Higher-Capacity Cylindrical Battery Cells","author":"TeslaTracker Submissions","url":"https://www.caranddriver.com/news/a38093862/panaso","link_type":"article","item_date":1635601951000,"item_id":"39cfcfb3","timestamp":1636121442719,"domain":"caranddriver.com","item_date_formatted":"Oct 30","description_trimmed":"Panasonic Will Power Future Teslas with Way Larger, Higher-Capacity Cylindrical Battery Cells","keywords":""},{"title":"Famed venture capitalist John Doerr thinks the Tesla bulls are probably right","description":"Famed venture capitalist John Doerr thinks the Tesla bulls are probably right","author":"TeslaTracker Submissions","url":"https://www.cnbc.com/2021/10/28/john-doerr-tesla-b","link_type":"article","item_date":1635601951000,"item_id":"e9a64db4","timestamp":1636121442720,"domain":"cnbc.com","item_date_formatted":"Oct 30","description_trimmed":"Famed venture capitalist John Doerr thinks the Tesla bulls are probably right","keywords":""},{"title":"Tesla is recalling nearly 2,800 Model Y and Model 3 vehicles in the US over a potential suspension problem that could make the cars more lik","description":"Tesla is recalling nearly 2,800 Model Y and Model 3 vehicles in the US over a potential suspension problem that could make the cars more likely to crash","author":"TeslaTracker Submissions","url":"https://www.businessinsider.com/tesla-recall-model","link_type":"article","item_date":1635601951000,"item_id":"5749cd0f","timestamp":1636121442720,"domain":"businessinsider.com","item_date_formatted":"Oct 30","description_trimmed":"Tesla is recalling nearly 2,800 Model Y and Model 3 vehicles in the US over a potential suspension problem that could make the cars more likely to crash","keywords":""},{"title":"The meteoric rise of Tesla’s stock price is good for investors — even those who aren’t directly invested in Elon Musk’s car company","description":"The meteoric rise of Tesla’s stock price is good for investors — even those who aren’t directly invested in Elon Musk’s car company","author":"TeslaTracker Submissions","url":"https://www.washingtonpost.com/business/2021/10/30","link_type":"article","item_date":1635601951000,"item_id":"08fe35f2","timestamp":1636121442792,"domain":"washingtonpost.com","item_date_formatted":"Oct 30","description_trimmed":"The meteoric rise of Tesla’s stock price is good for investors — even those who aren’t directly invested in Elon Musk’s car company","keywords":"Stock Price, Meteoric Rise, Elon Musk"},{"title":"*NEWS* Refreshed Model X LR will be lighter, more powerful","description":"*NEWS*\nRefreshed Model X LR will be lighter, more powerful\n\nCompared to '20 Model X LR \n• 14% reduction in battery weight\n• 13% increase in battery specific energy\n• Power increased by more than 30%, equipped AC magnetic motors both front &amp; rear\n• 4% reduction in curve weight","author":"TeslaTracker Submissions","url":"https://twitter.com/tempermanant/status/1454011729","link_type":"article","item_date":1635551797000,"item_id":"816234f7","timestamp":1636121442716,"domain":"twitter.com","item_date_formatted":"Oct 29","description_trimmed":"*NEWS*\nRefreshed Model X LR will be lighter, more powerful\n\nCompared to '20 Model X LR \n• 14% reduction in battery weight\n• 13% increase in battery specific energy\n• Power increased by more than 30%, equipped AC magnetic motors both front &amp; rear\n• 4% reduction in curve weight","keywords":"Refreshed Model"},{"title":"Gen 3 charger can earn money soon and will show up in the Tesla Navigation (if public)","description":"​ From the page https://teslaenergy.formstack.com/forms/commercial_registration Tesla has uploaded a page for hosting commercial chargers.  https://www.tesla.com/support/commercial Anyone with a Gen 3 Wall Connector that is publicly available can manage their charger to be used as \"pay for use charging\".  Also managing the assets, pricing and analytics are possible. Cool stuff!    submitted by    /u/fahrty   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qigxb3/gen_3_charger_can_earn_money_soon_and_will_show/","link_type":"article","item_date":1635525672000,"item_id":"f2ec30bb","timestamp":1636121442822,"domain":"reddit.com","item_date_formatted":"Oct 29","description_trimmed":"​ From the page https://teslaenergy.formstack.com/forms/commercial_registration Tesla has uploaded a page for hosting commercial chargers.  https://www.tesla.com/support/commercial Anyone with a Gen 3 Wall Connector that is publicly available can manage their charger to be used a...","keywords":"Tesla Navigation, Wall Connector"},{"title":"I Paid $6000 For Tesla FSD &amp; Now Have The Privilege Of Taking Tesla’s Totally Unfair Safety Test","description":"Fritz reviews the Tesla FSD Safety Test every driver must ace to get a \"Feature Complete\" Full Self Driving.","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/29/i-paid-6000-for-tesla-fsd-now-have-the-privilege-of-taking-teslas-totally-unfair-safety-test/","link_type":"article","item_date":1635520743000,"item_id":"d281900d","timestamp":1636121442825,"domain":"cleantechnica.com","item_date_formatted":"Oct 29","description_trimmed":"Fritz reviews the Tesla FSD Safety Test every driver must ace to get a \"Feature Complete\" Full Self Driving.","keywords":"Taking Tesla"},{"title":"$12,500 EV tax credit, union-built bonus included in plan Biden claims can pass Congress","description":"A maximum $12,500 federal EV tax credit, including a bonus for union-made vehicles, appears to have survived the negotiation process and is now a likely part of the infrastructure bill. In its current form, the framework still includes a tax credit that \"will lower the cost of an electric vehicle that is made in America with American materials and...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1134010_12-500-ev-tax-credit-union-built-bonus-biden-congress","link_type":"article","item_date":1635514200000,"item_id":"c4b774b3","timestamp":1636121442630,"domain":"greencarreports.com","item_date_formatted":"Oct 29","description_trimmed":"A maximum $12,500 federal EV tax credit, including a bonus for union-made vehicles, appears to have survived the negotiation process and is now a likely part of the infrastructure bill. In its current form, the framework still includes a tax credit that \"will lower the cost of an...","keywords":"Tax Credit, Bonus Included, Electric Vehicle, Pass Congress"},{"title":"SK Targets New EV Battery Technology Two Years Ahead of Rivals","description":"SK Targets New EV Battery Technology Two Years Ahead of Rivals","author":"Hyperdrive - Bloomberg","url":"https://www.bloomberg.com/news/articles/2021-10-28/sk-innovation-targets-the-year-2025-for-solid-state-batteries?srnd=hyperdrive","link_type":"article","item_date":1635513124000,"item_id":"f8260497","timestamp":1636121442826,"domain":"bloomberg.com","item_date_formatted":"Oct 29","description_trimmed":"SK Targets New EV Battery Technology Two Years Ahead of Rivals","keywords":"Years Ahead"},{"title":"Tesla Takes Top Spot in Singapore Sedan Sales for First Time","description":"Tesla Takes Top Spot in Singapore Sedan Sales for First Time","author":"Hyperdrive - Bloomberg","url":"https://www.bloomberg.com/news/articles/2021-10-29/tesla-takes-top-spot-in-singapore-sedan-sales-for-first-time?srnd=hyperdrive","link_type":"article","item_date":1635513124000,"item_id":"9fe6f660","timestamp":1636121442828,"domain":"bloomberg.com","item_date_formatted":"Oct 29","description_trimmed":"Tesla Takes Top Spot in Singapore Sedan Sales for First Time","keywords":""},{"title":"The new Tesla Model X is hiding an understated but incredible secret","description":"The Tesla Model X may be the company’s flagship crossover SUV, but the vehicle has rarely gotten the spotlight this year. Even when Tesla refreshed the Model S and Model X, most of the attention was evidently focused on the Model S and its Plaid variant, which proceeded to destroy every comparable gas-powered vehicle in its class. \n\n\n\nBut as it turns out, Tesla has also made some notable improvements to the new Model X Long Range. The company has just not been highlighting them yet. Fortunately, and as shared online by electric vehicle enthusiast @tempermanant, Tesla’s application documents to the EPA have provided some hints as to what exactly changed between last year’s Model X series and this year’s refreshed flagship SUV. \n\n*NEWS*Refreshed Model X LR will be lighter, more powerfulCompared to '20 Model X LR • 14% reduction in battery weight• 13% increase in battery specific energy• Power increased by more than 30%, equipped AC magnetic motors both front &amp; rear• 4% reduction in curve weight pic.twitter.com/oOzW0vawdl— temp (@tempermanant) October 29, 2021\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nIt should be noted that Tesla’s filings for the 2021 Model X are only true for the Long Range variant, which has already started deliveries. Filings for the Model X Plaid, which features three electric motors and near-supercar performance, are yet to be made available. This is quite different from Tesla’s filings for the 2020 Model X, which represented both the base Model X Long Range Plus and the top-tier Model X Performance. \n\n\n\nA look at the documents shows that the refreshed Model X is lighter than its predecessor, with the new flagship SUV having a curb weight of 5,219 lbs. compared to the 2020 Model X Long Range Plus’ 5,437 lbs. This ~4% weight reduction seems to be partly due to the fact that the new Model X’s battery is ~14% lighter than last year’s Model X Long Range Plus. Tesla’s filings note that the new Model X is fitted with a battery that weighs 537 kg (1,183 lbs). In comparison, the Model X Long Range Plus featured a battery that weighed 625 kg (1,377 lbs). \nTesla Model X refresh gets in-depth exterior and interior walkthrough [Video]\n\n\n\nDespite being lighter, however, the new Model X Long Range is about 30% more powerful than its Long Range Plus predecessor. The new Model X now features two AC Permanent Magnet Motors, with the front being rated at 243 kW and the rear being rated at 248 kW. This is quite an improvement over the Model X Long Range Plus, which featured a front AC Permanent Magnet Motor rated at 180 kW and a rear AC Induction Motor rated at 189 kW. \n\n\n\nWhat is quite interesting here is that Tesla’s filings for the new Model X are so far only true for the flagship crossover SUV’s base variant. Needless to say, Tesla’s filings for the Model X Plaid would likely be even more compelling, and it would likely show even more drastic improvements compared to the already stellar 2020 Model X Performance. For context, last year’s Model X Performance was listed with a front AC Permanent Magnet Motor rated at 151 kW and a rear AC Induction motor rated at 273 kW. It would not be a surprise if the Model X Plaid’s three electric motors end up blowing these specs out of the water. \n\n\n\nCheck out Tesla’s filings for the new Model X Long Range in the document below. \n\n2021-Model-X by Simon Alvarez on Scribd\n\nAnd Tesla’s filings for last year’s Model X Long Range Plus and Model X Performance could be viewed below. \n2020-Model-X by Simon Alvarez on Scribd\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up.\n\n\nThe post The new Tesla Model X is hiding an understated but incredible secret appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-model-x-refresh-secret/","link_type":"article","item_date":1635510918000,"item_id":"11b29c9f","timestamp":1636121442804,"domain":"teslarati.com","item_date_formatted":"Oct 29","description_trimmed":"The Tesla Model X may be the company’s flagship crossover SUV, but the vehicle has rarely gotten the spotlight this year. Even when Tesla refreshed the Model S and Model X, most of the attention was evidently focused on the Model S and its Plaid variant, which proceeded to destro...","keywords":"Long Range, Tesla Model, Refreshed Model, Base Model"},{"title":"The Tesla $1tn dilemma for investors","description":"Now that the carmaker is such a big part of the S&amp;P 500 index, fund managers face rising pressure to buy the stock","author":"Electric vehicles","url":"https://www.ft.com/content/9294bee5-82c1-47df-9ca0-f178c126554d","link_type":"article","item_date":1635503751000,"item_id":"a994cc10","timestamp":1636121442703,"domain":"ft.com","item_date_formatted":"Oct 29","description_trimmed":"Now that the carmaker is such a big part of the S&amp;P 500 index, fund managers face rising pressure to buy the stock","keywords":"Tesla Tn, Big Part"},{"title":"Tesla's Latest FSD Beta Doesn't Seem Ready For Public Use, Which Raises Big Questions","description":"If someone tells you FSD drives better than a human, do not let that person drive you anywhere","author":"TeslaTracker Submissions","url":"https://jalopnik.com/teslas-latest-fsd-beta-doesnt","link_type":"article","item_date":1635464108000,"item_id":"a04e5ac4","timestamp":1636121442829,"domain":"jalopnik.com","item_date_formatted":"Oct 28","description_trimmed":"If someone tells you FSD drives better than a human, do not let that person drive you anywhere","keywords":"Fsd Drives"},{"title":"Tesla Cybertruck","description":"Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to T","author":"TeslaTracker Submissions","url":"https://tesla.com/cybertruck","link_type":"article","item_date":1635455574000,"item_id":"a22a794f","timestamp":1636121442835,"domain":"tesla.com","item_date_formatted":"Oct 28","description_trimmed":"Cybertruck is built with an exterior shell made for ultimate durability and passenger protection. Starting with a nearly impenetrable exoskeleton, every component is designed for superior strength and endurance, from Ultra-Hard 30X Cold-Rolled stainless-steel structural skin to T...","keywords":"Ultimate Durability, Superior Strength, Structural Skin, Passenger Protection","submitted_by":"derick.realwebdev+teslatracker"},{"title":"SANDY MUNRO on Who Can Catch Tesla... and How","description":"SANDY MUNRO on Who Can Catch Tesla... and How","author":"TeslaTracker Submissions","url":"https://youtu.be/fI-aEyS_dfc","link_type":"article","item_date":1635450631000,"item_id":"85089159","timestamp":1636121442830,"domain":"youtube.com","item_date_formatted":"Oct 28","description_trimmed":"SANDY MUNRO on Who Can Catch Tesla... and How","keywords":"Sandy Munro"},{"title":"Trillion-dollar Tesla has redefined what carmaking means","description":"The company’s technological edge and Musk’s cult-like following mark it out — for now","author":"Electric vehicles","url":"https://www.ft.com/content/dd1b4aa6-5065-416a-8068-ca5e12cf32f3","link_type":"article","item_date":1635423999000,"item_id":"45974cbe","timestamp":1636121442834,"domain":"ft.com","item_date_formatted":"Oct 28","description_trimmed":"The company’s technological edge and Musk’s cult-like following mark it out — for now","keywords":"Technological Edge, Carmaking Means, Trillion Dollar"},{"title":"Tesla Model 3 Hertz order could increase to 150,000 vehicles, no FSD included","description":"Hertz could extend its Tesla order to 150,000 vehicles if the venture with Uber proves successful, according to the rideshare platform’s CEO Dara Khosrowshahi.\n\n\n\nKhosrowshahi said Uber was confident that 50,000 Tesla vehicles would be a popular choice for drivers and consumers once they enter the rideshare platform.\n\n\n\n“I’ve always said that climate change is a team sport, and our drivers want to help. So we do think that based on the demand that we’ve seen for electric vehicles on our network and Tesla, obviously, is a great brand, is a great product. I think if we make Teslas available, there’ll be plenty of takers,” the Uber CEO stated during an interview on First Move with Julia Chatterley.\n\n\n\n\n\n\"Over the next 3 years, this could grow to 150,000 #Teslas that can be provided by Hertz to #Uber.\"Mark Fields, Interim CEO @Hertz and @Uber CEO @dkhos talk EV adoption &amp; building charging capacity. Plus, no self-driving options included for now!  Part 2 | @firstmove pic.twitter.com/G40TCDCMAd— Julia Chatterley (@jchatterleyCNN) October 27, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nHertz interim CEO Mark Fields added that if the program with Uber proved successful, the rental car company could provide even more Teslas to the rideshare network.\n\n\n\n“Over the next 3 years, this could grow to 150,000 Teslas that can be provided by Hertz to Uber,” said Hertz Interim CEO.\n\n\n\nMark Fields also stated that Hertz’s 100,000 Model 3 order did not include Tesla’s Full Self-Driving suite. Although he didn’t completely rule out the FSD use in the future. Uber drivers will have to be content with just basic Tesla Autopilot for now.\n\n\n\nEarlier this week, Tesla inked a deal with Hertz Global Holdings Inc. for a 100,000 Model 3 vehicle order. The agreement stands as the single-largest purchase for electric vehicles to date, representing about $4.2 billion in revenue. Elon Musk revealed that Hertz paid full price for its order.\n\n\n\nFollowing the news of Hertz’s 100,000 Model 3 order, the car rental company announced that it would be partnering with Uber Technologies Inc. Hertz would add up to 50,000 Tesla vehicles to the Uber Network by 2023, based on the partnership.\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla Model 3 Hertz order could increase to 150,000 vehicles, no FSD included appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-model-3-hertz-150000-vehicle-order/","link_type":"article","item_date":1635404340000,"item_id":"66973417","timestamp":1636121442897,"domain":"teslarati.com","item_date_formatted":"Oct 28","description_trimmed":"Hertz could extend its Tesla order to 150,000 vehicles if the venture with Uber proves successful, according to the rideshare platform’s CEO Dara Khosrowshahi.\n\n\n\nKhosrowshahi said Uber was confident that 50,000 Tesla vehicles would be a popular choice for drivers and consumers o...","keywords":"Tesla Vehicles, Electric Vehicles, Hertz Order, Rideshare Platform"},{"title":"Accelerating the electric vehicle transition","description":"Shift is going to be determined by availability of commodities as well as related infrastructure","author":"Electric vehicles","url":"https://www.ft.com/content/41654a34-d472-4aa2-bdab-d5a685af800e","link_type":"article","item_date":1635393640000,"item_id":"94ea692c","timestamp":1636121442833,"domain":"ft.com","item_date_formatted":"Oct 28","description_trimmed":"Shift is going to be determined by availability of commodities as well as related infrastructure","keywords":""},{"title":"To be clear, cars sold to Hertz have no discount. Same price as to consumers.","description":"To be clear, cars sold to Hertz have no discount. Same price as to consumers.","author":"TeslaTracker Submissions","url":"https://twitter.com/elonmusk/status/14527946194109","link_type":"article","item_date":1635384946000,"item_id":"7c03c3fc","timestamp":1636121442831,"domain":"twitter.com","item_date_formatted":"Oct 28","description_trimmed":"To be clear, cars sold to Hertz have no discount. Same price as to consumers.","keywords":"Cars Sold"},{"title":"Fisker Dangles Ocean EV SUV Interior Breakthroughs Ahead of Full Reveal","description":"Fisker Dangles Ocean EV SUV Interior Breakthroughs Ahead of Full Reveal","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/fisker-ocean-ev-suv-interior-cabin-tech-details/","link_type":"article","item_date":1635383289000,"item_id":"ec035535","timestamp":1636121442702,"domain":"motortrend.com","item_date_formatted":"Oct 28","description_trimmed":"Fisker Dangles Ocean EV SUV Interior Breakthroughs Ahead of Full Reveal","keywords":""},{"title":"1,000 HP BATTLE * Ferrari SF90 vs Tesla Plaid DRAG RACE","description":"1,000 HP BATTLE * Ferrari SF90 vs Tesla Plaid DRAG RACE","author":"TeslaTracker Submissions","url":"https://youtu.be/8CF56F-4L8A","link_type":"article","item_date":1635368227000,"item_id":"9739d350","timestamp":1636121442832,"domain":"youtube.com","item_date_formatted":"Oct 27","description_trimmed":"1,000 HP BATTLE * Ferrari SF90 vs Tesla Plaid DRAG RACE","keywords":"Hp Battle"},{"title":"Every electric vehicle with at least 300 miles of range","description":"The jaw-dropping Lucid Air Dream edition electric vehicle has massive range — and a price tag to match. \n\nThis Saturday, the very first Lucid cars will be delivered at the company’s headquarters in Northern California. The luxury sedan can travel 520 miles on a single charge, the most of any EV available anywhere. But that long range will cost you at least $169,000.\n    \n\n\n\n            \n            Lucid's cars are finally here.\n            Credit: LUCID\n        \n    \nHere are other electric vehicles that get at least 300 miles on a single charge. It’s not a long list now, but as more EVs arrive in 2022 and beyond (we’re looking at you, BMW iX, Ford F-150 Lightning, and Cadillac Lyriq), the range wars will be on.\n        SEE ALSO:\n        \n            Everything you need to know before buying an electric car\n                            \n                    \n    \nTesla\n    \n\n\n\n            \n            A family of long-range EVs.\n            Credit: TESLA\n        \n    \nTesla offers a large selection of \"long range,\" dual-motor cars with more than 300 miles of range. Tesla Model S Long RangeThis is the longest-lasting Tesla available with a 405-mile range. It starts at just under $95,000.Tesla Model S Plaid The revamped sedan is a speed demon (0 to 60 mph in under 2 seconds!) while also offering nearly 400 miles on a single charge. It's the priciest option, starting at $129,990Tesla Model X Long RangeTesla's original electric SUV and its 360-mile range doesn't come cheap. It starts at just under $105,000. Next year, a Plaid version of the X will be available with a range of 340 miles.Tesla Model Y Long RangeThe Model Y is a bigger version of the Model 3 that gets 326 miles on a single charge. It starts at just under $57,000.Tesla Model Y Performance The more expensive Model Y edition (just under $62,000) still gets 303 miles on a charge. Tesla Model 3 Long Range The \"budget\" Model 3 offers a hearty 353 miles of range for under $50,000.Tesla Model 3 PerformanceThe performance version of the Model 3 has a 315-mile range and starts at $58,000.Rivian R1T\n    \n\n\n\n            \n            The electric R1T pickup truck finally made it.\n            Credit: RIVIAN\n        \n    \nWhile the electric pickup truck may be hitting some production delays, the first R1T trucks are on the road. Each boasts a 135 kWh battery with over 300 miles of range. The first \"launch edition\" starts at $73,000. A cheaper version is planned for next year.Ford Mustang Mach-E\n    \n\n\n\n            \n            Charging up the first-ever electric Mustang.\n            Credit: Ford\n        \n    \nFord's first electric Mustang has an entire line-up of SUVs. But only one edition makes it over 300 miles of range: the California Route 1 RWD and AWD versions with 305- and 300-mile ranges, respectively. It starts at just over $50,000.This list will be updated as more long-range EVs become available.","author":"Mashable","url":"https://mashable.com/article/lucid-air-long-range-electric-vehicles","link_type":"article","item_date":1635360915000,"item_id":"7012db4d","timestamp":1636121442992,"domain":"mashable.com","item_date_formatted":"Oct 27","description_trimmed":"The jaw-dropping Lucid Air Dream edition electric vehicle has massive range — and a price tag to match. \n\nThis Saturday, the very first Lucid cars will be delivered at the company’s headquarters in Northern California. The luxury sedan can travel 520 miles on a single charge, the...","keywords":"Single Charge, Long Range, Tesla Model, Ford Ford's"},{"title":"Lucid confirms Air Dream Edition’s first deliveries will take place October 30th","description":"Lucid Group has confirmed that it will deliver the first Air Dream Edition all-electric sedans on Saturday, October 30, with an exclusive Dream Delivery event in California.\nAfter starting production of the Lucid Air last month at its production facility in Casa Grande, Arizona, Lucid has now confirmed that it will launch the rollout of its first-ever electric vehicle on Saturday, as a select group of reservation holders have been invited to take delivery of the Air sedan this weekend.\nLucid will not only be performing customer deliveries at the event. Additionally, customers will experience the Lucid Rally, an event hosted by members of Lucid’s leadership team on a closed course that will showcase the handling, performance, and ride capabilities of the company’s first all-electric sedan. Customers will then take their personally-configured Air Dream Edition sedans home.\n\n\n\nCredit: Lucid Group\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nLucid holds the record for the vehicle with the most EPA-estimated range, which can achieve 520 miles of driving on a single charge. The Dream Edition models of the Air are developed with a 118 kWh version of the long-range battery pack developed by Lucid, featuring 22 modules and 6,600 battery cells. The vehicle delivers 4.4 miles per kWh, which is only surpassed by the Grand Touring edition of the Air with 4.6 miles per kWh. The Dream Edition Performance tops the charts with performance metrics, however, offering 1,111 horsepower, achieving a 0-60 mph time of just 2.41 seconds and a quarter-mile time of 9.67 seconds.\nCEO and CTO of Lucid Group, Peter Rawlinson, said:\n“Creating the Lucid Air has truly been a labor of love, with customer deliveries representing the culmination of years of endeavor from the entire Lucid team. So I’m truly excited to hand the keys to our first dear customers and accompany them on an inaugural drive through the iconic California countryside.”\nLucid plans to deliver 520 customer-configured Air Dream Editions, with the Grand Touring versions beginning deliveries soon thereafter. Touring and Pure models are anticipated for delivery to customers during 2022.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Lucid confirms Air Dream Edition’s first deliveries will take place October 30th appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/lucid-air-dream-edition-first-deliveries-october-30/","link_type":"article","item_date":1635340838000,"item_id":"bbc751ec","timestamp":1636121442932,"domain":"teslarati.com","item_date_formatted":"Oct 27","description_trimmed":"Lucid Group has confirmed that it will deliver the first Air Dream Edition all-electric sedans on Saturday, October 30, with an exclusive Dream Delivery event in California.\nAfter starting production of the Lucid Air last month at its production facility in Casa Grande, Arizona, ...","keywords":"Lucid Air, Lucid Group, Air Sedan, Lucid Rally"},{"title":"So now you can summon your vehicle with autopilot?","description":"submitted by    /u/No-Towel7011   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qfxp7z/so_now_you_can_summon_your_vehicle_with_autopilot/","link_type":"article","item_date":1635219204000,"item_id":"1df0be6c","timestamp":1636121443018,"domain":"reddit.com","item_date_formatted":"Oct 26","description_trimmed":"submitted by    /u/No-Towel7011   [link]   [comments]","keywords":""},{"title":"Elon Musk confirms Herts ordered 100,000 Teslas at the same price consumers would pay (no fleet discounts)","description":"submitted by    /u/Lukequist   [link]   [comments]","author":"r/TeslaMotors - Your Tesla Community on Reddit on Reddit","url":"https://www.reddit.com/r/teslamotors/comments/qfuy4a/elon_musk_confirms_herts_ordered_100000_teslas_at/","link_type":"article","item_date":1635209903000,"item_id":"87f0425a","timestamp":1636121443016,"domain":"reddit.com","item_date_formatted":"Oct 26","description_trimmed":"submitted by    /u/Lukequist   [link]   [comments]","keywords":"Price Consumers"}],"item_upvotes":{"210099a2":{"auth0|615cb90b861e13006987e6c1":true},"5a0b459f":{"auth0|615cb90b861e13006987e6c1":true},"ccfad374":{"auth0|615cb90b861e13006987e6c1":true},"31e9f0c8":{"auth0|615cb90b861e13006987e6c1":true},"946a71f6":{},"564e2ba7":{"auth0|615cb90b861e13006987e6c1":true},"c8c3e5df":{"auth0|615cb90b861e13006987e6c1":true},"119d662a":{"auth0|615cb90b861e13006987e6c1":true},"7925ea4e":{"auth0|615cb90b861e13006987e6c1":true},"29fa8428":{"auth0|615cb90b861e13006987e6c1":true},"3700a0a3":{"auth0|615cb90b861e13006987e6c1":true}},"user_favorites":{"auth0|615cb90b861e13006987e6c1":[{"item_id":"5a0b459f","action_date":1636118679140},{"item_id":"ccfad374","action_date":1636118693513},{"item_id":"31e9f0c8","action_date":1636118965709},{"item_id":"564e2ba7","action_date":1636123379505},{"item_id":"c8c3e5df","action_date":1636123396518},{"item_id":"b6dc5534","action_date":1636123398205},{"item_id":"119d662a","action_date":1636123400110}]},"user_upvotes":{"auth0|615cb90b861e13006987e6c1":[{"item_id":"5a0b459f","action_date":1636118681604},{"item_id":"ccfad374","action_date":1636118727082},{"item_id":"31e9f0c8","action_date":1636119488057},{"item_id":"210099a2","action_date":1636119781327},{"item_id":"564e2ba7","action_date":1636123380327},{"item_id":"c8c3e5df","action_date":1636123396151},{"item_id":"119d662a","action_date":1636123399509},{"item_id":"7925ea4e","action_date":1636123549345},{"item_id":"29fa8428","action_date":1636123551812},{"item_id":"3700a0a3","action_date":1636123552134}]},"comments":[{"item_id":"210099a2","author":"derick.realwebdev+teslatracker","contents":"Hello how are you?","comment_date":"1636118622069","comment_date_formatted":"Nov 5","parent_id":"null","comment_id":"598c6554"}]}