{"etag":"W/\"39ad1a991f696169c1583d464ee39e54\"","items":[{"title":"Volkswagen CEO warns shift to electric vehicles could cost 30,000 jobs -sources","description":"Volkswagen CEO warns shift to electric vehicles could cost 30,000 jobs -sources","author":"TeslaTracker Submissions","url":"https://www.reuters.com/business/autos-transportat","link_type":"article","item_date":1634148537000,"item_id":"17dff6cb","timestamp":1634168251925,"domain":"reuters.com","item_date_formatted":"Oct 13, 6:08 pm","description_trimmed":"Volkswagen CEO warns shift to electric vehicles could cost 30,000 jobs -sources","keywords":"Jobs Sources"},{"title":"Ford Motor Co no longer has Rivian board representative","description":"Ford Motor Co no longer has Rivian board representative","author":"TeslaTracker Submissions","url":"https://www.reuters.com/business/autos-transportat","link_type":"article","item_date":1634148537000,"item_id":"4a7ed1c0","timestamp":1634168251927,"domain":"reuters.com","item_date_formatted":"Oct 13, 6:08 pm","description_trimmed":"Ford Motor Co no longer has Rivian board representative","keywords":""},{"title":"Tesla China’s new King: The Model Y overtakes Model 3 in September","description":"Tesla China has a new King EV, according to figures from the Chinese Passenger Car Association (CPCA). The Chinese entity responsible for tracking new vehicle registration has revealed the Model Y is officially the best-selling Tesla vehicle in China, overtaking the Model 3, which has been one of the biggest catalysts to the EV revolution in the country.\nThe Model Y is an all-electric crossover that entered the lineup of Tesla vehicles in March 2020 after initial production began. Since then, the vehicle has gained a massive amount of notoriety due to its widespread appeal in nearly every market that it is available in. In Tesla’s home state of California, the Model Y took only seven months to pass the sales figures of the Model 3. The two vehicles are extremely similar and share many of the same parts, up to 75%, according to some Tesla executives. The difference between the two cars really amounts to size, cargo space, and body style.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWhile the Model Y has continued to establish its long-awaited title as Tesla’s most popular vehicle in general, the all-electric crossover is now overtaking the Model 3 in the Chinese automotive market. The Model 3 has performed exceptionally well in China since being delivered for the first time in the country nearly two years ago. It dominated sales figures for all of 2020, while 2021 has been friendly to the Model 3 as well. However, it has taken a backseat to the more affordable but less luxurious HongGuang Mini EV from GM’s conglomerate with Wuling and SAIC in China.\nTesla has still kept its eyes on the prize to deliver the highest quality electric vehicles in China. The Model Y has now overtaken the Model 3 in domestic sales, CPCA figures show. 33,033 Model Y units were sold in September alone, while 19,120 Model 3 builds were registered to new owners during Q3’s final month.\nThe surge of increasing Model Y sales can be attributed to Tesla’s appeal as an EV maker in China. Yesterday, the CPCA reported Tesla’s largest quarter in terms of deliveries in China, with 56,006 units.\n\nTesla China sold 19,120 Model 3 and 33,033 Model Y in September domestically. (CPCA)\n— Kelvin Yang (@KelvinYang7) October 13, 2021\n\n\nThe Model Y continues to dominate EV leaderboards globally, including the increasingly popular Chinese market that has contributed incredibly to the transition to electrification. CEO Elon Musk also has high hopes for the Model Y, stating that he expects the car to be the most popular vehicle in the world in 2022.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla China’s new King: The Model Y overtakes Model 3 in September appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-china-model-y-new-king-model-3-september-sales/","link_type":"article","item_date":1634148280000,"item_id":"ac1f4744","timestamp":1634168251839,"domain":"teslarati.com","item_date_formatted":"Oct 13, 6:04 pm","description_trimmed":"Tesla China has a new King EV, according to figures from the Chinese Passenger Car Association (CPCA). The Chinese entity responsible for tracking new vehicle registration has revealed the Model Y is officially the best-selling Tesla vehicle in China, overtaking the Model 3, whic...","keywords":"Overtakes Model, Increasing Model, Popular Vehicle, Tesla China"},{"title":"Tesla Invests the Most in R&amp;D &amp; Least in Advertising Among All Automakers","description":"Image: Visual Capitalist\nThere is a popular belief that word-of-mouth is the best advertisement. While traditional automakers continue to spend billions of dollars on advertising, Tesla is on the right track and instead invests that money in research and development (R&amp;D). Today, Tesla, among other automakers, spends the most on R&amp;D and the least on advertising per vehicle sold, while receiving exceptional word-of-mouth advertising.Investment in R&amp;D determines the future of the company, which has been proven for decades. Companies that are constantly evolving to provide consumers with the best products are always ahead of those that don't think about it. A great product and satisfied customers are the best advertising.Visual Capitalist surveyed the 2020 10-K filings of traditional automotive companies to see how much each of them spends on advertising and R&amp;D per vehicle produced. The results were astounding, as Tesla is the only manufacturer in the industry to spend $0 on advertising while nearly $3,000 on R&amp;D per vehicle.Marketing is usually a significant expense for most car manufacturers, however they are not as willing to spend money on R&amp;D. Tesla is now the only automaker to spend on average a whopping $2,984 per vehicle sold on R&amp;D, almost three times more than other traditional automakers. This amount is also almost equal to what the next three manufacturers spend together.In second place is Ford, which spends an average of $1,186 on R&amp;D for every car sold. In third place is Toyota, which spends $1,063. The fourth place is taken by GM with $878. Chrysler, which spends $784 on R&amp;D, closes out the top five. At the same time, these companies spend a lot of their funds on advertising.The average cost of advertising for traditional carmakers is $495 per vehicle. During this time, Tesla spends nothing on advertising, although its cars are so popular that they dominate in press mentions, social media, and are also used in films, TV shows, and other companies' advertisements. For example, several Tesla cars have recently appeared in new Pepsi advertisements.Balancing R&amp;D and advertising costs is part of the capital allocation, a decision that every business needs to make. R&amp;D can improve and enhance the quality of goods or services compared to competitors. If done correctly, it can lead to greater pricing, which will be reflected in profits. Advertising can spread information about products and promote a business without providing any benefit to improve the product itself.\n\nPer car sold, Tesla invests the most in research and development and the least in advertisingCustomers appreciate that pic.twitter.com/ahiIbLQZPS\n— Alex (@alex_avoigt) October 12, 2021\n\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/among-all-car-manufacturers-tesla-invests-the-most-in-r-d-and-the-least-in-advertising","link_type":"article","item_date":1634147612000,"item_id":"750d4ac8","timestamp":1634168251369,"domain":"tesmanian.com","item_date_formatted":"Oct 13, 5:53 pm","description_trimmed":"Image: Visual Capitalist\nThere is a popular belief that word-of-mouth is the best advertisement. While traditional automakers continue to spend billions of dollars on advertising, Tesla is on the right track and instead invests that money in research and development (R&amp;D). To...","keywords":"Tesla Invests, Vehicle Sold, Car Sold, Development Amp"},{"title":"U.S. asks Tesla why it did not recall Autopilot after software changes","description":"U.S. asks Tesla why it did not recall Autopilot after software changes","author":"TeslaTracker Submissions","url":"https://www.reuters.com/business/autos-transportat","link_type":"article","item_date":1634146752000,"item_id":"380fff22","timestamp":1634168251928,"domain":"reuters.com","item_date_formatted":"Oct 13, 5:39 pm","description_trimmed":"U.S. asks Tesla why it did not recall Autopilot after software changes","keywords":"Recall Autopilot"},{"title":"Tesla’s Move To Texas &amp; Its ESG Status","description":"Tesla is a disruptive force that is changing the way the entire world engages in energy consumption. That's why Tesla's move to Texas seems so contradictory and is worrying environmental, social, and governance-focused investors.","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/13/teslas-move-to-texas-its-esg-status/","link_type":"article","item_date":1634146455000,"item_id":"0f8aef26","timestamp":1634168251923,"domain":"cleantechnica.com","item_date_formatted":"Oct 13, 5:34 pm","description_trimmed":"Tesla is a disruptive force that is changing the way the entire world engages in energy consumption. That's why Tesla's move to Texas seems so contradictory and is worrying environmental, social, and governance-focused investors.","keywords":"Tesla's Move, Texas Amp, Worrying Environmental"},{"title":"Tesla is under pressure from NHTSA over Full Self-Driving Beta NDA and ‘stealth recall’","description":"The NHTSA is upping the pressure on Tesla as the regulator asked for more information about the non-disclosure agreement it made Full Self-Driving Beta testers agree to.\nThe government is also questioning Tesla about what it believes to be a potential “stealth recall” of Autopilot.\n more…\nThe post Tesla is under pressure from NHTSA over Full Self-Driving Beta NDA and ‘stealth recall’ appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/13/tesla-under-pressure-nhtsa-over-full-self-driving-beta-nda-stealth-recall/","link_type":"article","item_date":1634143602000,"item_id":"c8f7d861","timestamp":1634168251930,"domain":"electrek.co","item_date_formatted":"Oct 13, 4:46 pm","description_trimmed":"The NHTSA is upping the pressure on Tesla as the regulator asked for more information about the non-disclosure agreement it made Full Self-Driving Beta testers agree to.\nThe government is also questioning Tesla about what it believes to be a potential “stealth recall” of Autopilo...","keywords":"Beta Nda"},{"title":"Tesla’s move to Texas labeled ‘betrayal’ of California, a way to escape paying taxes","description":"Upon moving from Silicon Valley to Austin, Texas, critics and fans of Tesla and its CEO Elon Musk have mixed opinions about the move. Tesla enthusiasts might have seen it coming all along, especially after California politicians spewed profanities in the direction of the CEO, whose company has already provided an influx of employment opportunities to its new Texas market. However, without darkness, there would not be light, and there are plenty of people who are widely skeptical of Tesla’s recent decision to move its Headquarters to Austin from Fremont. However, the reasons for the move are being labeled as a betrayal of California and its workers, even though Tesla has no intentions to move any of its facilities out of the Golden State. Additionally, a commonly spread myth about all billionaires attempting to avoid paying taxes is also being thrown into the mix, further adding fuel to a fire that doesn’t really need to exist.\nA recent article from the San Antonio Express-News indicates that Musk and Tesla have betrayed its California workers who have built the electric automaker from a longshot success story to the most highly-valued car company on Earth. Despite the reasoning from the article’s author, which misses the point of Tesla’s move, the narrative that Elon Musk is some sort of evil super villain sitting in a large chair with excessive lumbar support sitting in a billionaire’s palace scheming new reasons to get ahead while squishing the “average Joe” seems to appear out of nowhere. Even though Musk’s entire vision was to help avert a climate crisis and revolutionize the automotive industry, some people still seem to be convinced he is a man with horrible intentions. Still, the South African-born CEO was essentially driven out of California by its own people of authority. They asked, he granted, and now Musk is still being painted as the bad guy.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nThe assumption that Musk is forcing Tesla and its several manufacturing plants, logistics facilities, design studios out of California and shoving them to the Lone Star State is a common misconception amongst those who genuinely believe his mission is to make money and avoid paying his fair share of taxes. The thing is: If Musk was someone with this sort of agenda, would he have sold many of his residences? Would he be living part-time in a $50,000 home in Starbase, Texas to help with SpaceX projects? Would he be making portions of the company’s Fremont facility in Northern California permanent? Probably not.\nMusk has responded to inquiries in the past about his taxes, stating that most of his net worth is tied up in Tesla stock. He pays taxes proportionate to his time in California and has never cashed a paycheck from Tesla, which is the state-required minimum payment. “It just ends up accumulating in a Tesla bank account somewhere,” he said to the New York Times several years ago.\nOn top of the other accusations made in the San Antonio Express-News piece, let’s not forget about Musk’s treatment from Lorena Gonzalez, a California State Assemblywoman who famously Tweeted “F*** Elon Musk” in May 2020. Musk evidently took the message as an invitation to test Tesla’s appreciation elsewhere, and Texas was more than willing to invite the electric automaker to establish its new base in Austin.\n\nMessage received\n— Elon Musk (@elonmusk) May 11, 2020\n\n\nBefore Musk is labeled a traitor and Tesla a medium of betrayal to California and its workers, let’s not forget that Telsa’s presence in California isn’t disappearing. Let’s not forget all that Tesla has contributed to the economy and environment in California. And let’s not forget that Musk was encouraged by California’s politicians to seek another place for work.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla’s move to Texas labeled ‘betrayal’ of California, a way to escape paying taxes appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-texas-betrayal-california-elon-musk-taxes/","link_type":"article","item_date":1634140765000,"item_id":"910074ea","timestamp":1634168251715,"domain":"teslarati.com","item_date_formatted":"Oct 13, 3:59 pm","description_trimmed":"Upon moving from Silicon Valley to Austin, Texas, critics and fans of Tesla and its CEO Elon Musk have mixed opinions about the move. Tesla enthusiasts might have seen it coming all along, especially after California politicians spewed profanities in the direction of the CEO, who...","keywords":"Elon Musk, Electric Automaker, Musk Evidently, California Workers"},{"title":"Top versions of Lucid Air will be first in US with lidar, company claims","description":"Lucid on Tuesday released more details on the driver-assist tech for its Air electric luxury sedan, which is scheduled to start deliveries later this month. The company is splitting its driver-assistance suite into two tiers—DreamDrive, and DreamDrive Pro. The latter includes the first automotive application of lidar in North America, Lucid...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133856_top-versions-of-lucid-air-will-be-first-in-us-with-lidar-company-claims","link_type":"article","item_date":1634126400000,"item_id":"c2be360c","timestamp":1634168252034,"domain":"greencarreports.com","item_date_formatted":"Oct 13, 12:00 pm","description_trimmed":"Lucid on Tuesday released more details on the driver-assist tech for its Air electric luxury sedan, which is scheduled to start deliveries later this month. The company is splitting its driver-assistance suite into two tiers—DreamDrive, and DreamDrive Pro. The latter includes the...","keywords":"Lucid Air, Tuesday Released, Top Versions, Start Deliveries"},{"title":"Tesla inks new nickel supply deal, inches closer to 4680 battery cell mass production","description":"Tesla’s goal of mass-producing its 4680 battery cells recently took a significant step forward on Wednesday, when New Caledonian miner Prony Resources announced that the EV maker had agreed to purchase 42,000 tonnes of nickel in a multi-year deal. Nickel is a key material that Tesla needs for its high-powered batteries, such as the 4680 cells that are currently in pilot production at the company’s Kato Road facility in Fremont, California. \n\n\n\nIn a statement, Prony noted that it is aiming to produce 44,000 tonnes of nickel by 2024, effectively doubling its estimated 2021 output. During a news conference, Antonin Beurrier, Prony’s chief executive, confirmed that Tesla is now the mining company’s largest client to date. While he did not specify any details of Prony’s deal with Tesla, Beurrier did state that the 42,000-tonne volume for the EV maker was indicative and could vary. \n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nThe CEO added that Prony’s nickel supply agreement with Tesla had been negotiated by Swiss commodity trader Trafigura, a shareholder in the mining firm. The deal between Tesla and Prony was also signed last month. Interestingly enough, Tesla and Prony had already been associated even before their recently-announced nickel deal, as the electric car maker was an adviser on product and sustainability standards for the miner. \n\n\n\nProny is not alone in its role as a key nickel supplier for Tesla. Earlier this year, Tesla also signed a deal to acquire nickel from BHP’s operations in Australia. And considering Tesla’s goal of ramping its vehicle and energy storage production in the coming years, it would not be surprising if the company inks several more deals with other nickel suppliers in the near future. Tesla CEO Elon Musk, after all, has emphasized that nickel would be a key component for its long range vehicles’ batteries. \n\n\n\n“I’d just like to re-emphasize, any mining companies out there, please mine more nickel. Wherever you are in the world, please mine more nickel and don’t wait for nickel to go back to some high point that you experienced some five years ago. Go for efficiency and environmentally-friendly nickel mining at high volume. Tesla will give you a giant contract for a long period of time if you mine nickel efficiently and in an environmentally sensitive way,” Musk said during last year’s Battery Day event, which featured the official unveiling of the company’s custom 4680 cells. \n\n\n\nThe Tesla CEO has been consistent on his nickel stance. During the recently-held 2021 Annual Shareholder Meeting, for example, Musk reiterated that the company’s most demanding vehicles like the Cybertruck and Tesla Semi would be using a nickel-based cathode. The Tesla CEO also reiterated the notion that the company’s Standard Range vehicles and battery storage products will use cells fitted with an iron-based cathode. “What actually matters is the cathode. Our long-range vehicles use a nickel-based cathode. But for our Standard Range vehicles and stationary vehicles, we’re using iron-based cathode,” Musk said. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla inks new nickel supply deal, inches closer to 4680 battery cell mass production appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-4680-battery-new-nickel-supply-deal/","link_type":"article","item_date":1634124081000,"item_id":"6c12d760","timestamp":1634168251607,"domain":"teslarati.com","item_date_formatted":"Oct 13, 11:21 am","description_trimmed":"Tesla’s goal of mass-producing its 4680 battery cells recently took a significant step forward on Wednesday, when New Caledonian miner Prony Resources announced that the EV maker had agreed to purchase 42,000 tonnes of nickel in a multi-year deal. Nickel is a key material that Te...","keywords":"Tesla Ceo, Inches Closer, Nickel Deal, Ev Maker"},{"title":"Tesla cofounder JB Straubel sends warning to automakers going all-electric: ‘Do the supply chain math’","description":"Tesla cofounder and longtime CTO JB Straubel sent a warning to automakers that are making announcements about timelines to go all-electric: “Make sure you do the math when it comes to your supply chain.”\n more…\nThe post Tesla cofounder JB Straubel sends warning to automakers going all-electric: ‘Do the supply chain math’ appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/13/tesla-co-founderjb-straubel-sends-warning-to-automakers-going-all-electric-do-supply-chain-math/","link_type":"article","item_date":1634120867000,"item_id":"16048d14","timestamp":1634168252036,"domain":"electrek.co","item_date_formatted":"Oct 13, 10:27 am","description_trimmed":"Tesla cofounder and longtime CTO JB Straubel sent a warning to automakers that are making announcements about timelines to go all-electric: “Make sure you do the math when it comes to your supply chain.”\n more…\nThe post Tesla cofounder JB Straubel sends warning to automakers goin...","keywords":"All Electric"},{"title":"Tesla Stock Breaks $800 (Ep. 427)","description":"https://www.youtube.com/watch?v=jw6U9imj7zE","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=jw6U9imj7zE","link_type":"article","item_date":1634079342000,"item_id":"8b248ff2","timestamp":1634168252348,"domain":"youtube.com","item_date_formatted":"Oct 12, 10:55 pm","description_trimmed":"https://www.youtube.com/watch?v=jw6U9imj7zE","keywords":""},{"title":"Lucid announces DreamDrive: a ‘user-friendly, future-ready’ Advanced Driver Assistance System","description":"Lucid Group has announced the details of its Advanced Driver Assistance System (ADAS), DreamDrive, which it calls “the most technically sophisticated advanced driver-assistance system.” Lucid’s DreamDrive, which comes standard in the company’s top two trims of its Air sedan, employs up to 32 onboard sensors, a driver-monitoring system, and a user-friendly interface powered by onboard ethernet networking systems. The system is set to have new features and improvements delivered to it through a series of Over-the-Air updates.\n“DreamDrive Pro has been designed to grow in capability, thanks to our ability to deliver software over-the-air and key equipment already in place in the vehicle,” Lucid’s Senior Director of ADAS and Autonomous Driving, Dr. Eugene Lee, said. “Thanks to highly integrated hardware and software teams, Lucid has the ability to develop new functionality for DreamDrive Pro in-house. This can benefit every facet of the DreamDrive Pro experience, from the frequency of updates to the planned rollout of the Highway Pilot system for conditional automated driving on select roadways in the coming years.” \nLucid begins production of Air sedan, expects October for first deliveries\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\nA Sensor Suite That Can Detect What the Human Eye Cannot \n\nThe 32 onboard sensors that will feed data to the DreamDrive system will detect what the human eye can’t. Only the most trained eye will be able to spot the up to 32 sensors on the Air Dream and Grand Touring editions as they will be seamlessly integrated into the exterior of the sedan.\nLucid writes:\n“Comprising 14 visible-light cameras, five radar units, four surround view cameras, ultrasonic sensors throughout the vehicle exterior, and, for DreamDrive Pro, the first automotive installation of LIDAR in North America. This solid-state LIDAR sensor will deliver high-resolution data with an ultra-wide field of view. Together, these sensors enable DreamDrive to detect what a human driver cannot, and act as an invisible co-pilot to help drivers get to their destination safely.”\n\n\n\n\n\n\n\nA Human-Machine Interface That’s About the Human \n\nLucid DreamDrive also will use its Surreal Sound from its 21-internal speaker system to deliver clear directional alerts that will enhance the safety and awareness of drivers. The use of the speakers to warn drivers with directional alerts will enhance features like Front and Rear Cross Traffic Protection and Autonomous Emergency Braking. Surround View Monitoring also will provide a 360-degree view of the car, helping maneuver tight parking spaces or streets.\n\nHighway Assist and Auto Park \n\nHighway Assist and Auto Park features will also help enhance DreamDrive’s versatility. Lucid writes regarding Highway Assist:\n“The Highway Assist group of features is designed to help drivers stay safe, while also making the Lucid Air even more delightful to drive. Highway Assist blends adaptive cruise control and lane centering control to help keep the Lucid Air right where it belongs on the freeway, at a safe distance from the vehicle ahead and other lanes. Traffic Jam Assist operates at speeds between 0 and 40 miles per hour, aiding in centering the vehicle when lane lines are occluded by close traffic. For vehicles equipped with DreamDrive Pro, further functions for Highway Assist are already in development.“\nOf course, drivers will be able to use Highway Assist when the driver is attentive, and this will be confirmed through a robust sophisticated driver monitoring system. “An infrared driver camera tracks head position, eye gaze, and blinking, while hands-off detection prompts the driver to return their hands to the steering wheel immediately,” the company’s press release states.\nAdditionally, an Auto Park feature will make putting the car in tight spots much easier. Identifiying parallel or perpendicular spots and easily parking in them makes the task of maneuvering a thing of the past. It will even turn the wheels toward or away from the curb when parking on a hill.\nA Robust Platform for Greater Capability in the Future\nAll of these features are great, but they wouldn’t be possible without the right platform. Lucid’s proprietary Ethernet Ring will enable four high-speed computer gateways – one at each corner of every vehicle – which will communicate with one another at lightning-fast speeds to result in high performance and hgih degrees of redudnancy for key ssytems like steering, braking, power, sensors, and more.\nWhat do you think? Let us know in the comments below, or be sure to email me at joey@teslarati.com or on Twitter @KlenderJoey.\nThe post Lucid announces DreamDrive: a ‘user-friendly, future-ready’ Advanced Driver Assistance System appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/lucid-dreamdrive-adas/","link_type":"article","item_date":1634075994000,"item_id":"d5245346","timestamp":1634168252124,"domain":"teslarati.com","item_date_formatted":"Oct 12, 9:59 pm","description_trimmed":"Lucid Group has announced the details of its Advanced Driver Assistance System (ADAS), DreamDrive, which it calls “the most technically sophisticated advanced driver-assistance system.” Lucid’s DreamDrive, which comes standard in the company’s top two trims of its Air sedan, empl...","keywords":"Highway Assist, Dreamdrive Pro, Air Sedan, Lucid Air"},{"title":"Mattel Is Launching a 3,283-Piece Buildable Tesla Cybertruck","description":"Photo: Mattel\nMattel is launching a 3,283-piece buildable Tesla Cybertruck, which will open for pre-orders on October 13. A buildable model of the most desirable car in the world will sell for $250.Tesla created a car so cool that even before it went on sale, it was already iconic. Millions of people dream of buying it, while over 1 million pre-orders have already been placed. For those who find it difficult to wait for the Tesla Cybertruck to hit the market, Mattel suggests going further and buying a more affordable version. The MEGA Tesla Cybertruck consists of 3,283 pieces and measures 50cm (19.7in) in length x 19cm (7.5in) in width x 17cm (6.7in) in height.According to the description, the collectible model can place the owner directly on the driver's seat, \"as you piece together Musk and Tesla's long-awaited electric pickup truck.\" The MEGA set has an authentically detailed styling with features that include an adjustable suspension that raises and lowers the truck's height, a functional tonneau cover that pops on and off, and a folding tailgate that slides into the truck frame. The buildable Cybertruck also has a replicated interior with a GPS system and mini Tesla water bottle, as well as a cracked window \"that makes light of Musk's truck reveal.\" This collectible Cybertruck will be great entertainment or a gift not only for Tesla fans but also for people who love to own unique and extremely interesting things.According to the company's website, the MEGA Tesla Cybertruck will be available for pre-order on October 13 at 15:00 CEST / 9:00 EDT.\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/mattel-is-launching-a-3-283-piece-buildable-tesla-cybertruck","link_type":"article","item_date":1634073753000,"item_id":"af6f1b79","timestamp":1634168252037,"domain":"tesmanian.com","item_date_formatted":"Oct 12, 9:22 pm","description_trimmed":"Photo: Mattel\nMattel is launching a 3,283-piece buildable Tesla Cybertruck, which will open for pre-orders on October 13. A buildable model of the most desirable car in the world will sell for $250.Tesla created a car so cool that even before it went on sale, it was already iconi...","keywords":"Mattel Mattel, Tesla Cybertruck, Buildable Cybertruck, Mattel Suggests"},{"title":"Tesla Crash Lab | Data Driven Safety","description":"Tesla Crash Lab | Data Driven Safety","author":"TeslaTracker Submissions","url":"https://www.youtube.com/watch?v=9KR2N_Q8ep8","link_type":"article","item_date":1634072286000,"item_id":"b793f7ac","timestamp":1634168252352,"domain":"youtube.com","item_date_formatted":"Oct 12, 8:58 pm","description_trimmed":"Tesla Crash Lab | Data Driven Safety","keywords":""},{"title":"Lucid Is Trying To Outdo Tesla On Tech","description":"The genius — or asinine simplicity, depending on how you interpret it — of Tesla is that Teslas are technologically very sophisticated but sold in terms that any idiot can understand. Full Self-Driving, for example, describes a whole bunch of software and hardware that would put you to sleep if described in technical…Read more...","author":"Jalopnik","url":"https://jalopnik.com/lucid-is-trying-to-outdo-tesla-on-tech-1847849681","link_type":"article","item_date":1634070300000,"item_id":"02007dd8","timestamp":1634168252689,"domain":"jalopnik.com","item_date_formatted":"Oct 12, 8:25 pm","description_trimmed":"The genius — or asinine simplicity, depending on how you interpret it — of Tesla is that Teslas are technologically very sophisticated but sold in terms that any idiot can understand. Full Self-Driving, for example, describes a whole bunch of software and hardware that would put ...","keywords":"Outdo Tesla, Asinine Simplicity, Technical Read"},{"title":"Tesla Superchargers Coming To Buc-ees, The World’s Largest Gas Station","description":"Tesla is bringing its Superchargers to Buc-ees in both New Braunfels, TX and Bastrop, TX. The New Braunfels location also happens to be the world’s largest gas station and convenience store. FUN 🦫NEWS! Looks like @Tesla has worked very well with one of our *favorite* places to stop when we travel. @bucees in both new […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/12/tesla-superchargers-coming-to-buc-ees-the-worlds-largest-gas-station/","link_type":"article","item_date":1634069911000,"item_id":"560c2dd3","timestamp":1634168252739,"domain":"cleantechnica.com","item_date_formatted":"Oct 12, 8:18 pm","description_trimmed":"Tesla is bringing its Superchargers to Buc-ees in both New Braunfels, TX and Bastrop, TX. The New Braunfels location also happens to be the world’s largest gas station and convenience store. FUN 🦫NEWS! Looks like @Tesla has worked very well with one of our *favorite* places to s...","keywords":"Buc Ees, Braunfels Location"},{"title":"Tesla Giga Shanghai Sells 56K+ Vehicles in September, Reaches Production Capacity of 681K+ Units","description":"Photo: @JayinShanghai/Twitter\nTesla Giga Shanghai increased production by 26% in September compared to the previous month, demonstrating strong growth in factory productivity. More than 56,000 vehicles were produced last month, 93% of which were sold in China. Thus, in September, Tesla reached a production capacity of 681,400 units per year.Tesla continues to ramp up production at its Chinese factory Giga Shanghai. In September, the manufacturer managed to increase production by 26% from last month to an impressive 56,006 vehicles. This also means that the factory was producing an average of 1,866 vehicles per day. Such data also indicates that Tesla reached a production capacity of 681,400 units per year, which happened in just less than two years from the start of the operations. This became a new, unprecedented record and a new milestone in the development of the company in China.According to the China Passenger Car Association (CPCA), out of 56,006 vehicles sold, 3,853 units were exported. This means that Tesla sold a staggering 52,153 Model 3 and Model Y in the local market. This also highlights the huge demand for the manufacturer's cars in China, which has been questioned by the company's critics.As Tesla CEO Elon Musk explained earlier, in the first and partially in the second month of each quarter, Giga Shanghai manufactures and delivers cars to overseas markets. This is due to the fact that the delivery takes a long time, so the cars must be dispatched well in advance. In the second month, the factory partially manufactures and ships cars to distant regions of China. In the third month of each quarter, Giga Shanghai is actively producing and shipping cars for the surrounding regions of China. Therefore, sales in China in every last month of the quarter are always significantly higher than in the first two.\n\nExactly. Giga Shanghai makes cars for export in first half of quarter, then cars for far away parts of China, then cars for nearby parts of China. Net result is a crazy wave of deliveries end of quarter. It is tough on our team, so we’re hoping to reduce the wave in Q4 &amp; Q1.\n— Elon Musk (@elonmusk) September 22, 2021\n\n\n\nAs expected, Model Y has become the undisputed top seller based on early observations of license plate registrations in China. Of the 52,153 vehicles sold, Model Y sales totaled an impressive 33,033 units and Model 3 sales totaled 19,120 units. Although the sales of Model 3 seem to be weaker, this is only against the background of the stunning sales of Model Y. In comparison, Chinese EV makers Nio and Xpeng delivered over 10,000 vehicles each last month. Volkswagen AG said it has sold only 10,126 ID. series vehicles in China in September.\n\n(BREAKING) Tesla China NumbersSeptember total number is 56,006 China-made cars increased 27% MoM - Tesla's wholesale sales of MIC Tesla in September were 56,006 units, up 27% month-on-month, compared with 44,264 units in Aug. Domestic: 52,153 unitsExports: 3,853 units$TSLA pic.twitter.com/ZaEmOgQ6id\n— Jay in Shanghai 🇨🇳 (@JayinShanghai) October 12, 2021\n\n\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-giga-shanghai-increases-production-by-26-in-september-selling-over-56k-vehicles","link_type":"article","item_date":1634069133000,"item_id":"f76f1912","timestamp":1634168252366,"domain":"tesmanian.com","item_date_formatted":"Oct 12, 8:05 pm","description_trimmed":"Photo: @JayinShanghai/Twitter\nTesla Giga Shanghai increased production by 26% in September compared to the previous month, demonstrating strong growth in factory productivity. More than 56,000 vehicles were produced last month, 93% of which were sold in China. Thus, in September,...","keywords":"Vehicles Sold, Production Capacity, Sales Totaled, Tesla Reached"},{"title":"White Tesla Seats After 2 Years","description":"I've owned a White Seat Tesla Model S for over 2 years and 50,000 miles. This video is a review of how the seats have held up against blue jean stain, and wear and tear of my adventures.\n\nWe also cover how to protect your Tesla seats with ceramic coating to make sure your white seats look good for the long term.\n\nCheck out how the seats looked after 1 year here: https://youtu.be/4gdfo8u5zEk","author":"My Tesla Adventure","url":"https://www.youtube.com/watch?v=_GptNE44SgU","link_type":"article","item_date":1634067660000,"item_id":"e633d847","timestamp":1634168252350,"domain":"youtube.com","item_date_formatted":"Oct 12, 7:41 pm","description_trimmed":"I've owned a White Seat Tesla Model S for over 2 years and 50,000 miles. This video is a review of how the seats have held up against blue jean stain, and wear and tear of my adventures.\n\nWe also cover how to protect your Tesla seats with ceramic coating to make sure your white s...","keywords":"White Seats, Tesla Seats, Seats Looked, Year Here"},{"title":"Tesla unveils its new crash safety tech based on collecting real-world data","description":"Tesla unveils its latest crash safety technology based on real-world data collection using its large fleet of vehicles equipped with sensors for its self-driving technology.\n more…\nThe post Tesla unveils its new crash safety tech based on collecting real-world data appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/12/tesla-unveils-new-crash-safety-tech-based-on-collecting-real-world-data/","link_type":"article","item_date":1634066240000,"item_id":"08d3feba","timestamp":1634168252717,"domain":"electrek.co","item_date_formatted":"Oct 12, 7:17 pm","description_trimmed":"Tesla unveils its latest crash safety technology based on real-world data collection using its large fleet of vehicles equipped with sensors for its self-driving technology.\n more…\nThe post Tesla unveils its new crash safety tech based on collecting real-world data appeared first...","keywords":"Tesla Unveils"},{"title":"Tesla China Sold 56,000 Made-In-China EVs In September — 27% Month-On-Month Increase","description":"It was just a couple of months ago that we were debunking the FUD that centered around Tesla’s sales in China. The end proved to not be near, as some had suggested, and the latest numbers from China proved our predictions true. “JayInShanghai” just shared the latest numbers from Tesla China. This time, Tesla China […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/12/tesla-china-sold-56000-made-in-china-evs-in-september-27-month-on-month-increase/","link_type":"article","item_date":1634064341000,"item_id":"cb0ec41f","timestamp":1634168252750,"domain":"cleantechnica.com","item_date_formatted":"Oct 12, 6:45 pm","description_trimmed":"It was just a couple of months ago that we were debunking the FUD that centered around Tesla’s sales in China. The end proved to not be near, as some had suggested, and the latest numbers from China proved our predictions true. “JayInShanghai” just shared the latest numbers from ...","keywords":"Tesla China, Latest Numbers, China Proved, End Proved"},{"title":"Tesla China Wins Lawsuit Against Driver Who Claimed Tesla Was Responsible For His Bad Driving","description":"In China, Tesla won a lawsuit against a driver who wrecked his Model 3 and blamed Tesla for his bad driving. “Ray4Tesla” has been keeping tabs on the case since August 2020, and here’s a recap. 1/ Twitter is a great place where you can backtrack TSLAQ’s tweet &amp; my response regarding a viral footage […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/12/tesla-china-wins-lawsuit-against-driver-who-claimed-tesla-was-responsible-for-his-bad-driving/","link_type":"article","item_date":1634059123000,"item_id":"c19a6112","timestamp":1634168252747,"domain":"cleantechnica.com","item_date_formatted":"Oct 12, 5:18 pm","description_trimmed":"In China, Tesla won a lawsuit against a driver who wrecked his Model 3 and blamed Tesla for his bad driving. “Ray4Tesla” has been keeping tabs on the case since August 2020, and here’s a recap. 1/ Twitter is a great place where you can backtrack TSLAQ’s tweet &amp; my response re...","keywords":"Bad Driving, Tesla Won, Claimed Tesla, Blamed Tesla"},{"title":"Wedbush maintains a $1,000 TSLA PT as the Tesla Austin and Berlin factories are a 'major positive'","description":"Wedbush maintains a target price of $1,000 for Tesla (NASDAQ: TSLA), as the company has a clear direction for development. The factories of the manufacturer in Austin and Berlin are a \"major positive\", which should be decisive in 2022.Tesla shares continue to perform better following the announcement of production and delivery data for Q3 2021. Wedbush analyst Dan Ives rates the stock as Buy and believes it will soon be worth $1,000, which is his official price target.In his analysis, Ives does not focus on the global chip shortage or new self-driving features the company is rolling out, as this is not the most important thing in his view. The analyst focuses on manufacturing facilities and how they are the main key to Tesla's success. \"While the chip shortage has been a clear headwind for Tesla and the overall auto/tech industry, we believe building out manufacturing capacity globally remains a key to Musk &amp; Co. success in 2022 and beyond,\" wrote Ives in a Sunday research report.The semiconductor shortage will continue to affect all automakers, leading to a further three million vehicle cutbacks in production schedules in the fourth quarter, equal to about 13% of planned production. However, Tesla has handled the chip shortage significantly better than others in the industry. Tesla vehicle sales in the first nine months of 2021 increased almost 100% over 2020.\"Austin and Berlin set to expand Tesla capacity into 2022,\" added Ives calling the expansion a \"major positive.\" If the production ramp goes smoothly, Tesla might deliver 1.5 million vehicles in 2022, while Wall Street estimates around 1.3 millionApart from producing additional vehicles in Giga Berlin, Tesla can also increase its profit margins. Local delivery of cars -- serving Europe from a European plant -- should be cheaper than shipping cars from Shanghai -- as Tesla has been doing recently.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\nFollow @EvaFoxU\nLegal Disclaimer --This article is for informational purposes only. You should not construe any such information or other material as an investment, financial, or other advice. Nothing contained in this article constitutes a solicitation, recommendation, endorsement, or offer by Eva Fox, Tesmanian, or any third party service provider to buy or sell any securities or other financial instruments in this or in any other jurisdiction in which such solicitation or offer would be unlawful under the securities laws of such jurisdiction.Eva Fox holds zero shares of Tesla, Inc., and currently (at the time of this article's publishing) holds zero options or securities in Tesla Inc. and/or its affiliates.","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/wedbush-maintains-a-1-000-tesla-pt-as-the-austin-and-berlin-factories-are-a-major-positive","link_type":"article","item_date":1634056958000,"item_id":"5a1e2ad8","timestamp":1634168252355,"domain":"tesmanian.com","item_date_formatted":"Oct 12, 4:42 pm","description_trimmed":"Wedbush maintains a target price of $1,000 for Tesla (NASDAQ: TSLA), as the company has a clear direction for development. The factories of the manufacturer in Austin and Berlin are a \"major positive\", which should be decisive in 2022.Tesla shares continue to perform better follo...","keywords":"Eva Fox, Tesla Austin, Chip Shortage, Tesla's Success"},{"title":"Tesla Crash Lab | Data Driven Safety","description":"https://www.youtube.com/watch?v=9KR2N_Q8ep8","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=9KR2N_Q8ep8","link_type":"article","item_date":1634056441000,"item_id":"bf1577ea","timestamp":1634168252689,"domain":"youtube.com","item_date_formatted":"Oct 12, 4:34 pm","description_trimmed":"https://www.youtube.com/watch?v=9KR2N_Q8ep8","keywords":""},{"title":"Lucid details DreamDrive ADAS platform, with ‘conditional automated driving in coming years’","description":"Following the start of production of its Air sedan, Lucid Motors has now shared new details of DreamDrive, its Advanced Driver-Assistance System (ADAS) with over 30 features. Additionally, the American automaker shared details of a DreamDrive Pro option, which includes LiDAR, and even hinted at a future Highway Pilot upgrade that may deliver conditional hands-free driving capability.\n more…\nThe post Lucid details DreamDrive ADAS platform, with ‘conditional automated driving in coming years’ appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/12/lucid-details-dreamdrive-adas-platform-with-conditional-automated-driving-in-coming-years/","link_type":"article","item_date":1634054400000,"item_id":"c6111972","timestamp":1634168252744,"domain":"electrek.co","item_date_formatted":"Oct 12, 4:00 pm","description_trimmed":"Following the start of production of its Air sedan, Lucid Motors has now shared new details of DreamDrive, its Advanced Driver-Assistance System (ADAS) with over 30 features. Additionally, the American automaker shared details of a DreamDrive Pro option, which includes LiDAR, and...","keywords":"Coming Years, Automated Driving"},{"title":"Tesla breaks above key $800 resistance level after posting strong China sales growth in September","description":"Tesla CEO Elon Musk.\nMatt Rourke/AP Photo\n\n\nShares of Tesla traded above the key $800 resistance level on Tuesday after the EV maker posted strong September sales growth in China.\nTesla sold 56,606 vehicles in China last month, representing 27% month-over-month growth.\nThe growth for Tesla came even as China auto sales slumped 17% in September.\n\nSign up here for our daily newsletter, 10 Things Before the Opening Bell.\n\nTesla rose 2% to clear its key $800 resistance level on Tuesday after the company announced significant sales growth in China for the month of September.Tesla sold 56,006 China-made vehicles, representing month-over-month growth of 27% and the highest month of China sales since production in its Shanghai plant started in 2019.The growth from Tesla is impressive as data from the China Passenger Car Association showed overall vehicle sales drop 17% in September to 1.58 million. Of the 56,000 China-made vehicles sold in September, Tesla exported 3,853 of them.The drop in September car sales in China wasn't much of a surprise given the ongoing semiconductor shortage and recent regulations targeting power consumption in the country. And Tesla's third-quarter auto sales released earlier this month hinted at continued strength for the auto-maker, with the company on track to near 1 million in annual auto sales. Wedbush analyst Dan Ives said the China sales data means recent dark clouds hovering over Tesla in recent months are beginning to move into the rear view mirror. \"Selling 50k+ in the month for the key China region speaks to huge trajectory that highlights our bull China thesis for Tesla going into the next few years,\" Ives said in a Tuesday note, adding that \"Tesla continues to dominate market share.\"Tesla's Tuesday surge brought the stock to its highest level in eight months. A consecutive daily close above the $800 resistance level would signal that a risk-on appetite is building in shares of Tesla, with a re-test of its prior high likely.Tesla topped out at $900.40 in late January, which represents potential upside of 12% from current levels. Since hitting its record high in January, Tesla fell as much as 40% before consolidating sideways as investors grappled with the chip shortage and production concerns. Shares of Tesla are up about 12% year-to-date. \n\t\n\nStockcharts.com\n\nRead the original article on Business Insider","author":"All Content from Business Insider","url":"https://markets.businessinsider.com/news/stocks/tesla-stock-price-tests-key-resistance-china-september-sales-growth-2021-10","link_type":"article","item_date":1634052715000,"item_id":"95510447","timestamp":1634168252826,"domain":"markets.businessinsider.com","item_date_formatted":"Oct 12, 3:31 pm","description_trimmed":"Tesla CEO Elon Musk.\nMatt Rourke/AP Photo\n\n\nShares of Tesla traded above the key $800 resistance level on Tuesday after the EV maker posted strong September sales growth in China.\nTesla sold 56,606 vehicles in China last month, representing 27% month-over-month growth.\nThe growth...","keywords":"Resistance Level, Highest Level, Current Levels, China Made"},{"title":"Tesla supplier CATL announces $5 billion battery recycling facility","description":"CATL, the leading battery manufacturer in China, has shared new plans to create a $5 billion facility to recycle used batteries for their earth materials such as cobalt and lithium. The facility will be erected as a joint venture at a time when EVs are becoming more and more in demand globally. \n more…\nThe post Tesla supplier CATL announces $5 billion battery recycling facility appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/12/tesla-supplier-catl-announces-5-billion-battery-recycling-facility/","link_type":"article","item_date":1634052243000,"item_id":"97abdb86","timestamp":1634168252757,"domain":"electrek.co","item_date_formatted":"Oct 12, 3:24 pm","description_trimmed":"CATL, the leading battery manufacturer in China, has shared new plans to create a $5 billion facility to recycle used batteries for their earth materials such as cobalt and lithium. The facility will be erected as a joint venture at a time when EVs are becoming more and more in d...","keywords":"Billion Facility, Joint Venture"},{"title":"Tesla's Germany Plant Is Still A Big Gamble","description":"Toyota thinks it can rebound from the chip shortage, suppliers will take on over a billion in costs tied to GM’s big Bolt recall, and Tesla. All that and more in The Morning Shift for October 12, 2021.Read more...","author":"Jalopnik","url":"https://jalopnik.com/teslas-germany-plant-is-still-a-big-gamble-1847845304","link_type":"article","item_date":1634049900000,"item_id":"cddb153f","timestamp":1634168252754,"domain":"jalopnik.com","item_date_formatted":"Oct 12, 2:45 pm","description_trimmed":"Toyota thinks it can rebound from the chip shortage, suppliers will take on over a billion in costs tied to GM’s big Bolt recall, and Tesla. All that and more in The Morning Shift for October 12, 2021.Read more...","keywords":"Morning Shift, Costs Tied"},{"title":"Why Elon Musk Doesn't Want to Be Tesla's CEO","description":"https://www.youtube.com/watch?v=2PupLGaVBzI","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=2PupLGaVBzI","link_type":"article","item_date":1634049241000,"item_id":"718801d3","timestamp":1634168252688,"domain":"youtube.com","item_date_formatted":"Oct 12, 2:34 pm","description_trimmed":"https://www.youtube.com/watch?v=2PupLGaVBzI","keywords":""},{"title":"Tesla co-founder shares warning about OEM’s EV focus: “They haven’t really done the math fully”","description":"Former Tesla CTO and co-founder JB Straubel recently shared some insights about the electric vehicle revolution and the focus of OEMs on pure electric cars. While conversing with startup investor Jason Calacanis’ in an episode of YouTube’s This Week in Startups, Straubel covered several topics, including Tesla’s early days, the importance of battery recycling, and how some OEMs’ alleged complete dedication to electric vehicles may not be very well thought out at all. \n\n\n\nAs noted by Straubel, Tesla was actually quite surprised that the Model S did not cause a substantial shift among OEMs to commit fully to battery-electric cars. The Model S was designed to be the best car, period, and for all intents and purposes, it did not disappoint. However, despite the rave reviews of the Model S and the vehicle proving that electric cars could be at the pinnacle of the auto sector, legacy automakers did not make a serious shift to EVs. \n\n\n\n\n\nJB Straubel thought all automakers would immediately copy the technology of Tesla Model S 2012 and Tesla had to move fast to carve out a nicheBut that didn't happen And here we are today, Tesla, still, the best and largest EV producer, by far, in the world@elonmusk @jason pic.twitter.com/fXuZBzsAch— First Principle Investor, Not CFA (@1stPrincipleInv) October 11, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n“The Model S was such a different car. The Roadster was a technology validation. We proved that batteries could work, they could go on a car, they could be safe, they could do the range and acceleration. The S was a whole different thing. It was so good. We put so much effort into that. Elon was hell-bent on making it the best car on the road. And I think we really delivered on that at the time. It was phenomenal. \n\n\n\n“I’m still amazed at the skepticism there was. Even after delivering those, we kinda imagined, I imagined, that people would see this and go ‘Clearly this is the future. This is all gonna work.’ All the car companies are gonna copy this immediately, and we’ll have to go really fast to figure out how we can carve out a niche. And it just didn’t happen. Customers loved it. It was a runaway hit with reviewers and magazines and customers, but the copying and market change didn’t happen,” Straubel said. \n\n\n\nThe automotive landscape today is different, however. With Tesla now the most valuable automaker by market cap and with Chinese car companies aggressively coming up with modern electric cars, OEMs have now adopted the narrative that they are going all-in on EVs. Straubel, however, noted that these announcements might not necessarily be realistic. \n\n\n\n\n\nWhat JB Straubel has to say about so many OEMs announcing their plans to go fully into EV\"They haven't, I think, really done the math fully?\"@elonmusk @jason pic.twitter.com/5iMpzIV1HD— First Principle Investor, Not CFA (@1stPrincipleInv) October 11, 2021\n\n\n\n\n\n\n“So many different OEMs, countries, factories, customers are leaping into EVs. You know, making these huge announcements, you know, saying that they’ll be fully electric this decade or the next. They haven’t, I don’t think they’ve done the math fully. What that entails on the supply chain and tracing it all the way back, literally all the way back to the mines. You need to do that, or else, you know, you haven’t really solved it. It has the feeling to me of kind of like a giant overbooked flight.  \n\n\n\n“All these people like, ‘Oh, this is great. We’re all gonna go to that new place. We all wanna go there. It looks great. Sweet. Let’s all go on the plane and go.’ So everybody’s saying that we all wanna go there at the same time. Meanwhile, we have to sort of build the planes to get there; we have to figure out how to sequence everyone. The figurative runway is like the time to do all this, and it could all get sorted out over time. But obviously, we’re trying to do this fast as a society and as a species,” Straubel said. \n\n\n\nWatch Straubel’s full interview with Jason Calacanis’ This Week in Startups in the video below. \n\n\n\n\n\n\n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla co-founder shares warning about OEM’s EV focus: “They haven’t really done the math fully” appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-jb-straubel-oems-didnt-do-ev-math/","link_type":"article","item_date":1634047987000,"item_id":"df57f328","timestamp":1634168252460,"domain":"teslarati.com","item_date_formatted":"Oct 12, 2:13 pm","description_trimmed":"Former Tesla CTO and co-founder JB Straubel recently shared some insights about the electric vehicle revolution and the focus of OEMs on pure electric cars. While conversing with startup investor Jason Calacanis’ in an episode of YouTube’s This Week in Startups, Straubel covered ...","keywords":"Math Fully, Ev Focus, Straubel Said, Cfa Stprincipleinv"},{"title":"Tesla’s FSD Safety Score Is Finding Out Who Will Tolerate FSD","description":"Passengers in autonomous vehicles will expect to be able to drink a coffee and feel like they are on a bus or a train, not strapped into a transparent ping pong ball in the middle of a bunch of other transparent ping pong balls.","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/12/teslas-fsd-safety-score-is-finding-out-who-will-tolerate-fsd/","link_type":"article","item_date":1634047229000,"item_id":"af6c9f97","timestamp":1634168252769,"domain":"cleantechnica.com","item_date_formatted":"Oct 12, 2:00 pm","description_trimmed":"Passengers in autonomous vehicles will expect to be able to drink a coffee and feel like they are on a bus or a train, not strapped into a transparent ping pong ball in the middle of a bunch of other transparent ping pong balls.","keywords":"Autonomous Vehicles"},{"title":"I've Driven Lucid Air, Model S Plaid, EQS, &amp; Taycan All Within 1 Week! Here Are My Thoughts","description":"https://www.youtube.com/watch?v=zZZRq2zVaC4","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=zZZRq2zVaC4","link_type":"article","item_date":1634045641000,"item_id":"dd0bb902","timestamp":1634168252687,"domain":"youtube.com","item_date_formatted":"Oct 12, 1:34 pm","description_trimmed":"https://www.youtube.com/watch?v=zZZRq2zVaC4","keywords":""},{"title":"Tesla Awaits Green Light for Production in Germany","description":"Elon Musk’s push to turn Tesla into a global car maker and energize its electric-vehicles sales in Europe through a new plant in Germany is nearing what could be its final hurdle.","author":"WSJ.com: WSJD","url":"https://www.wsj.com/articles/tesla-awaits-green-light-for-production-in-germany-11634039224?mod=rss_Technology","link_type":"article","item_date":1634039220000,"item_id":"ad98a35e","timestamp":1634168252752,"domain":"wsj.com","item_date_formatted":"Oct 12, 11:47 am","description_trimmed":"Elon Musk’s push to turn Tesla into a global car maker and energize its electric-vehicles sales in Europe through a new plant in Germany is nearing what could be its final hurdle.","keywords":"Turn Tesla, Final Hurdle"},{"title":"Tesla (TSLA) breaks record in China, resulting in massive delivery expectation beat","description":"Tesla has achieved an impressive new delivery record in China, which has greatly contributed to the automaker’s massive delivery expectation beat last quarter.\n more…\nThe post Tesla (TSLA) breaks record in China, resulting in massive delivery expectation beat appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/12/tesla-tsla-breaks-record-china-resulting-delivery-beat/","link_type":"article","item_date":1634032681000,"item_id":"a133fbe1","timestamp":1634168252755,"domain":"electrek.co","item_date_formatted":"Oct 12, 9:58 am","description_trimmed":"Tesla has achieved an impressive new delivery record in China, which has greatly contributed to the automaker’s massive delivery expectation beat last quarter.\n more…\nThe post Tesla (TSLA) breaks record in China, resulting in massive delivery expectation beat appeared first on El...","keywords":""},{"title":"Tesla Model Y LR road trip to Arctic Circle part 2","description":"https://www.youtube.com/watch?v=EiHtPpq8PL0","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=EiHtPpq8PL0","link_type":"article","item_date":1634031241000,"item_id":"fde1c9f3","timestamp":1634168252671,"domain":"youtube.com","item_date_formatted":"Oct 12, 9:34 am","description_trimmed":"https://www.youtube.com/watch?v=EiHtPpq8PL0","keywords":""},{"title":"The $25,000 Tesla model: Everything we know so far","description":"There are several game-changing elements the EV world has patiently but attentively kept tabs on in recent years – solid state batteries, fully-autonomous driving, whether some of these SPAC mergers will actually produce a series production vehicle. As one of the largest names in electric vehicles, Tesla has promised several products over the years. – some of which it has delivered, but many it has yet to (ahem, Cybertruck and 2nd Gen. Roadster). Another fabled prospect promised by Tesla is a $25,000 model. While the automaker has only caught a quick whiff of EV pricing within $10K of that figure, it’s apparently still imminent. Here’s everything we know to date.\n more…\nThe post The $25,000 Tesla model: Everything we know so far appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/12/the-25000-tesla-model-everything-we-know-so-far/","link_type":"article","item_date":1634029673000,"item_id":"97346cd8","timestamp":1634168252841,"domain":"electrek.co","item_date_formatted":"Oct 12, 9:07 am","description_trimmed":"There are several game-changing elements the EV world has patiently but attentively kept tabs on in recent years – solid state batteries, fully-autonomous driving, whether some of these SPAC mergers will actually produce a series production vehicle. As one of the largest names in...","keywords":"Tesla Model, Recent Years, Ev World, Ev Pricing"},{"title":"Tesla Offers Gigabeer","description":"Article describing Tesla’s new Gigabeer.","author":"TeslaTracker Submissions","url":"https://electrek.co/2021/10/11/tesla-gigabeer-cybe","link_type":"article","item_date":1634011360000,"item_id":"5d4b7935","timestamp":1634168252844,"domain":"electrek.co","item_date_formatted":"Oct 12, 4:02 am","description_trimmed":"Article describing Tesla’s new Gigabeer.","keywords":""},{"title":"Elon Musk Anecdotes &amp; 3 Steps to Achieve the Impossible","description":"Elon Musk is a man who dreams big. Getting humans to Mars and weaning the world off fossil fuels aren’t exactly easy-to-achieve goals. Can Musk make it happen? That remains to be seen. By all accounts, he’s making some serious progress. Carmine Gallo at Inc. recently attempted to outline Musk’s three key steps necessary to achieve the […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/11/elon-musk-anecdotes-3-steps-to-achieve-the-impossible/","link_type":"article","item_date":1634009419000,"item_id":"50fa8e8d","timestamp":1634168252718,"domain":"cleantechnica.com","item_date_formatted":"Oct 12, 3:30 am","description_trimmed":"Elon Musk is a man who dreams big. Getting humans to Mars and weaning the world off fossil fuels aren’t exactly easy-to-achieve goals. Can Musk make it happen? That remains to be seen. By all accounts, he’s making some serious progress. Carmine Gallo at Inc. recently attempted to...","keywords":"Musk Make, Outline Musk, Key Steps, Recently Attempted"},{"title":"Tesla Gigafactory Berlin’s production start date a timely advantage for Musk and Co.: Wedbush","description":"Tesla (NASDAQ: TSLA) announced this weekend that the production of its electric vehicles at Gigafactory Berlin in Germany would begin in November. The start date is a timely advantage that Tesla has, according to Wedbush analyst Dan Ives, who believes the ramp of production at the Berlin Gigafactory and Gigafactory Texas, also slated for initial manufacturing later this year, will coincide with the scheduled growth of the EV sector over the 12 to 18 months.\nIves, a Tesla bull who holds a $1,000 price target on the stock with a “Buy” rating, said that the overall growth of the electric vehicle industry is set to give Tesla an array of advantages based on their strategic planning and scheduling of the initial production phases at its new factory.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nCEO Elon Musk announced this past weekend that Gigafactory Berlin would begin building the Model Y as soon as November. Musk made the announcement at the massive “Giga Fest” event, where Tesla displayed some of its newest manufacturing and engineering feats, including the structural 4680 pack and two new vehicle colors that will be produced at the Berlin factory.\nTesla Giga Berlin’s first goal is to produce one Model Y body every 45 seconds\n\nTesla’s manufacturing prowess goes far beyond its factories in Berlin and Texas. Additionally, the automaker operates a facility out of Northern California, known as the Fremont Factory, which it has owned since 2010. Tesla also has a facility in Shanghai, which, despite only being active since early 2020, has a higher production rate and capacity than the Fremont facility.\nThe outlook for the electric vehicle sector over the next several years is bullish, to say the least. With more companies opting to shy away from the continuance of combustion engine vehicles and opt into the transition to electrification, the sector as a whole will likely experience tremendous growth as a whole. Electric vehicles, due to their efficiency, range, environmental advantages, and quickly decreasing prices, are becoming the more logical option for car buyers, as long as they can afford them. Tesla, being the undisputed industry leader, without a doubt has the most to gain from the growth of the EV industry. The company offers the best cars in terms of range, performance, technology, and software.\nNow that Tesla will be able to produce more vehicles, wait times will begin to decrease as production figures increase. Over the next several years, especially with the active operation of the Berlin and Texas factories, Tesla may be able to continue its dominance of the sector, especially with the timely production start dates of its new manufacturing plants.\nIves is ranked 25th out of 7,689 analysts on TipRanks. He has a 75% success rate and an average return of 35%.\nDisclosure: Joey Klender is a TSLA Shareholder.\nThe post Tesla Gigafactory Berlin’s production start date a timely advantage for Musk and Co.: Wedbush appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-giga-berlin-production-advantages-wedbush-note/","link_type":"article","item_date":1633982350000,"item_id":"9f060fa9","timestamp":1634168252921,"domain":"teslarati.com","item_date_formatted":"Oct 11, 7:59 pm","description_trimmed":"Tesla (NASDAQ: TSLA) announced this weekend that the production of its electric vehicles at Gigafactory Berlin in Germany would begin in November. The start date is a timely advantage that Tesla has, according to Wedbush analyst Dan Ives, who believes the ramp of production at th...","keywords":"Timely Advantage, Gigafactory Berlin, Electric Vehicles, Berlin Gigafactory"},{"title":"Tesla (TSLA) takes over HP’s campus in California despite moving HQ out of state","description":"While Tesla is moving its headquarters out of California, CEO Elon Musk made it clear that the automaker would still grow in the state.\nHe wasn’t lying, since Tesla is now taking over a large part of HP’s campus in Palo Alto.\n more…\nThe post Tesla (TSLA) takes over HP’s campus in California despite moving HQ out of state appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/11/tesla-tsla-takes-over-hp-campus-california/","link_type":"article","item_date":1633981754000,"item_id":"4adf34ea","timestamp":1634168252966,"domain":"electrek.co","item_date_formatted":"Oct 11, 7:49 pm","description_trimmed":"While Tesla is moving its headquarters out of California, CEO Elon Musk made it clear that the automaker would still grow in the state.\nHe wasn’t lying, since Tesla is now taking over a large part of HP’s campus in Palo Alto.\n more…\nThe post Tesla (TSLA) takes over HP’s campus in...","keywords":"Moving Hq"},{"title":"Tesla Does Away With The NDA On FSD Beta Footage Because It Never Needed It Anyway","description":"News that Tesla had instituted a non-disclosure agreement as part of its “Full Self-Driving” Beta came as something of a surprise back in September. Not because NDAs are rare in the tech realm — they’re not at all — but more because it was clear from the outset that nobody was really following it. Videos of FSD…Read more...","author":"Jalopnik","url":"https://jalopnik.com/tesla-does-away-with-the-nda-on-fsd-beta-footage-becaus-1847840033","link_type":"article","item_date":1633981200000,"item_id":"f1af6561","timestamp":1634168252958,"domain":"jalopnik.com","item_date_formatted":"Oct 11, 7:40 pm","description_trimmed":"News that Tesla had instituted a non-disclosure agreement as part of its “Full Self-Driving” Beta came as something of a surprise back in September. Not because NDAs are rare in the tech realm — they’re not at all — but more because it was clear from the outset that nobody was re...","keywords":"Tech Realm, Surprise Back, They Re"},{"title":"Game Over For Gasmobiles: Electric Vehicle Batteries Just Keep On Getting Better","description":"A little known company in the US state of Washington hatches a plan to accelerate global decarbonization with a new formula for electric vehicle batteries.","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/11/game-over-for-gasmobiles-electric-vehicle-batteries-just-keep-on-getting-better/","link_type":"article","item_date":1633979412000,"item_id":"0e646eb8","timestamp":1634168252845,"domain":"cleantechnica.com","item_date_formatted":"Oct 11, 7:10 pm","description_trimmed":"A little known company in the US state of Washington hatches a plan to accelerate global decarbonization with a new formula for electric vehicle batteries.","keywords":"Washington Hatches"},{"title":"Mustang Mach-E GT Performance first drive","description":"I recently got the opportunity to experience the upcoming GT versions of Ford’s Mustang Mach-E electric crossover. This included extensive rides with the Mach-E GT and GT Performance, as well as a couple of laps around an autocross track – plenty of time to test out the performance and unique features the new GT has to offer, as showcased in a video below.\n more…\nThe post Mustang Mach-E GT Performance first drive appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/10/11/mustang-mach-e-gt-first-drive-consumers-are-gonna-have-fun-in-this-ev/","link_type":"article","item_date":1633978704000,"item_id":"872f7f33","timestamp":1634168253130,"domain":"electrek.co","item_date_formatted":"Oct 11, 6:58 pm","description_trimmed":"I recently got the opportunity to experience the upcoming GT versions of Ford’s Mustang Mach-E electric crossover. This included extensive rides with the Mach-E GT and GT Performance, as well as a couple of laps around an autocross track – plenty of time to test out the performan...","keywords":"Gt Performance, Mustang Mach, Drive Appeared"},{"title":"Tesla has already created 5,000 new jobs in Austin in 2021, the most of any company","description":"Tesla has already created 5,000 new jobs in Austin, Texas, so far in 2021, according to a report from the Austin Chamber of Commerce. Companies expanding or relocating to the city pledged to create 20,840 jobs from January to September, with 150 companies contributing to the growth. The data shows that Tesla is the company to pledge and create the most jobs in 2021 in Austin.\nAfter announcing that Tesla would expand its North American production footprint by erecting a new manufacturing facility in Austin, speculation began to intrigue many of those interested with how many jobs the electric automaker would contribute to the region. Tesla chose Austin over Tulsa, Oklahoma, amidst the ongoing COVID-19 crisis that put many people out of work and many businesses into bankruptcy. However, Tesla’s ultimate pledge was to help Austin recover its economic dominance by offering a substantial number of jobs to those who reside in the area.\n\n\n\nTesla Gigafactory Texas as of October 8, 2021. (Credit: @JoeTegtmeyer/Twitter)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nTesla was projected to create 15,000 new jobs from Gigafactory Texas eventually, with 9,000 new employment opportunities entering the state, growing Texas’ economic platform, and reigniting a region known for strong commercialized residency. Tesla is the most recent, announced last week during the 2021 Shareholder Meeting that its headquarters would officially move to the City of Austin.\nTesla has created the most jobs so far and has also pledged to create the most jobs. Tesla, considered an “expanded” company in the Austin Chamber of Commerce chart, stated that it would pledge 5,000 new employment opportunities in the region. KVUE, an Austin-based ABC affiliate, stated that Tesla also created 5,000 jobs in the region thus far.\nTesla Giga Texas drive-bys show just how massive Elon Musk’s Cybertruck factory really is\n\nWith Tesla already having announced that its headquarters will move from Palo Alto, California, to Austin, this number could already be increasing as more employment opportunities will likely be created due to the company moving its administrative operations to Texas.\nOther notable companies to pledge considerable employment opportunities include Amazon, which pledged to create 2,000 new jobs at a Texas fulfillment center.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla has already created 5,000 new jobs in Austin in 2021, the most of any company appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-gigafactory-texas-5000-new-jobs-austin-2021/","link_type":"article","item_date":1633973592000,"item_id":"fa0b04a3","timestamp":1634168253112,"domain":"teslarati.com","item_date_formatted":"Oct 11, 5:33 pm","description_trimmed":"Tesla has already created 5,000 new jobs in Austin, Texas, so far in 2021, according to a report from the Austin Chamber of Commerce. Companies expanding or relocating to the city pledged to create 20,840 jobs from January to September, with 150 companies contributing to the grow...","keywords":"Austin Chamber, Employment Opportunities, Created Due, Company Tesla"},{"title":"Tesla tells new FSD Beta members their cars will use Pure Vision, axing radar altogether","description":"Tesla has switched all vehicles in the Full Self-Driving Beta pool to Pure Vision, completely axing radar from any vehicles within the Beta fleet. Even if a member of the FSD Beta program has radar installed in their vehicle, Tesla’s Full Self-Driving beta program will not utilize it, adopting a stance that CEO Elon Musk has held for some time.\nPreviously, vehicles with radar capabilities still utilized it for Autopilot. However, when Tesla switched the Model 3 and Model Y to Pure Vision in May 2021, the automaker completely expunged the two mass-market vehicles of radar-based operation, relying only on the vehicle’s eight external cameras. Initial testing showed that vehicles without radar operated more accurately than those with cameras and radar.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nAs Tesla plans to transition all vehicles to Pure Vision, owners of vehicles that have recently joined the growing fleet of FSD Beta are now seeing that their cars are no longer utilizing radar, if their car has that capability. One owner who joined the Beta group, which expanded by roughly 1,000 users last night with the rollout of Version 10.2, stated that an email from Tesla told them that “Your vehicle is running on Tesla Vision.” Essentially, this means that the car is no longer utilizing the radar devices that previously were operational before the vehicle was added to the Beta fleet.\nTeslarati obtained a copy of the email, which told all new FSD Beta members that their cars would no longer use radar.\n“Hello,\nWe will be pushing FSD Beta Version 10.2 (2021.32.25) to your vehicle shortly!\nFull Self-Driving is in limited early access Beta and must be used with additional caution. It may do the wrong thing at the worst time, so you must always keep your hands on the wheel and pay extra attention to the road. Do not become complacent. When Full Self-Driving Beta is enabled, your vehicle will make lane changes off highway, select forks to follow your navigation route, navigate around other vehicles and objects, and make left and right turns. Use Full Self-Driving Beta only if you will pay constant attention to the road, and be prepared to act immediately, especially around blind corners, crossing intersections, and in narrow driving situations. Every driver is responsible for remaining alert and active when using Autopilot and must be prepared to take action at any time.\nAs part of receiving FSD Beta, your vehicle has automatically opted into VIN-associated telemetry sharing with Tesla, including Autopilot usage data, images and/or video. If you wish to be removed from the limited early access FSD Beta please email fsdbeta@tesla.com.\nYour vehicle is running on Tesla Vision! Note that Tesla Vision also includes some temporary limitations, as noted below:\n\nFollow distance is limited to 2-7.\n\nAutopilot top speed is 80 mph.\n\n\nThanks,\nTesla Team”\nCEO Elon Musk said that the reason for the transition for all Beta vehicles to utilize Pure Vision is because the performance of camera-based operation proved to be exceptionally better than radar and cameras. “Vision became so good that radar actually reduced SNR, so radar was turned off,” Musk said. Additionally, the CEO compared the current strategy of FSD to the basic functions of a human when driving. “Humans drive with eyes &amp; biological neural nets, so makes sense that cameras &amp; silicon neural nets are only way to achieve generalized solution to self-driving,” Musk added.\n\nVision became so good that radar actually reduced SNR, so radar was turned off.\nHumans drive with eyes &amp; biological neural nets, so makes sense that cameras &amp; silicon neural nets are only way to achieve generalized solution to self-driving.\n— Elon Musk (@elonmusk) October 11, 2021\n\n\nIn the past, Musk has always had plans of switching to camera-based FSD operation. During the company’s Q1 2021 Earnings Call in April, Musk said that radar was good for “making up for some of the shortfalls of vision,” but eventually Tesla would have to figure out how to get away from radar. “When your vision works, it works better than the best human because it’s like having eight cameras, it’s like having eyes in the back of your head, beside your head and has three eyes of different focal distances looking forward. This is — and processing it at a speed that is superhuman. There’s no question in my mind that with a pure vision solution, we can make a car that is dramatically safer than the average person,” Musk stated.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla tells new FSD Beta members their cars will use Pure Vision, axing radar altogether appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-fsd-beta-members-pure-vision-no-radar-beta-pool-expansion/","link_type":"article","item_date":1633968987000,"item_id":"8777f9fe","timestamp":1634168253058,"domain":"teslarati.com","item_date_formatted":"Oct 11, 4:16 pm","description_trimmed":"Tesla has switched all vehicles in the Full Self-Driving Beta pool to Pure Vision, completely axing radar from any vehicles within the Beta fleet. Even if a member of the FSD Beta program has radar installed in their vehicle, Tesla’s Full Self-Driving beta program will not utiliz...","keywords":"Pure Vision, Tesla Vision, Self Driving, Eyes Amp"},{"title":"Tesla FSD Beta 10.2 - Better than 10.1 - First Drive!","description":"https://www.youtube.com/watch?v=2Oj8RbTwwF0","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=2Oj8RbTwwF0","link_type":"article","item_date":1633965976000,"item_id":"fc0e5e1c","timestamp":1634168253129,"domain":"youtube.com","item_date_formatted":"Oct 11, 3:26 pm","description_trimmed":"https://www.youtube.com/watch?v=2Oj8RbTwwF0","keywords":""},{"title":"Tesla FSD Beta 10.2 Is Rolling Out to Cars with 100/100 Safety Score over 100 Miles","description":"Photo: @BayAreaDiary/Twitter | Tesla Tube/YouTube\nTesla has begun rolling out FSD Beta 10.2 to cars with a 100/100 safety score for over 100 miles, Elon Musk announced on Twitter. Now, a wider number of owners will be able to test the new software and help the company refine it.Tesla intended to begin rolling out FSD Beta 10.2 more widely at midnight on October 8 to around 1,000 owners with excellent safety ratings. However, in the last minutes, several concerns about the build have been identified, so the deployment was postponed a few days to Sunday or Monday, for which Elon Musk personally apologized to the Tesla owners on Twitter.As promised, the distribution started early Monday morning. Musk announced via Twitter that FSD Beta 10.2 is now rolling out to cars with a 100/100 safety score for over 100 miles, delighting many owners who have been looking forward to it.\n\nBeta 10.2 now rolling out to cars with 100/100 safety score over 100 miles\n— Elon Musk (@elonmusk) October 11, 2021\n\n\nSeveral owners have already shared the great news that software downloads have already begun on their vehicles and they are looking forward to testing. Some users have even posted short testing videos, although we will be able to receive more detailed and extensive feedback about FSD Beta 10.2 from them within the next few days.\n\nEarly Access Program, Full Self Driving Beta 10.2 . Quick midnight drive 😁 #tesla #fsd #beta pic.twitter.com/pMlniDQMj5\n— lorraine (@callasev) October 11, 2021\n\n\n\nIf testing of FSD Beta 10.2 is successful, Tesla will begin a gradual rollout to users with a safety score of 99 or below. It should be kept in mind that, at the moment, the Safety Score is just a beta version, so it will be improved in the future until it becomes a very good predictor of the likelihood of an accident.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU","author":"TESMANIAN - Tesmanian Blog","url":"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-fsd-beta-10-2-rolling-out-to-cars-with-100-100-safety-score-over-100-miles","link_type":"article","item_date":1633959498000,"item_id":"1b9a3479","timestamp":1634168252968,"domain":"tesmanian.com","item_date_formatted":"Oct 11, 1:38 pm","description_trimmed":"Photo: @BayAreaDiary/Twitter | Tesla Tube/YouTube\nTesla has begun rolling out FSD Beta 10.2 to cars with a 100/100 safety score for over 100 miles, Elon Musk announced on Twitter. Now, a wider number of owners will be able to test the new software and help the company refine it.T...","keywords":"Safety Score, Fsd Beta, Driving Beta, Tesla Owners"},{"title":"2021 Volvo XC40 Recharge Pros and Cons Review: EVolvo","description":"2021 Volvo XC40 Recharge Pros and Cons Review: EVolvo","author":"EV News - The Latest Electric Car, Truck, and SUV News and Updates","url":"https://www.motortrend.com/news/2021-volvo-xc40-recharge-pros-cons-review/","link_type":"article","item_date":1633910400000,"item_id":"f0d0a135","timestamp":1634168253136,"domain":"motortrend.com","item_date_formatted":"Oct 11, 12:00 am","description_trimmed":"2021 Volvo XC40 Recharge Pros and Cons Review: EVolvo","keywords":"Volvo Xc, Recharge Pros"},{"title":"The software engineer will fix your car now","description":"As sales of electric vehicles soar, spare a thought for the mechanics","author":"Electric vehicles","url":"https://www.ft.com/content/bc813976-4fea-4ac3-afb8-4cd4eee0d462","link_type":"article","item_date":1633695044000,"item_id":"b1c5c459","timestamp":1634168252029,"domain":"ft.com","item_date_formatted":"Oct 8, 12:10 pm","description_trimmed":"As sales of electric vehicles soar, spare a thought for the mechanics","keywords":"Software Engineer"},{"title":"Musk says Tesla will move headquarters to Texas","description":"Move comes as state’s conservative social policies have attracted calls for business boycotts","author":"Electric vehicles","url":"https://www.ft.com/content/272b678a-ff4d-4ecf-90a0-4eee9d32f844","link_type":"article","item_date":1633652705000,"item_id":"bb7dd07a","timestamp":1634168252028,"domain":"ft.com","item_date_formatted":"Oct 8, 12:25 am","description_trimmed":"Move comes as state’s conservative social policies have attracted calls for business boycotts","keywords":"Texas Move, Move Headquarters"}]}