{
  "etag": "W/\"39ad1a991f696169c1583d464ee39e54\"",
  "items": [
    {
      "title": "Will car dealerships be able to adapt to the age of electric cars fast enough?",
      "description": "Tesla vehicle drivers are familiar with completing most of the car-buying or leasing steps online. But according to new research from global business management consultants EY, not everyone is ready to ditch the car dealership experience. It’s a familiar car-buying experience, especially for those who haven’t yet switched to electric cars. But dealerships are going to have to adapt quickly to the changes brought by the arrival of electric cars, or they’ll be left behind.\n more…\nThe post Will car dealerships be able to adapt to the age of electric cars fast enough? appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/22/will-car-dealerships-be-able-to-adapt-to-the-age-of-electric-cars-fast-enough/",
      "link_type": "article",
      "item_date": 1634928041000,
      "item_id": "f1ecc551",
      "timestamp": 1634958294161,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 22",
      "description_trimmed": "Tesla vehicle drivers are familiar with completing most of the car-buying or leasing steps online. But according to new research from global business management consultants EY, not everyone is ready to ditch the car dealership experience. It’s a familiar car-buying experience, es...",
      "keywords": "Electric Cars, Car Dealerships"
    },
    {
      "title": "A Ridiculously Detailed Look At Why The Rivian R1T Electric Truck Is The King Of Off-Road Pickups",
      "description": "Here's a ridiculously-detailed look at the Rivian R1T's off-road performance.",
      "author": "TeslaTracker Submissions",
      "url": "https://jalopnik.com/a-ridiculously-detailed-look-",
      "link_type": "article",
      "item_date": 1634857341000,
      "item_id": "a625b4a5",
      "timestamp": 1634958294174,
      "domain": "jalopnik.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Here's a ridiculously-detailed look at the Rivian R1T's off-road performance.",
      "keywords": "Ridiculously Detailed, Off Road, Rivian T's"
    },
    {
      "title": "Tesla plans shift to LFP cells for Model 3 and Model Y, likely with US production",
      "description": "After switching to lithium iron phosphate (LFP) battery cells for Chinese-market Model 3 and Model Y electric cars, Tesla plans to expand use of the cells to global markets—with local production. Tesla said in its third-quarter earnings report released Wednesday that LFP chemistry will be used in all standard-range vehicles globally. That...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133942_tesla-plans-shift-to-lfp-cells-for-model-3-and-model-y-likely-with-us-production",
      "link_type": "article",
      "item_date": 1634850600000,
      "item_id": "5089a9c2",
      "timestamp": 1634958294175,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "After switching to lithium iron phosphate (LFP) battery cells for Chinese-market Model 3 and Model Y electric cars, Tesla plans to expand use of the cells to global markets—with local production. Tesla said in its third-quarter earnings report released Wednesday that LFP chemistr...",
      "keywords": "Tesla Plans, Lfp Cells, Local Production"
    },
    {
      "title": "Tesla switches Standard Range vehicles to LFP battery chemistry",
      "description": "Among the most interesting announcements made by Tesla during its Q3 2021 Earnings Call yesterday was the strategy to move all of its Standard Range vehicles to a cheaper LFP, or lithium iron phosphate, battery chemistry.\n“For standard range vehicles, we are shifting to Lithium Iron Phosphate (LFP) battery chemistry globally,” Tesla said in its Q3 Shareholder’s Deck, released just before the Earnings Call commenced last evening.\nIt’s a strategy that Tesla adopted in the Chinese market since it has built the Model 3 in Shanghai in early 2020. However, now Tesla is planning to shift the Model 3 Standard Range and Model Y Standard Range vehicles to the LFP pack, which is definitely more available than the standard NCA or nickel cobalt aluminum packs. Tesla actually shifted to utilizing the LFP pack in some SR+ Model 3s and offered customers the opportunity to utilize that pack so they could take delivery quicker. In late August, Tesla emailed some Model 3 orderers with the message that the battery pack could be changed to the LFP pack, which was in healthy supply.\nTesla emailed those who had the vehicle on order in August, saying:\n“We are contacting you about your Model 3 Standard Range Plus, currently estimated for delivery near the end of the year. We’d like to offer you the opportunity to receive your car even sooner. Due to limited supply and strong customer demand, we are introducing the Model 3 Standard Range Plus battery pack, which we already released in Europe and Asia, to North America. This battery has a range of 253 miles (est).”\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nThe strategy could have to do with Tesla’s demand, which has exceeded its production rate. The LFP batteries are less expensive than NCA cells and have longer lifespans. The disadvantage to switching to this pack is lower energy density, meaning less power and less range. LFP batteries are also more prone to be affected by weather, something that can cause lower range ratings and prolific differences in power output.\nCEO Elon Musk said that Tesla’s intention with the LFP pack is that the “product experience is roughly equivalent between nickel and iron.” Musk added that he’d “personally opt for iron pack, as it wants to be charged to 100%, whereas nickel prefers ~90%.”\nMusk also made comments regarding the LFP packs during the Q2 2021 Earnings Call.\n“I think probably there is a long-term shift more in the direction of iron-based lithium-ion cells rather over nickel. I think probably we’ll see a shift — my guess is probably to two-thirds iron, one-third nickel, or something on that order. And this is actually good because there’s plenty of iron in the world. There’s an insane amount of iron. But nickel, there’s much less nickel, and there’s way less cobalt.”\nThe shift in electrification from so many automakers has caused a shortage in some battery materials, which also could be a strategy for the shift to LFP cells by Tesla. Combating delivery times can be solved by switching to other materials, but Tesla plans to also combat shortages by expanding its manufacturing footprint with two new production facilities in Berlin and Austin, Texas.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla switches Standard Range vehicles to LFP battery chemistry appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-switches-standard-range-vehicles-to-lfp-battery-chemistry/",
      "link_type": "article",
      "item_date": 1634850262000,
      "item_id": "bc7c3f92",
      "timestamp": 1634958294215,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Among the most interesting announcements made by Tesla during its Q3 2021 Earnings Call yesterday was the strategy to move all of its Standard Range vehicles to a cheaper LFP, or lithium iron phosphate, battery chemistry.\n“For standard range vehicles, we are shifting to Lithium I...",
      "keywords": "Lfp Pack, Standard Range, Tesla Emailed, Battery Pack"
    },
    {
      "title": "You Can Now Directly Read Data Logs From Tesla Vehicles",
      "description": "Tesla vehicles record a truly incredible amount of data. So much so, in fact, that the cars’ own hardware has had trouble keeping up with the amount of information. Tesla cars have historically been stingy with their data, allowing access to limited amounts of emergency information, but a research team in the…Read more...",
      "author": "Jalopnik",
      "url": "https://jalopnik.com/you-can-now-directly-read-data-logs-from-tesla-vehicles-1847910795",
      "link_type": "article",
      "item_date": 1634845800000,
      "item_id": "da7617ba",
      "timestamp": 1634958294330,
      "domain": "jalopnik.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla vehicles record a truly incredible amount of data. So much so, in fact, that the cars’ own hardware has had trouble keeping up with the amount of information. Tesla cars have historically been stingy with their data, allowing access to limited amounts of emergency informati...",
      "keywords": "Tesla Cars, Limited Amounts, Incredible Amount, Emergency Information"
    },
    {
      "title": "Tesla Autopilot vindicated by event data in highly publicized fatal crash ‘with no one at the wheel’",
      "description": "Tesla Autopilot has been vindicated by its event data recorder in a highly publicized fatal crash that was reported as having “no one at the wheel.”\n more…\nThe post Tesla Autopilot vindicated by event data in highly publicized fatal crash ‘with no one at the wheel’ appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/21/tesla-autopilot-vindicated-event-data-in-highly-publicized-fatal-crash/",
      "link_type": "article",
      "item_date": 1634845551000,
      "item_id": "ac30d3c2",
      "timestamp": 1634958294437,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla Autopilot has been vindicated by its event data recorder in a highly publicized fatal crash that was reported as having “no one at the wheel.”\n more…\nThe post Tesla Autopilot vindicated by event data in highly publicized fatal crash ‘with no one at the wheel’ appeared first...",
      "keywords": "Event Data"
    },
    {
      "title": "Tesla CFO: There’s A “Profound Awakening” In The Electric Car Sector",
      "description": "Once again, Tesla broke records and exceeded expectations in the latest quarter. But, the company’s third quarter earnings call was quite different this time around. As expected, there was no commentary from company CEO Elon Musk. Instead, CFO Zachary Kirkhorn helmed the call, with input also provided by a few other top execs. Even without […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/21/tesla-cfo-theres-a-profound-awakening-in-the-electric-car-sector/",
      "link_type": "article",
      "item_date": 1634843484000,
      "item_id": "c3cad229",
      "timestamp": 1634958294497,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Once again, Tesla broke records and exceeded expectations in the latest quarter. But, the company’s third quarter earnings call was quite different this time around. As expected, there was no commentary from company CEO Elon Musk. Instead, CFO Zachary Kirkhorn helmed the call, wi...",
      "keywords": "Exceeded Expectations, Tesla Cfo, Latest Quarter"
    },
    {
      "title": "Tesla's Investment in Bitcoin Is Worth $1.26B as of Q3, According to Earnings Report",
      "description": "Image: Reuters\nTesla continues to hold its stake in Bitcoin, which is already generating solid profits. The company's digital asset value at the end of Q3 was $1.26 billion, according to its earnings report.On February 8, the manufacturer announced that it had updated its investment policy to give itself more flexibility to further diversify and increase the return on its cash, and had acquired $1.5 billion in Bitcoin cryptocurrency. Although the purchase price of the crypto coin was not disclosed, it is reported that the purchase was made in January.Tesla sold 10% of its Bitcoin in Q2 at an average price of about $50,000 per coin. The CEO of the company Elon Musk later tweeted that Tesla sold 10% of its Bitcoin assets to prove the asset's liquidity and viability as an alternative to cash on its balance sheet. In June, he also wrote that Tesla owns less than 42,069 Bitcoins, although that that number is close. In its Q2 earnings report, Tesla announced that it made a $128 million profit from the sale of Bitcoin.In its Q3 2021 earnings report, Tesla wrote that the company had $1.26 billion in digital assets at the end of the quarter. As of September 30, Bitcoin was worth about $43,340 per coin. It should be kept in mind that since then, the value of Bitcoin has increased by more than 44%, and at the time of this writing is $62,520.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU",
      "author": "TESMANIAN - Tesmanian Blog",
      "url": "https://www.tesmanian.com/blogs/tesmanian-blog/teslas-investment-in-bitcoin-is-worth-1-26-billion-according-to-the-earnings-report",
      "link_type": "article",
      "item_date": 1634842188000,
      "item_id": "d06efd7a",
      "timestamp": 1634958294500,
      "domain": "tesmanian.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Image: Reuters\nTesla continues to hold its stake in Bitcoin, which is already generating solid profits. The company's digital asset value at the end of Q3 was $1.26 billion, according to its earnings report.On February 8, the manufacturer announced that it had updated its investm...",
      "keywords": "Earnings Report, Bitcoin Assets, Bitcoin Cryptocurrency, Digital Assets"
    },
    {
      "title": "Tesla’s strong Q3 financials catalyze price target increases from analysts",
      "description": "Tesla (NASDAQ: TSLA) posted an incredibly strong third quarter last evening during its Earnings Call, making remarkable strides on its financials to extend its profitable quarters streak to nine. Analysts at numerous Wall Street firms are upgrading their price targets on Tesla stock following the company’s strong numbers and positive outlook moving forward as it intends to ramp its Texas and Berlin Gigafactories in the coming months.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWedbush – Dan Ives\nStarting with some of Tesla’s most notable bulls, Wedbush’s Daniel Ives boosted his price target to $1,100 from $1,000 while maintaining an Outperform rating. “Last night, Tesla delivered solid top-line results which were in-line with expectations and speaks to a new Tesla margin story going forward,” Ives wrote to investors. “Auto GM was 30%+ and roughly 250 bps ahead of Street expectations which highlights the massive leverage in the Tesla story now starting to take hold with Giga China front and center as Tesla is on an EBITDA run-rate of roughly $13 billion, a staggering number given the company is still in the early stages of building out its global EV moat.”\nTesla’s demand increases, which have resulted in delivery estimates extending well into 2022 are going to be handled by Giga Berlin and Giga Texas. “We believe EV demand is outstripping supply for Tesla by roughly 30k units and the chip shortage has clearly amplified this dynamic with wait times for Model Y and some Model 3’s extending into the spring for current orders,” Ives said. “However, big supply help is on the way for Musk &amp; Co. as the long the awaited Gigafactory hubs in Austin and Berlin are set to have are set to have the ribbon cut over the coming months and should expand Tesla’s capacity to roughly 2 million units annually over the next 18 months.\nIves has a $1,500 price target for Tesla’s bull case, up from the $1,300 target he previously held. TipRanks has Ives ranked 18 out of 7,705 analysts, with an average return of 37.5% and a success rate of 79%.\nCanaccord Genuity – Jed Dorsheimer\nDorsheimer raised his price target from $940 to $1,040 while maintaining a Buy rating. “Post Tesla’s 3Q21, we are maintaining our BUY rating and increasing out PT to $1,040, which is based on 45x our ’24 Adj. EBITDA estimate of $25.9B (previously $940 based on 55x of $19B). We are bullish on the auto gross margin expansion, and remain excited for battery constraints to abate and be reallocated to energy products later in 2022,” Dorsheimer wrote. “After reporting record delivery numbers a few weeks ago, a beat may have been priced in and shares could see a ‘buy the rumor, sell the news’ type pull back. We would be buyers at these levels and if any pullback occurs.”\nTipRanks has Dorsheimer ranked 210 out of 7,705 analysts, with an average return of 32.9% and a success rate of 56%.\nDeutsche Bank – Emmanuel Rosner\nRosner raised his price target on Tesla from $900 to $1,000, maintaining his Buy rating. The impressive measure of automotive gross margins was indicative of a strong operational performance, despite industry challenges like semiconductor and parts shortages.\n“Tesla reported particularly strong 3Q21 operating performance, delivering its highest auto gross margins since Model 3 was introduced, despite minimal S+X volume and higher supply chain costs, and impressive GAAP operating margin of 14.6% (18.4% ex-SBC), surpassing even its long-term company targets,” Rosner wrote. Tesla also stated that, despite its low volume, the Model S has returned to profitability.\n“While revenue came in somewhat below expectations, this was driven mainly by lower regulatory credit and services/other contributions, while auto revenue was more in-line. We leave our 2021E deliveries unchanged at 845k, but take up our auto GM (ex credit) to nearly 27% from &lt;26%, and EPS to $6.45 (from $6.20 previously).”\nRosner holds a ranking of 1,339 out of 7,705 analysts with a 57% success rate and an average return of 14.3%, according to TipRanks.\nDisclosure: Joey Klender is a TSLA Shareholder.\nThe post Tesla’s strong Q3 financials catalyze price target increases from analysts appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-tsla-q3-2021-price-target-increases-strong-financials/",
      "link_type": "article",
      "item_date": 1634839174000,
      "item_id": "deeaf4ce",
      "timestamp": 1634958294351,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla (NASDAQ: TSLA) posted an incredibly strong third quarter last evening during its Earnings Call, making remarkable strides on its financials to extend its profitable quarters streak to nine. Analysts at numerous Wall Street firms are upgrading their price targets on Tesla st...",
      "keywords": "Price Target, Buy Rating, Success Rate, Average Return"
    },
    {
      "title": "Tesla confirms new Cybertruck prototypes, gives hope on its timeline",
      "description": "Tesla has given an update on the Cybertruck – confirming that it has new prototypes and giving some hope on the timeline to production.\n more…\nThe post Tesla confirms new Cybertruck prototypes, gives hope on its timeline appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/21/tesla-cybertruck-update-new-prototypes-confirmed-hope-timeline/",
      "link_type": "article",
      "item_date": 1634836636000,
      "item_id": "6eb3ea5d",
      "timestamp": 1634958294616,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla has given an update on the Cybertruck – confirming that it has new prototypes and giving some hope on the timeline to production.\n more…\nThe post Tesla confirms new Cybertruck prototypes, gives hope on its timeline appeared first on Electrek.",
      "keywords": "Cybertruck Prototypes, Tesla Confirms, Timeline Tesla"
    },
    {
      "title": "EV Technology Presents Condo Associations With Dilemmas",
      "description": "More and more people will be driving EVs in the next 5 years. What are condo associations doing now to plan for EV charging by condo owners?",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/21/ev-technology-presents-condo-associations-with-dilemmas/",
      "link_type": "article",
      "item_date": 1634836517000,
      "item_id": "cf723e7c",
      "timestamp": 1634958294439,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "More and more people will be driving EVs in the next 5 years. What are condo associations doing now to plan for EV charging by condo owners?",
      "keywords": "Condo Associations, Condo Owners"
    },
    {
      "title": "Tesla is enforcing strict FSD Beta rules for inattentive drivers",
      "description": "It appears that Tesla is indeed determined to keep its FSD Beta program as free from untoward incidents as possible. As recently shared by the Tesla community online, Tesla has been sending out emails to some FSD Beta testers who have been flagged for not using the advanced driver assist system responsibly. The company’s message is clear: drivers who misuse the FSD Beta system will be kicked off the program. \nThe following is Tesla’s message to an FSD Beta tester who was flagged for improper use. Interestingly enough, Tesla noted that it would only be sending one warning to concerned drivers. After the initial warning, the FSD Beta system would be removed from the vehicle in question. \n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nHello,\nYou are receiving this email because telemetry from your vehicle was flagged for improper usage of the FSD Beta feature. \nSpecifically, while using the FSD Beta feature, you or another driver of your vehicle received: \n\n\n\nTwo or more “strikeouts,” which resulted in the loss of Autopilot availability for that drive; or\nAt least one “strike” per 5 km (about 3 miles) driven on Autopilot, which is a visual and audible warning that requires attention.\n\n\n\nThis is your only warning to please keep your hands on the wheel and remain attentive at all times when using Autopilot. The car is not autonomous, and if you aren’t paying attention, a crash could happen, and you or others could get hurt, or worse, so failure to abide by this warning will result in removal of the FSD Beta feature from your vehicle. \nThe Tesla Team\nTesla did not specify exactly what driving behavior caused the warning to be sent to the FSD Beta tester. However, the company has been cracking down on actions such as looking at phones while operating FSD or Autopilot. Granted, Tesla’s wording in its message seems quite assertive, but it is understandable. FSD Beta is only starting to get expanded to more users, after all, and it is imperative that the company avoid tolerating unsafe driving behaviors as much as possible. \nDuring the Q3 2021 earnings call, Tesla CFO Zachary Kirkhorn highlighted that Tesla’s Autopilot team had been working extremely hard to improve the driver-assist system. The executive further noted that Tesla is making it a point to be as transparent as possible when it comes to the improvements being rolled out to Autopilot and FSD. \n“The Autopilot team is working extremely hard iterating on every version. We are being extremely transparent through the release of this to public customers who are posting information online. So when you’re using full self-driving and you’re going through the iterations, you can feel the progress. And for those who don’t have it in their cars, social media is excellent at getting a sense for how that’s progressing,” Kirkhorn said. \nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla is enforcing strict FSD Beta rules for inattentive drivers appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-kicks-off-fsd-beta-inattentive-drivers/",
      "link_type": "article",
      "item_date": 1634832051000,
      "item_id": "0cf532e7",
      "timestamp": 1634958294840,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "It appears that Tesla is indeed determined to keep its FSD Beta program as free from untoward incidents as possible. As recently shared by the Tesla community online, Tesla has been sending out emails to some FSD Beta testers who have been flagged for not using the advanced drive...",
      "keywords": "Autopilot Team, Fsd Beta, Operating Fsd, Autopilot Availability"
    },
    {
      "title": "California EV incentive is getting smaller in November",
      "description": "A California incentive for plug-in cars is about to be reduced by half. Effective November 2, the California Clean Fuel Reward (CCFR) for electric cars and plug-in hybrids will go from $1,500 to $750. The program, as recently noted by CarsDirect, requires delivery of a qualifying vehicle by November 1 if buyers want to claim the larger amount...",
      "author": "Green Car Reports",
      "url": "https://www.greencarreports.com/news/1133923_california-ev-incentive-is-getting-smaller-in-november",
      "link_type": "article",
      "item_date": 1634828400000,
      "item_id": "2e6d21f7",
      "timestamp": 1634958294846,
      "domain": "greencarreports.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "A California incentive for plug-in cars is about to be reduced by half. Effective November 2, the California Clean Fuel Reward (CCFR) for electric cars and plug-in hybrids will go from $1,500 to $750. The program, as recently noted by CarsDirect, requires delivery of a qualifying...",
      "keywords": "Plug In, California Incentive, Effective November, Electric Cars"
    },
    {
      "title": "Tesla confirms that it’s built multiple Cybertruck alpha prototypes",
      "description": "As Tesla Giga Texas prepares to start Model Y production, Cybertruck deliveries are inching closer. At the Q3 2021 earnings call, Tesla confirmed that it had built a few Cybertruck alpha prototypes, and the EV pickup truck has entered the beta stage.\n\n\n\nInterest in the Cybertruck was apparent at Tesla’s third-quarter earnings call. Quite a few investor questions were about the Cybertruck and its production. Lars Moravy, Tesla’s Vice President of Vehicle Engineering, provided a few updates about the Cybertruck, providing some much needed updates for those who are extremely excited for news about the all-electric pickup.\n\n\n\n\nTesla is making progress on the Cybertruck’s industrialization, will be built after Model Y\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n“We’ve been busy detailing the Cybertruck to achieve the prototype version we shared with customers a while back,” Moravy shared.\n\n\n\nRecently, a new alpha prototype of the Cybertruck was sighted at the Castle Airport in Atwater, California. Sightings of the EV pickup are always welcome, and this time Tesla teased a few surprises about it. The Cybertruck seen driving around the Castle Airport sported side mirrors and possible rear-wheel steering functions. Its wheels also seemed staggered.\n\n\n\n“As you may have seen recently in social media, we’ve built a number of alphas and are currently testing those to further mature the design. And while those point out a few key additions like rear steer, there are also a number of smaller or less visible improvements though the product is largely true to the initial vision. We’ll continue to work through the product in the beta stages that we’re in now and look to launch that by next year,” Moravy said.\n\n\n\n(Credit: @TeslaTruckClub/Twitter)\n\n\n\nWhile answering questions about the company’s $25k model, Moravy stated that Tesla does not want to add new vehicles to its lineup “when we’re generally in a cell-constrained world.” Tesla is working hard to increase its cell supply, specifically with its 4680 production line. The company aims to start testing vehicles with 4680 sometime next year.\n\n\n\nTesla plans to start Cybertruck production after Giga Texas ramps the Model Y, which may take some time given global supply chain constraints. However, the start of Cybertruck production may coincide with the ramp of Tesla’s 4680 cells. With that in mind, Tesla may be producing enough cells to manufacture Cybertrucks and its other vehicles when production on the all-electric pickup starts.\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla confirms that it’s built multiple Cybertruck alpha prototypes appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-cybertruck-alpha-protype-fleet-confirmed/",
      "link_type": "article",
      "item_date": 1634824800000,
      "item_id": "9dcf5e12",
      "timestamp": 1634958294623,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "As Tesla Giga Texas prepares to start Model Y production, Cybertruck deliveries are inching closer. At the Q3 2021 earnings call, Tesla confirmed that it had built a few Cybertruck alpha prototypes, and the EV pickup truck has entered the beta stage.\n\n\n\nInterest in the Cybertruck...",
      "keywords": "Earnings Call, Cybertruck Production, Alpha Prototype, Tesla Confirms"
    },
    {
      "title": "Tesla made $1.6 billion in Q3, is switching to LFP batteries globally",
      "description": "The lithium iron phosphate cells are less energy-dense but much longer-lived.",
      "author": "TeslaTracker Submissions",
      "url": "https://arstechnica.com/cars/2021/10/tesla-made-1-",
      "link_type": "article",
      "item_date": 1634824795000,
      "item_id": "ea81b2c5",
      "timestamp": 1634958294893,
      "domain": "arstechnica.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "The lithium iron phosphate cells are less energy-dense but much longer-lived.",
      "keywords": "Tesla Made"
    },
    {
      "title": "Tesla's German plant hits snag as public consultation repeated",
      "description": "Tesla's German plant hits snag as public consultation repeated",
      "author": "TeslaTracker Submissions",
      "url": "https://www.reuters.com/world/europe/teslas-german",
      "link_type": "article",
      "item_date": 1634824794000,
      "item_id": "27b9f43b",
      "timestamp": 1634958294894,
      "domain": "reuters.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla's German plant hits snag as public consultation repeated",
      "keywords": ""
    },
    {
      "title": "Tesla vehicles with 4680 battery cells on track for testing next year",
      "description": "Tesla aims to start testing vehicles equipped with 4680 battery cells by next year.\n\n\n\nDuring the Q3 2021 earning call, Drew Baglino—Tesla’s Senior Vice President of Powertrain and Engineering—answered an investor question about 4680 battery cells.\n\n\n\n“Early next year, from a non-cell perspective, structural, battery, crash, range, and reliability testing are on track to be complete this quarter. Testing is—to date has gone well, and the Fremont manufacturing line is on track to support,” said Baglino.\n\n\n\nBaglino’s response hinted that Tesla’s 4680 production line on Kato Road saw some promising results, specifically in terms of performance. However, Tesla still appears to be moving forward with caution, choosing to prioritize quality to produce safe battery cells.\n\n\n\n\nTesla’s 4680 battery cell pilot production line hits 70-80% yield: report\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n“However, similar to what Zach said before, this is a new architecture, and unknown unknowns may exist still. Our top priority is ensuring quality in what we deliver. And from a cell perspective, we are comfortable with the design maturity and manufacturing readiness, matching the pack timeline I just mentioned,” Baglino added.\n\n\n\nBaglino’s update bodes well for the rollout of vehicles like the Cybertruck and the Tesla Semi, both of which are heavily speculated to be equipped with 4680 cells due to their large size and substantial power requirements. Considering the Tesla executive’s statement, it would not be surprising if more prototypes of the Cybertruck and the Semi would be sighted on the roads in the coming year. \n\n\n\nAt the earnings call, Tesla’s Chief Financial Officer Zach Kirkhorn mentioned that commodity prices were rising. Kirkhorn confirmed that Tesla was affected by the spike in raw materials for batteries. He explained that Tesla’s primary exposure to the almost 40% spike in raw materials centered around nickel and aluminum.\n\n\n\nKirkhorn elaborated that Tesla has a mixture of contracts with various suppliers for raw materials. For instance, earlier this month, Tesla signed a supply deal with Prony Resources to purchase 42,000 tonnes of nickel in a multi-year deal.\n\n\n\nKirkhorn predicted more cost headwinds for raw materials, resulting from volatility and substantial price increases.\n\n\n\n“And as contracts expire there or we have to renew and extend them, we’ll have to return to negotiations. And so, you know, what we have to do as a company and what we are intensely focused on is we need to be continuing to drive down the cost of our products, which we have been doing. And we have to overcome cost increases that are outside of our control,” Kirkhorn elaborated.\n\n\n\n“So whether that’s resourcing components or redesigning components or finding ways to be more efficient in manufacturing, we have no choice but to continue on that path and be even more aggressive in the light of the macroeconomics here,” he said.\n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Tesla vehicles with 4680 battery cells on track for testing next year appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-semi-cybertruck-4680-tests-release-date/",
      "link_type": "article",
      "item_date": 1634817600000,
      "item_id": "318353e1",
      "timestamp": 1634958294509,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla aims to start testing vehicles equipped with 4680 battery cells by next year.\n\n\n\nDuring the Q3 2021 earning call, Drew Baglino—Tesla’s Senior Vice President of Powertrain and Engineering—answered an investor question about 4680 battery cells.\n\n\n\n“Early next year, from a non...",
      "keywords": "Battery Cells, Raw Materials, Unknown Unknowns, Kirkhorn Elaborated"
    },
    {
      "title": "Tesla's R&amp;D center for its $25k electric car is complete",
      "description": "submitted by    /u/chrisdh79   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/qcpnte/teslas_rd_center_for_its_25k_electric_car_is/",
      "link_type": "article",
      "item_date": 1634815744000,
      "item_id": "a93049a2",
      "timestamp": 1634958294435,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "submitted by    /u/chrisdh79   [link]   [comments]",
      "keywords": "Tesla's Amp, Electric Car, Complete Submitted"
    },
    {
      "title": "Tesla 2021 Q3 Earnings",
      "description": "Tesla 2021 Q3 Earnings",
      "author": "TeslaTracker Submissions",
      "url": "https://tesla-cdn.thron.com/static/TWPKBV_TSLA_Q3_",
      "link_type": "article",
      "item_date": 1634781566000,
      "item_id": "d8375349",
      "timestamp": 1634958294895,
      "domain": "tesla-cdn.thron.com",
      "item_date_formatted": "Oct 21",
      "description_trimmed": "Tesla 2021 Q3 Earnings",
      "keywords": "Earnings Tesla"
    },
    {
      "title": "Tesla bucks global chip shortage with record revenue and profits",
      "description": "Third-quarter net profit at electric carmaker hit $1.6bn as it captured growing mainstream market",
      "author": "Electric vehicles",
      "url": "https://www.ft.com/content/1e084713-1506-4256-b00b-59cb6125d2c1",
      "link_type": "article",
      "item_date": 1634766202000,
      "item_id": "2c8ec4af",
      "timestamp": 1634958294848,
      "domain": "ft.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Third-quarter net profit at electric carmaker hit $1.6bn as it captured growing mainstream market",
      "keywords": ""
    },
    {
      "title": "Tesla Requests Meeting Between Indian Prime Minister &amp; Elon Musk: Report",
      "description": "Image: Narendra Modi\nTesla reportedly requested a meeting between Indian Prime Minister Narendra Modi and its CEO Elon Musk. It is assumed that the subject of discussion will be the issue of reducing duties on car imports in order to understand the demand in the local market.Tesla has called on Indian Prime Minister Narendra Modi's office to lower taxes on imports of electric vehicles before they enter the market, four sources told Reuters. The company aims to start selling its vehicles in India this year, but this is difficult to achieve as taxes on imported cars in the country are among the highest in the world.Reuters said that according to four of its sources familiar with the case, Tesla executives, including its head of policy in India, Manuj Khurana, in September at a closed meeting passed their demands to Modi officials and explained that import duties are too high. During the meeting at Modi's office, Tesla said that India's duty structure would not make its business in the country a \"viable proposition,\" according to one of the sources.Currently, India levies a 60% import duty on electric vehicles under $40,000 and a 100% duty on vehicles over $40,000. This makes Tesla vehicles too expensive for buyers and may limit their sales. It will also make it difficult for the manufacturer to estimate the actual demand in the country. If the company could get a reduction in duty, to assess demand—and after studying the Indian market was convinced of the popularity of its cars—then Tesla could start producing them directly in the country.In addition, Tesla has separately requested a meeting between its CEO Elon Musk and Modi, three sources told Reuters. For now, government officials are divided over the claims of the American automaker. Some of them want the company to commit to manufacturing locally before considering any import tax breaks.\n\n© 2021, Eva Fox | Tesmanian. All rights reserved.\n\n_____________________________\nWe appreciate your readership! Please share your thoughts in the comment section below. \nArticle edited by @SmokeyShorts, you can follow him on Twitter\nFollow @EvaFoxU",
      "author": "TESMANIAN - Tesmanian Blog",
      "url": "https://www.tesmanian.com/blogs/tesmanian-blog/tesla-requested-meeting-between-indian-prime-minister-and-elon-musk-report",
      "link_type": "article",
      "item_date": 1634754749000,
      "item_id": "48c60c8c",
      "timestamp": 1634958294937,
      "domain": "tesmanian.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Image: Narendra Modi\nTesla reportedly requested a meeting between Indian Prime Minister Narendra Modi and its CEO Elon Musk. It is assumed that the subject of discussion will be the issue of reducing duties on car imports in order to understand the demand in the local market.Tesl...",
      "keywords": "Electric Vehicles, Elon Musk, Import Duty, Import Duties"
    },
    {
      "title": "Elon Musk Despises A New NHTSA Appointee",
      "description": "Yesterday, Reuters reported that the Biden administration would be naming two people to positions at the National Highway Traffic Safety Administration. This would not ordinarily be notable, except that, thankfully, Tesla CEO Elon Musk happens to have an issue with one of them.  Read more...",
      "author": "Jalopnik",
      "url": "https://jalopnik.com/elon-musk-despises-a-new-nhtsa-appointee-1847899910",
      "link_type": "article",
      "item_date": 1634754240000,
      "item_id": "19d2a5f7",
      "timestamp": 1634958294952,
      "domain": "jalopnik.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Yesterday, Reuters reported that the Biden administration would be naming two people to positions at the National Highway Traffic Safety Administration. This would not ordinarily be notable, except that, thankfully, Tesla CEO Elon Musk happens to have an issue with one of them.  ...",
      "keywords": "Biden Administration, Reuters Reported"
    },
    {
      "title": "@wintonARK The day FSD goes to wide release will be one of the biggest asset value increases in history",
      "description": "@wintonARK The day FSD goes to wide release will be one of the biggest asset value increases in history",
      "author": "@elonmusk on Twitter",
      "url": "https://twitter.com/elonmusk/status/1450868052040507392",
      "link_type": "article",
      "item_date": 1634748874000,
      "item_id": "592da797",
      "timestamp": 1634958294955,
      "domain": "twitter.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "@wintonARK The day FSD goes to wide release will be one of the biggest asset value increases in history",
      "keywords": "Wide Release, Day Fsd"
    },
    {
      "title": "How Tesla Can Improve Its Customer Service",
      "description": "Tesla is a company that I care about because its mission is important to me. (Full disclosure: I’m a shareholder with a very minute number of shares.) I think what Tesla is doing for the many industries it touches is more than revolutionary, but necessary if we are going to evolve as a species from […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/20/how-tesla-can-improve-its-customer-service/",
      "link_type": "article",
      "item_date": 1634741083000,
      "item_id": "6a9e06ff",
      "timestamp": 1634958294954,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Tesla is a company that I care about because its mission is important to me. (Full disclosure: I’m a shareholder with a very minute number of shares.) I think what Tesla is doing for the many industries it touches is more than revolutionary, but necessary if we are going to evolv...",
      "keywords": "Minute Number, Full Disclosure"
    },
    {
      "title": "Top Tesla Q3 2021 earnings call questions from retail &amp; institutional investors",
      "description": "Another quarter has come and gone for Tesla (NASDAQ:TSLA) this year. Now, Tesla is preparing for another earnings call. Below are some questions investors want answered at the Q3 2021 earnings call.\n\n\n\nTop Retail Questions\n\n\n\n\nWhat is the Tesla’s goal for vehicle production capacity for the 4 current factories (Fremont, Shanghai, Austin, and Berlin) by 2024?\nService remains an issue with appointments available weeks, or even months, out. Likewise, Supercharger wait times have become untenable at some locations. What concrete steps is Tesla taking to improve the customer experience in these two key areas? \nIs Tesla considering any other ideas (other than FSD) with real world AI that can bring additional software revenue to Tesla? If not, can Tesla consider building interesting games around FSD data?\nHow has FSD take rate changed since introduction of Monthly Subscription? Are there any plans to increase FSD pricing as wider release becomes imminent?\nCan Tesla allow for FSD to be transferred to another vehicle at a fee? (Something less than the 10k)? Early adopters are paying the price if they want to upgrade their vehicle. You lose the value on the trade in and now have to buy in at the now higher cost.\n\n\n\n\n\nTesla (TSLA) Q3 2021 earnings: What to expect\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\nTop Institutional Investor Questions\n\n\n\n\nWhen should we expect the first vehicles to be delivered with 4680 cells?\nDo you still expect to start production of the $25,000 model in 2023? What are the biggest hurdles from now until then?\nWith FSD Beta training data set to explode exponentially as the software is released to wider and wider audience, are there any early takeaways with regards to how quickly versions can iterate and be pushed out? From bi-weekly to weekly? or even daily?\n\n\n\n\nShortly after the third quarter wrapped up, Tesla reported stellar production and delivery numbers for Q3 2021, surpassing its 2020 results with one quarter left in the year. Last year, Tesla aimed to deliver 500,000 vehicles and missed its goal by a sliver. In 2021, the company aimed to beat its deliveries from last year. \n\n\n\nTesla achieved its goal, delivering a total of 627,350 vehicles this year so far. With such an accomplishment, Tesla has increased the chances of a strong fourth quarter and outstanding end-of-year results.\n\n\n\nDisclosure: I am long TSLA. \n\n\n\nThe Teslarati team would appreciate hearing from you. If you have any tips, reach out to me at maria@teslarati.com or via Twitter @Writer_01001101.\nThe post Top Tesla Q3 2021 earnings call questions from retail &amp; institutional investors appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-q3-2021-earnings-call-questions/",
      "link_type": "article",
      "item_date": 1634734200000,
      "item_id": "0c2311f5",
      "timestamp": 1634958295030,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Another quarter has come and gone for Tesla (NASDAQ:TSLA) this year. Now, Tesla is preparing for another earnings call. Below are some questions investors want answered at the Q3 2021 earnings call.\n\n\n\nTop Retail Questions\n\n\n\n\nWhat is the Tesla’s goal for vehicle production capac...",
      "keywords": "Earnings Call, Retail Amp, Questions Investors, Top Tesla"
    },
    {
      "title": "Porsche Faces Intense Competition From Upstart Electric Car Company",
      "description": "A single electric car model from an upstart EV manufacturer is outselling the iconic Porsche 911 as well as several of its stablemates in the Porsche model lineup, namely the Panamera sedan and Boxster/Cayman twins. Who is this daring new company? None other than Porsche itself. The all-electric Taycan found its way into 28,640 new […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/20/porsche-faces-intense-competition-from-upstart-electric-car-company/",
      "link_type": "article",
      "item_date": 1634733004000,
      "item_id": "d261878f",
      "timestamp": 1634958295107,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "A single electric car model from an upstart EV manufacturer is outselling the iconic Porsche 911 as well as several of its stablemates in the Porsche model lineup, namely the Panamera sedan and Boxster/Cayman twins. Who is this daring new company? None other than Porsche itself. ...",
      "keywords": "Porsche Itself"
    },
    {
      "title": "Electric vehicles at a spaghetti junction",
      "description": "Chart crime at Her Majesty’s Government.",
      "author": "Electric vehicles",
      "url": "https://www.ft.com/content/743636cc-571b-49bf-a7d0-c6483e6bad82",
      "link_type": "article",
      "item_date": 1634726888000,
      "item_id": "7850b1a0",
      "timestamp": 1634958294955,
      "domain": "ft.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Chart crime at Her Majesty’s Government.",
      "keywords": "Electric Vehicles"
    },
    {
      "title": "Tesla expects more clarity on Model X next month",
      "description": "Tesla Model X buyers are left in the dark as deliveries start and some people who have placed an order a year ago still don’t know when they will get their car.\nElectrek has learned that Tesla expects more clarity on Model X delivery timelines next month.\n more…\nThe post Tesla expects more clarity on Model X next month appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/20/tesla-expects-more-clarity-on-model-x-next-month/",
      "link_type": "article",
      "item_date": 1634725788000,
      "item_id": "cadda952",
      "timestamp": 1634958295014,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Tesla Model X buyers are left in the dark as deliveries start and some people who have placed an order a year ago still don’t know when they will get their car.\nElectrek has learned that Tesla expects more clarity on Model X delivery timelines next month.\n more…\nThe post Tesla ex...",
      "keywords": "Tesla Expects, Month Appeared"
    },
    {
      "title": "Tesla Posts Record Quarterly Earnings on Supply-Chain Resilience",
      "description": "Elon Musk’s electric-vehicle maker notches a third consecutive record quarterly profit, thanks in part to its ability to navigate persistent global supply-chain disruptions.",
      "author": "WSJ.com: WSJD",
      "url": "https://www.wsj.com/articles/tesla-poised-for-record-quarterly-earnings-on-supply-chain-resilience-11634722200?mod=rss_Technology",
      "link_type": "article",
      "item_date": 1634722200000,
      "item_id": "ea478917",
      "timestamp": 1634958294895,
      "domain": "wsj.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "Elon Musk’s electric-vehicle maker notches a third consecutive record quarterly profit, thanks in part to its ability to navigate persistent global supply-chain disruptions.",
      "keywords": ""
    },
    {
      "title": "Tesla still faces $2 billion patent lawsuit by trucking startup Nikola",
      "description": "submitted by    /u/madheatteezy   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/qbu8zz/tesla_still_faces_2_billion_patent_lawsuit_by/",
      "link_type": "article",
      "item_date": 1634709875000,
      "item_id": "b1fc3484",
      "timestamp": 1634958295046,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "submitted by    /u/madheatteezy   [link]   [comments]",
      "keywords": ""
    },
    {
      "title": "Tesla Improves Semi, Files Patent for 'High power shielded busbar for electric vehicle charging and power distribution'",
      "description": "submitted by    /u/TheMajority0pinion   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/qbripy/tesla_improves_semi_files_patent_for_high_power/",
      "link_type": "article",
      "item_date": 1634698943000,
      "item_id": "d782cb9e",
      "timestamp": 1634958295016,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 20",
      "description_trimmed": "submitted by    /u/TheMajority0pinion   [link]   [comments]",
      "keywords": ""
    },
    {
      "title": "Is the first fossil-free jet fuel made from CO2 viable? The US Air Force thinks so",
      "description": "Berkeley, California-based carbon transformation company Twelve and Tulsa-based Emerging Fuels Technology (EFT) today announced that they have produced the first fossil-free jet fuel from carbon dioxide using an electrochemical process. The project received funding from the US Air Force.\n more…\nThe post Is the first fossil-free jet fuel made from CO2 viable? The US Air Force thinks so appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/19/is-the-first-fossil-free-jet-fuel-made-from-co2-viable-the-us-air-force-thinks-so/",
      "link_type": "article",
      "item_date": 1634676896000,
      "item_id": "09ca9632",
      "timestamp": 1634958295204,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "Berkeley, California-based carbon transformation company Twelve and Tulsa-based Emerging Fuels Technology (EFT) today announced that they have produced the first fossil-free jet fuel from carbon dioxide using an electrochemical process. The project received funding from the US Ai...",
      "keywords": "Fossil Free, Air Force, Jet Fuel"
    },
    {
      "title": "Fire that claimed original Tesla Roadsters ‘under investigation,’ Gruber Motors gives statement",
      "description": "A fire that claimed over thirty original 2008 Tesla Roadsters is now under investigation, according to new reports. The fire took place near Phoenix, Arizona, on October 16th at Gruber Motor Company, a haven that specializes in electric vehicle repairs and modifications. Peter Gruber, CEO of the shop, also gave a statement, indicating that he has reached out personally to the owner of each Roadster lost in the blaze.\nTeslarati received tips from 998 Media, an automotive photography site. According to the source, Phoenix Fire Department Ladder 50 and Ladder 41 arrived on the scene shortly before 3 AM Saturday morning. Gruber Motor Company’s main Service Center was the site of the fire. After responding, crews realized the site of Gruber Motors likely housed many electric vehicles, as the shop has a reputation for specializing in engineering services for Tesla vehicles specifically. This triggered a balance of 2nd alarm defensive fires with Hazardous Materials due to the unknown number of lithium-ion batteries inside.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nCrews worked to extinguish the fire from outside with multiple lines from multiple angles. The crews did knock down the main body of the fire rather quickly but did remain on-site through the morning to extinguish the hotspots that arose from the main body of fire. Crews indicate that there is no cause of fire determined at this time and it is under investigation. No injuries were reported.\nAdditionally, Peter Gruber gave an emotional statement to Roadster owners:\n“Each of the owners affected by our fire last night have been contacted. I personally reached out to each of you affected by a lost Roadster, rather than have you find out through the media. Talking to each of you, I am again reminded how cherished these cars are, how much they meant to you, and what a special place they carve out in automotive history. You all have my sincerest apologies and I feel your pain, having lost three in this mishap as well. I wish it was otherwise. We have three commercial buildings involved with Tesla vehicles, and the fire occurred in our main work in process Service Center. Early analysis by the first fire inspectors isolated the cause to an electrical panel failure, which of course will be investigated more thoroughly. Many other Roadsters survived, and each of you have been contacted as well. As with a previous fire we had in May of 2017, this fire again consumed the entire building and all its contents, which illustrate the potent nature of Lithium-Ion vehicles once they ignite. Our GMC expansion building, which has been under construction, is fully sprinkled. In the meantime, we are again relocating operations into one of our other buildings. Along with the entire Tesla community, we grieve the loss of over 30 Teslas that perished in our shop, which is dedicated to normally preserving and credited with saving hundreds of these rare and dying breed of first-generation EV’s.”\nThis is the second fire at Gruber Motor Company, the first being in May 2017 following an experimental repair that went wrong. This triggered a three-alarm fire which required gutting of the warehouse.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Fire that claimed original Tesla Roadsters ‘under investigation,’ Gruber Motors gives statement appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-roadster-gruber-motors-fire-under-investigation-video/",
      "link_type": "article",
      "item_date": 1634676774000,
      "item_id": "d55b518c",
      "timestamp": 1634958295111,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "A fire that claimed over thirty original 2008 Tesla Roadsters is now under investigation, according to new reports. The fire took place near Phoenix, Arizona, on October 16th at Gruber Motor Company, a haven that specializes in electric vehicle repairs and modifications. Peter Gr...",
      "keywords": "Gruber Motors, Main Body, Peter Gruber, Roadster Lost"
    },
    {
      "title": "Nikola holds on to its lawsuit against Tesla because that’s all it’s got",
      "description": "Nikola managed to barely hold on to its $2 billion lawsuit against Tesla over the design of its electric truck. The company’s stock went up 5% on the news as Nikola’s prospects are more and more limited following several controversies.\n more…\nThe post Nikola holds on to its lawsuit against Tesla because that’s all it’s got appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/19/nikola-holds-on-lawsuit-against-tesla-because-its-all-it-got/",
      "link_type": "article",
      "item_date": 1634675739000,
      "item_id": "ffabdcd8",
      "timestamp": 1634958295413,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "Nikola managed to barely hold on to its $2 billion lawsuit against Tesla over the design of its electric truck. The company’s stock went up 5% on the news as Nikola’s prospects are more and more limited following several controversies.\n more…\nThe post Nikola holds on to its lawsu...",
      "keywords": "Nikola Holds, Nikola Managed"
    },
    {
      "title": "ZEEKR’s first 001 EVs roll off assembly line ahead of deliveries this weekend",
      "description": "Infant luxury EV brand ZEEKR has officially begun rolling the first production models of its flagship 001 sedan off its assembly line in China. The brand exists under the Geely Holding Group umbrella, and will now begin the first deliveries of its first luxury EV to customers in China this weekend. \n more…\nThe post ZEEKR’s first 001 EVs roll off assembly line ahead of deliveries this weekend appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/19/zeekrs-first-001-evs-roll-off-assembly-line-ahead-of-deliveries-this-weekend/",
      "link_type": "article",
      "item_date": 1634673820000,
      "item_id": "9869459f",
      "timestamp": 1634958295412,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "Infant luxury EV brand ZEEKR has officially begun rolling the first production models of its flagship 001 sedan off its assembly line in China. The brand exists under the Geely Holding Group umbrella, and will now begin the first deliveries of its first luxury EV to customers in ...",
      "keywords": "Evs Roll, Assembly Line"
    },
    {
      "title": "Tesla brings CCS adapter to Korean market, intends North American launch soon",
      "description": "Tesla has brought its new CCS adapter to the Korean market, which is currently the only market that it is available. The automaker will bring the CCS adapter, which allows owners to charge at non-Tesla EV charging sites, to North America “soon.”\nTesla has, without a doubt, the most robust EV charging network in the world. It should, especially as it is the face of electric vehicles. However, more options are available with a CCS adapter, which would allow owners to utilize other charging sites that are not compatible with the Tesla charging port. This is an issue that only North American Tesla owners face as of now, as Tesla uses CCS in Europe, ever since the automaker launched the all-electric Model 3 sedan.\nTesla now has launched a CCS Combo 1 Adapter in Korea, which is compatible with the Model 3 and Model Y. The Model S and Model X CCS adapter was launched in 2019 as Tesla ramped up the output and installation of Supercharger stalls and stations globally. Now that a new adapter is available for the Model 3 and Model Y, owners are going to be able to charge at various EV charging locations and will not be limited to Tesla Superchargers and Destination chargers.\n\n\n\nCredit: Tesla\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nThe addition of the CCS adapter is advantageous for owners in markets where Superchargers are not plentiful as of yet. South Korea is a country that fits this description, as many of its Tesla Supercharger locations are confined to the Northwest corner of the country. There are Superchargers all around South Korea, but there are regions where charging stations are few and far between.\nEven if you’re in a country or location where Superchargers are popular and in plenty of locations, a CCS adapter is not a bad thing to have. It only increases the number of available charging options for owners, who might be willing to utilize third-party charging stations to gain a few miles of range before hitting a Supercharger or just need to make it home in a pinch after they did not have time to charge in the hours before their trip. Because of this, Tesla stated on its Charging-dedicated Twitter page that it would bring the CCS adapter to North America “soon.”\n\nCCS1 adapter now available in South Korea at https://t.co/Kizrkj4sWV. Available in North America soon. pic.twitter.com/OBtuAEsUl0\n— Tesla Charging (@TeslaCharging) October 19, 2021\n\n\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla brings CCS adapter to Korean market, intends North American launch soon appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-ccs-combo-adapter-korea-north-america-soon-model-3-model-y/",
      "link_type": "article",
      "item_date": 1634673557000,
      "item_id": "4a980393",
      "timestamp": 1634958295323,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "Tesla has brought its new CCS adapter to the Korean market, which is currently the only market that it is available. The automaker will bring the CCS adapter, which allows owners to charge at non-Tesla EV charging sites, to North America “soon.”\nTesla has, without a doubt, the mo...",
      "keywords": "Ccs Adapter, Korean Market, South Korea, Charging Stations"
    },
    {
      "title": "Tesla trademarks 'Giga Beer' and 'Giga Bier' for second venture into alcohol business",
      "description": "submitted by    /u/chrisdh79   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/qbg22j/tesla_trademarks_giga_beer_and_giga_bier_for/",
      "link_type": "article",
      "item_date": 1634663562000,
      "item_id": "2a78f510",
      "timestamp": 1634958295404,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "submitted by    /u/chrisdh79   [link]   [comments]",
      "keywords": "'giga Bier'"
    },
    {
      "title": "The Tesla Ecosystem: Generate, store and use your own clean energy https://t.co/367XuVUj4I",
      "description": "The Tesla Ecosystem: Generate, store and use your own clean energy https://t.co/367XuVUj4I",
      "author": "@teslasolar on Twitter",
      "url": "https://twitter.com/TeslaSolar/status/1450509548800851979",
      "link_type": "article",
      "item_date": 1634663400000,
      "item_id": "7c13b911",
      "timestamp": 1634958295047,
      "domain": "twitter.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "The Tesla Ecosystem: Generate, store and use your own clean energy https://t.co/367XuVUj4I",
      "keywords": "Tesla Ecosystem"
    },
    {
      "title": "Tesla Cybertruck with side mirrors and “rear-wheel steering” spotted in the wild",
      "description": "A short video recently shared online has hinted that Tesla is now testing an updated prototype of its futuristic Cybertruck. This time around, the hulking steel machine was evidently sporting a pair of side mirrors, and it also seems to be utilizing rear-wheel steering, a feature that had been previously teased by Elon Musk. \n\n\n\nThe recent clip of the Cybertruck with its new side mirrors was shared to Drive Tesla Canada by electric vehicle enthusiast Jesse Sandoval. According to the EV advocate, the video of the updated Cybertruck in action was taken at the Castle Airport, which is located at Atwater, California. Details of the all-electric pickup truck could not be determined in the video since the clip was recorded from a considerable distance, but the presence of side mirrors on the Cybertruck prototype seemed undeniable. \n\n\n\n\n\nCybertruck with side mirrors and appearing to do rear wheel steering Jesse Sandoval via @DriveTeslacahttps://t.co/Z0W6CBqTSv https://t.co/MunzMKa3bW pic.twitter.com/w4ANJnttpc— Tesla Hype (@TeslaHype) October 19, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nInterestingly enough, the Cybertruck also performed a pretty tight turn at the beginning of the clip. This suggested that the Cybertruck prototype might be equipped with rear-wheel steering functions. This is something that CEO Elon Musk had mentioned in the past when he noted that rear-wheel steering should allow the Cybertruck to “do tight turns and maneuver with high agility.” Such a feature might be behind the tight turning radius of the updated Cybertruck in the clip. \n\n\n\nThe Tesla Cybertruck has made substantial waves in the auto sector, and a lot of it is due to its unconventional design and overall brutalist look. The vehicle’s prototype, which had been spotted several times since its unveiling in late 2019, features an all-camera setup, with no side or rearview mirrors. Inasmuch as the absence of side mirrors makes the Cybertruck sleek and futuristic, however, an all-camera side mirror setup is still not allowed in some areas across the globe. \n\n\n\n\nElon Musk’s latest Tesla Cybertruck tease is a bit tricky to handle\n\n\n\n\n\nTesla CEO Elon Musk has announced a number of updates that are coming to the Cybertruck. Apart from its rear-wheel steering features, Musk has also mentioned that the all-electric pickup truck would not have any door handles. This would be a departure from the pop-up handles used in the initial Cybertruck prototype, which resembled heavy-duty versions of the Model S’ door handles. \n\n\n\nMusk also mentioned during the recently held AI Day that the Cybertruck would be the first Tesla that would be equipped with the company’s upcoming Hardware 4.0 computer, which should make the all-electric pickup truck as future-proof as possible. Tesla expects to produce the Cybertruck next year in Gigafactory Texas, with volume production hitting its stride sometime around 2023. \n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla Cybertruck with side mirrors and “rear-wheel steering” spotted in the wild appeared first on TESLARATI.",
      "author": "TESLARATI",
      "url": "https://www.teslarati.com/tesla-cybertruck-side-mirrors-rear-wheel-steering-video/",
      "link_type": "article",
      "item_date": 1634656880000,
      "item_id": "61ba6363",
      "timestamp": 1634958295207,
      "domain": "teslarati.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "A short video recently shared online has hinted that Tesla is now testing an updated prototype of its futuristic Cybertruck. This time around, the hulking steel machine was evidently sporting a pair of side mirrors, and it also seems to be utilizing rear-wheel steering, a feature...",
      "keywords": "Side Mirrors, Pickup Truck, Rear Wheel, Cybertruck Prototype"
    },
    {
      "title": "Tesla Cybertruck testing turning radius and visible side mirrors",
      "description": "submitted by    /u/GMScreech   [link]   [comments]",
      "author": "r/TeslaMotors - Your Tesla Community on Reddit on Reddit",
      "url": "https://www.reddit.com/r/teslamotors/comments/qbclu9/tesla_cybertruck_testing_turning_radius_and/",
      "link_type": "article",
      "item_date": 1634653532000,
      "item_id": "736ded0d",
      "timestamp": 1634958295110,
      "domain": "reddit.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "submitted by    /u/GMScreech   [link]   [comments]",
      "keywords": ""
    },
    {
      "title": "New taxes likely as part of UK’s net zero transition by 2050, Treasury warns",
      "description": "Long-awaited strategy to hit climate goals details state backing for technologies including nuclear and electric vehicles",
      "author": "Electric vehicles",
      "url": "https://www.ft.com/content/db22c007-6d88-4771-b059-bf0151d3a46a",
      "link_type": "article",
      "item_date": 1634650359000,
      "item_id": "71fd25f2",
      "timestamp": 1634958295410,
      "domain": "ft.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "Long-awaited strategy to hit climate goals details state backing for technologies including nuclear and electric vehicles",
      "keywords": ""
    },
    {
      "title": "https://t.co/a0F22R5Hv7",
      "description": "",
      "author": "@elonmusk on Twitter",
      "url": "https://twitter.com/elonmusk/status/1450435645655195649",
      "link_type": "article",
      "item_date": 1634645780000,
      "item_id": "2e968710",
      "timestamp": 1634958295415,
      "domain": "twitter.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "",
      "keywords": ""
    },
    {
      "title": "Police chase woman in stolen Tesla in Metro Detroit",
      "description": "https://www.youtube.com/watch?v=mcc8UNgZh_I",
      "author": "Tesla - YouTube",
      "url": "https://www.youtube.com/watch?v=mcc8UNgZh_I",
      "link_type": "article",
      "item_date": 1634615467000,
      "item_id": "fd0e6572",
      "timestamp": 1634958295403,
      "domain": "youtube.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "https://www.youtube.com/watch?v=mcc8UNgZh_I",
      "keywords": ""
    },
    {
      "title": "Tesla Begins Deliveries Of Its New Model X Long Range",
      "description": "Tesla has begun the first few deliveries of its new Model X Long Range with six seats. Over the weekend, Tesla shared images of some of the deliveries taking place. In the walkaround video (further below), you can see all six seats and the yoke for steering. First deliveries of new Model X pic.twitter.com/WfccyUXcFD — […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/18/tesla-begins-deliveries-of-its-new-model-x-long-range/",
      "link_type": "article",
      "item_date": 1634604871000,
      "item_id": "404e32d2",
      "timestamp": 1634958295421,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "Tesla has begun the first few deliveries of its new Model X Long Range with six seats. Over the weekend, Tesla shared images of some of the deliveries taking place. In the walkaround video (further below), you can see all six seats and the yoke for steering. First deliveries of n...",
      "keywords": ""
    },
    {
      "title": "What’s Happening With EV Charging Infrastructure In The USA?",
      "description": "How will ample EV charging infrastructures spur EV sales? The goal is to have 100% EV sales in early-adopting states by 2035 and 100% in the rest of the country by 2040.",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/18/whats-happening-with-ev-charging-infrastructure-in-the-usa/",
      "link_type": "article",
      "item_date": 1634603950000,
      "item_id": "8efc6f98",
      "timestamp": 1634958295420,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 19",
      "description_trimmed": "How will ample EV charging infrastructures spur EV sales? The goal is to have 100% EV sales in early-adopting states by 2035 and 100% in the rest of the country by 2040.",
      "keywords": "Ev Sales"
    },
    {
      "title": "Video: New Car Buyers Prefer Buying Online Instead Of Through A Dealer",
      "description": "One of Tesla’s key obstacles in the United States is the traditional auto dealership industry. Dealerships across the country have lobbied state and local governments to prevent Tesla from selling directly to its customers — and not just Tesla, but also Rivian, Lucid, and any newcomer that wants to sell directly to their customers and […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/18/video-new-car-buyers-prefer-buying-online-instead-of-through-a-dealer/",
      "link_type": "article",
      "item_date": 1634596167000,
      "item_id": "edb7bad6",
      "timestamp": 1634958295415,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 18",
      "description_trimmed": "One of Tesla’s key obstacles in the United States is the traditional auto dealership industry. Dealerships across the country have lobbied state and local governments to prevent Tesla from selling directly to its customers — and not just Tesla, but also Rivian, Lucid, and any new...",
      "keywords": "Selling Directly, Sell Directly"
    },
    {
      "title": "The cheapest EV in the world has landed in the US – here’s what it’s like",
      "description": "Electrek was invited to try out the cheapest EV in the world, which is manufactured by Changli. It was hilarious, cute, “cheap” in every way, and a wild exercise for the imagination. Even though it doesn’t retain its famed price tag, the US importers have put great effort into adding back value where the shipping costs took it away.\n more…\nThe post The cheapest EV in the world has landed in the US – here’s what it’s like appeared first on Electrek.",
      "author": "Electrek",
      "url": "https://electrek.co/2021/10/18/cheapest-ev-in-usa/",
      "link_type": "article",
      "item_date": 1634586076000,
      "item_id": "7caf2c35",
      "timestamp": 1634958295422,
      "domain": "electrek.co",
      "item_date_formatted": "Oct 18",
      "description_trimmed": "Electrek was invited to try out the cheapest EV in the world, which is manufactured by Changli. It was hilarious, cute, “cheap” in every way, and a wild exercise for the imagination. Even though it doesn’t retain its famed price tag, the US importers have put great effort into ad...",
      "keywords": "Cheapest Ev, Wild Exercise"
    },
    {
      "title": "Even ICE Enthusiasts Are Seeing The End, But What Does The End Look Like?",
      "description": "Switching cars over to electric drive is a good goal. Electric motors are far more efficient than their ICE counterparts, so they waste a lot less energy and are generally cleaner even when the power plant uses fossil fuels. When batteries are charged with electricity, the source of that electricity can get greener over time […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/18/even-ice-enthusiasts-are-seeing-the-end-but-what-does-the-end-look-like/",
      "link_type": "article",
      "item_date": 1634578543000,
      "item_id": "a56d6644",
      "timestamp": 1634958295509,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 18",
      "description_trimmed": "Switching cars over to electric drive is a good goal. Electric motors are far more efficient than their ICE counterparts, so they waste a lot less energy and are generally cleaner even when the power plant uses fossil fuels. When batteries are charged with electricity, the source...",
      "keywords": "Electric Motors, Electric Drive, Ice Enthusiasts, Ice Counterparts"
    },
    {
      "title": "Saving Humanity While Losing Our Humanity: Human Rights vs “Final Solutions” in the EV Market",
      "description": "“Live free or die: death is not the worst of evils.” — General John Stark, 1809 If you’re a defender of human rights, the news can be a hard thing to read and/or watch. Every day, some powerful piece of crap wearing a suit (or powerful pieces of crap wearing suits) are trying to take […]",
      "author": "CleanTechnica",
      "url": "https://cleantechnica.com/2021/10/17/saving-humanity-while-losing-our-humanity-human-rights-vs-final-solutions-in-the-ev-market/",
      "link_type": "article",
      "item_date": 1634512605000,
      "item_id": "5f89576d",
      "timestamp": 1634958295500,
      "domain": "cleantechnica.com",
      "item_date_formatted": "Oct 17",
      "description_trimmed": "“Live free or die: death is not the worst of evils.” — General John Stark, 1809 If you’re a defender of human rights, the news can be a hard thing to read and/or watch. Every day, some powerful piece of crap wearing a suit (or powerful pieces of crap wearing suits) are trying to ...",
      "keywords": "Human Rights, Powerful Pieces, Powerful Piece, Saving Humanity"
    },
    {
      "title": "RT @Tesla: There's no place like home..especially if it has a Solar Roof.\n\nThis Kansas ranch got theirs installed in 4 days.",
      "description": "RT @Tesla: There's no place like home..especially if it has a Solar Roof.\n\nThis Kansas ranch got theirs installed in 4 days.",
      "author": "@teslasolar on Twitter",
      "url": "https://twitter.com/TeslaSolar/status/1449819379030392832",
      "link_type": "article",
      "item_date": 1634498850000,
      "item_id": "a43484de",
      "timestamp": 1634958295510,
      "domain": "twitter.com",
      "item_date_formatted": "Oct 17",
      "description_trimmed": "RT @Tesla: There's no place like home..especially if it has a Solar Roof.\n\nThis Kansas ranch got theirs installed in 4 days.",
      "keywords": "Solar Roof, Rt Tesla, Kansas Ranch"
    }
  ],
  "item_upvotes": {
    "81e2497b": { "auth0|615cb90b861e13006987e6c1": true },
    "9752f133": { "auth0|615cb90b861e13006987e6c1": true },
    "525fb9fc": { "auth0|615cb90b861e13006987e6c1": true },
    "4e4ae40f": { "auth0|615cb90b861e13006987e6c1": true },
    "173a96e9": { "auth0|615cb90b861e13006987e6c1": true },
    "38b54873": {},
    "08a85c3c": { "auth0|615cb90b861e13006987e6c1": true }
  },
  "user_favorites": {
    "auth0|615cb90b861e13006987e6c1": [
      { "item_id": "4a7ed1c0", "action_date": 1634188847270 },
      { "item_id": "ac1f4744", "action_date": 1634188998838 },
      { "item_id": "6c12d760", "action_date": 1634191599061 },
      { "item_id": "17dff6cb", "action_date": 1634191604066 },
      { "item_id": "525fb9fc", "action_date": 1634351511045 },
      { "item_id": "81e2497b", "action_date": 1634596163543 },
      { "item_id": "4e4ae40f", "action_date": 1634598046648 },
      { "item_id": "173a96e9", "action_date": 1634598047329 },
      { "item_id": "38b54873", "action_date": 1634598068442 }
    ]
  },
  "user_upvotes": {
    "auth0|615cb90b861e13006987e6c1": [
      { "item_id": "81e2497b", "action_date": 1634353534128 },
      { "item_id": "9752f133", "action_date": 1634594816949 },
      { "item_id": "525fb9fc", "action_date": 1634594826435 },
      { "item_id": "173a96e9", "action_date": 1634596929344 },
      { "item_id": "4e4ae40f", "action_date": 1634598051844 },
      { "item_id": "08a85c3c", "action_date": 1634958279039 }
    ]
  }
}
