{"etag":"W/\"39ad1a991f696169c1583d464ee39e54\"","items":[{"title":"Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000","description":"Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000","author":"TeslaTracker Submissions","url":"https://electrek.co/2021/10/06/tesla-increases-mod","link_type":"article","item_date":1633537742000,"item_id":"2c922290","timestamp":1633540734113,"domain":"electrek.co","item_date_formatted":"Oct 6, 4:29 pm","description_trimmed":"Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000","keywords":"Cheapest Car"},{"title":"This is the title that I'd like to have fo the RemoteOK submission.","description":"This is the title that I'd like to have fo the RemoteOK submission.This is the description that I'd like to have for the RemoteOK submission.https://remoteok.io/","author":"TeslaTracker Submissions","url":"https://teslatracker.com/","link_type":"article","item_date":1633474075000,"item_id":"8c2ffe21","timestamp":1633540734130,"domain":"teslatracker.com","item_date_formatted":"Oct 5, 10:47 pm","description_trimmed":"This is the title that I'd like to have fo the RemoteOK submission.This is the description that I'd like to have for the RemoteOK submission.https://remoteok.io/","keywords":""},{"title":"First Drive Review: 2022 Lucid Air delivers a new leading edge for EVs","description":"Up until now, those buying premium electric cars have faced a stark dilemma: Either choose the EV that represents the leading edge of performance, range, and efficiency—yes, that would be the Tesla—or choose the EV that’s a more holistic luxury car in terms of features, styling, refinement, and build quality. The 2022 Lucid Air...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133777_first-drive-review-2022-lucid-air-delivers-a-new-leading-edge-for-evs","link_type":"article","item_date":1633448340000,"item_id":"9de1aa7b","timestamp":1633540734132,"domain":"greencarreports.com","item_date_formatted":"Oct 5, 3:39 pm","description_trimmed":"Up until now, those buying premium electric cars have faced a stark dilemma: Either choose the EV that represents the leading edge of performance, range, and efficiency—yes, that would be the Tesla—or choose the EV that’s a more holistic luxury car in terms of features, styling, ...","keywords":"Leading Edge, Lucid Air, Ev That, Stark Dilemma"},{"title":"Lucid Air driven, Jeep Grand Cherokee 4xe, GM battery innovation: Today’s Car News","description":"GM is focusing in on the batteries as the key to achieving a longer range and to lower costs. The Jeep Grand Cherokee plug-in hybrid will tow and go off-roading. And we drive the Lucid Air. This and more, here at Green Car Reports. The 2022 Lucid Air is already beating top numbers from Tesla in range and charging. But as we found in a very brief...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133778_lucid-air-driven-jeep-grand-cherokee-4xe-gm-battery-innovation-today-s-car-news","link_type":"article","item_date":1633449300000,"item_id":"d292f32d","timestamp":1633540734134,"domain":"greencarreports.com","item_date_formatted":"Oct 5, 3:55 pm","description_trimmed":"GM is focusing in on the batteries as the key to achieving a longer range and to lower costs. The Jeep Grand Cherokee plug-in hybrid will tow and go off-roading. And we drive the Lucid Air. This and more, here at Green Car Reports. The 2022 Lucid Air is already beating top number...","keywords":"Lucid Air, Longer Range"},{"title":"DroneSeed CEO Grant Canary Talks About Path To Tree-Planting Megadrones (Interview)","description":"DroneSeed solved how to avoid shocks to the seeds, avoid predation, get them in the right place, and keep them from drying out, with precision drone silviculture.","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/05/droneseed-ceo-grant-canary-talks-about-path-to-tree-planting-megadrones-interview/","link_type":"article","item_date":1633450164000,"item_id":"31eca54a","timestamp":1633540734136,"domain":"cleantechnica.com","item_date_formatted":"Oct 5, 4:09 pm","description_trimmed":"DroneSeed solved how to avoid shocks to the seeds, avoid predation, get them in the right place, and keep them from drying out, with precision drone silviculture.","keywords":"Avoid Shocks"},{"title":"22 small gifts to help friends who are self-isolating or social distancing feel less lonely","description":"When you buy through our links, Insider may earn an affiliate commission. Learn more.\n\t\n\nGreetabl\n\n\nPeople are still social distancing and isolating thanks to the Delta variant and unvaccinated risks.\n\nIsolation and loneliness are quite harmful for both your mental and physical health.\nSending your lonely loved ones a quarantine gift can go a long way to boosting their spirits. \nWhile U.S. cities aren't in lockdown as if October 2021, plenty of people are still self-isolating or social distancing to minimize the risks from either being unvaccinated or the uber-contagious Delta variant raging around the country. And as we all learned in 2020, having to skip weddings and birthdays or cancel trips home can feel downright lonely.And while nothing can compare to the joy of spending quality time with friends and family, technology and smart marketing has made it easier than ever to stay in touch. Sometimes, small ways of saying, \"Hello,\" or \"I'm thinking of you,\" make all the difference for someone struggling with being less social or alone.22 quarantine gift ideas for anyone struggling with social isolation:\n\n\tA little personalized gift box\n\t\n\t\n\nGreetabl Instagram\n\n\n\tGreetabl Personalized Gift Box, from $13\nWe love Greetabl because of how customizable it is — everything from the box to the treat that's inside of it can be perfectly catered to the recipient. From tasty treats like Sugarfina to cozy socks, Greetabl is an adorable and tailor-made way to put a smile on their face. \n\tA candle for wherever they're missing\n\t\n\t\n\nHomesick\n\n\n\tHomesick candle, $34\nWhether they're missing their home state, their annual family beach vacation, or their book club, Homesick has a candle to bring back the memories with just a match. In addition to the super personal and sentimental packaging, they will love the long burn and strong throw of these candles.\n\tA virtual class for cooking, wine tasting, and other new skills\n\t\n\t\n\nCozymeal\n\n\n\tCozymeal Online Cooking Classes, from $29\nAirbnb Online Experiences, from $5\nOnline skills class from our favorite online learning startups\nJust because you might not be able to see a person you love IRL doesn't mean you can't spend quality time together. You can take a virtual class together to learn a new skill or have a new experience. Brush up on your cooking skills with one of Cozymeal's classes like Gnocchi 101, Essentials of Sushi Rolling, and Cooking with Wine via Zoom; go off the beaten path with cocktail mixing, magic lessons, even a virtual wildlife safari through Airbnb. If hard skills are more your thing, sign up to learn JavaScript or The Science of Well-being from one of our 10 favorite places to take online courses, from free Harvard classes to Google certificate programs.\n\tA kids' kit that's both educational and fun\n\t\n\t\n\nKiwiCo/Instagram\n\n\n\tKiwiCo Crates, from $13.50/mo with code \"GIFTING\"\nPerfect for the kid you love who loves to learn, KiwiCo builds age-appropriate educational kits for the mini-scientist, engineer, or creative genius. Crates can be sent every month, every three months, every six months, or annually. \n\tA self-care package\n\t\n\t\n\nUncommon Goods\n\n\n\tUncommon Goods Self-Care Stocking Stuffer, $49\nSpending a period of time alone is a great opportunity to do some self-reflection and self-nurturing. Although this gift pack was put together as a stocking stuffer, the little bundle makes for a great self-care gift for anyone, anytime — and under $50. Included are a few of Uncommon Goods best-selling items, including lavender shower steamers; calming hand soap; lavender therapy dough to help with anxiety; and a neat card deck of affirmations.\n\tAnxiety-reducing meditation apps\n\t\n\t\n\nHeadspace\n\n\n\tHeadspace: Free to download, subscription from $13\nCalm: Free to download, subscription from $15\nMeditation apps like Calm and Headspace can be used anytime, anywhere, to practice mindfulness and decrease anxiety. Both apps have tailored meditations for specific circumstances, whether it's getting better sleep, starting your day, or meditations solely focused on exercise. While your loved ones can download Headspace or Calm for free, we'd recommend sending them the cost of the subscription on Venmo. \n\tA really comfy robe\n\t\n\t\n\nParachute\n\n\n\tParachute Classic Turkish Cotton Robe, $99\nIf you're spending copious amounts of time at home, you need to be comfortable while doing so. The Parachute Turkish Robe is our favorite bathrobe thanks to its fluffy, soft, not-too-heavy feel and high-quality cotton that justifies the price. And if $99 is a little too steep, check out the other bathrobes we love. \n\tFlowers or plants to brighten their room and their day\n\t\n\t\n\nUrbanStems\n\n\n\tSend a bouquet from our favorite flower delivery services\nShop plant delivery options at The Sill\nFlowers are always a classic route to take when trying to make someone's day, but houseplants make for an awesome surprise as well. Many of us are finding ourselves craving the outdoors more than ever, and a flower or plant delivery can help them stay connected to nature while also staying inside.\n\tA meal kit from their favorite restaurant\n\t\n\t\n\nGoldbelly\n\n\n\tGoldbelly Meal Kits, from $25\nIf they're missing catching up with you at your go-to restaurant, bring the socially distanced equivalent to them with Goldbelly. The food delivery service ships meal kits from popular restaurants in major cities nationwide, so whether or not they've been spending the pandemic in their favorite city, they can still enjoy their favorite meal.\nGoldbelly partners with iconic eateries around the country and delivers some of the best eats nationwide. Send them a box filled with food from a restaurant they love or one located in the city where they'll have their wedding if you want to get sentimental.\n\tA map of where they're missing most\n\t\n\t\n\nMapiful\n\n\n\tMapiful Custom Map, from $39\nMapiful allows for custom creation of map posters and frames, so they can feel connected to a city that's meaningful to them regardless of where they physically are. Mapiful's prints range from the classic map poster to custom zodiac prints, and you can even send them a print with their favorite photo.\n\tA postcard that shows how much you care\n\t\n\t\n\nAmazon\n\n\n\tFriendship Maintenance: 30 Postcards to Say How Much You Freaking Care, $8.34\nI've had this set of postcards for three years now, and it's my go-to for birthdays, sending support, or simply saying hi. These personalized, witty postcards read with the same quirky yet humorous tone that my friends and I speak in, and something about snail mail feels a bit more special than the usual \"checking in\" text message. \n\tA video message they'll never forget\n\t\n\t\n\nCameo\n\n\n\tCameo video messages, from $5\nFrom actors to professional athletes, Cameo is stacked with a selection of celebrities who will create custom videos for someone you care about. This unique concept is a fun and personalized way to check in on a friend, and it's sure to be a day maker. \n\tA journal to make them a writer\n\t\n\t\n\nBarnes &amp; Noble\n\n\n\t300 Writing Prompts, $9.01\nNothing brings me more joy than writing, and with many guided writing journals out there, this is the one I turn back to every time. The prompts are the perfect balance between intellectually stimulating and just plain fun, and I often find my responses to be the coping mechanism I didn't know I needed. I'm confident any writer will welcome this distraction from the inundation of screen time that's encompassed recent days.\n\tAn embroidery kit to keep them busy\n\t\n\t\n\nEtsy\n\n\n\tBeginner Embroidery Kit, from $11.19\nEmbroidery is an excellent stress reliever and easy hobby to poke away at while you rewatch all of \"Downton Abbey\" on Netflix. This beginner kit provides all the tools anyone needs to get started. There are five designs to choose from and you can either send them materials for a single design or a pack of three. \n\tComforting soup, delivered to their door\n\t\n\t\n\nSpoonful of Comfort\n\n\n\tSpoonful of Comfort Soup, $79.99\nIf they're self-isolating because they've caught COVID, they're definitely going to appreciate this very tasty and comforting meal kit. Spoonful of Comfort was launched to easily send comfort food to sick loved ones (or anyone who needs a little TLC), and its basic soup packages include a 64-ounce jar of soup (4-6 servings) along with dinner rolls, cookies, and a ladle with a personalized note. You can choose from Chicken Noodle, Chicken and Wild Rice, Harvest Vegetable, and more.\n\tA streaming service for the theater nerd in all of us\n\t\n\t\n\nInstagram/BroadwayHD\n\n\n\tBroadwayHD subscription, from $8.99/mo\nWhen Broadway went down for the pandemic, the world of digital theater exploded. If someone you know is really missing live performances, BroadwayHD is chock full of shows old and new. BroadwayHD categorizes its musicals and plays in a way that's easily decipherable, making \"Must See\" and \"Family Friendly\" shows readily available. \n\tMatching picture frames that let you connect\n\t\n\t\n\nUncommon Goods\n\n\n\tLong Distance Friendship Frame, from $99\nThe only thing sweeter than sending someone a framed photo reminding them of the great times you've had together is this tech-savvy option, which lets you touch your frame when you're missing your loved one, and their frame will light up, too — reminding them that they're on your mind. \n\tAn artist's starter kit\n\t\n\t\n\nAmazon\n\n\n\tArt 101 215-Piece Wood Art Set, $49.99\nIf they've gone through every Netflix show, every sourdough starter, and every puzzle they can get their hands on, set them up for a few more weeks of creative expression with this art kit. Packed with 215 materials ranging from crayons to watercolor paints, this art kit is appropriate for any age, and the organization is almost as pleasing to the eye as their upcoming creations will be. \n\tA letter board for inspirational messages\n\t\n\t\n\nFelt Like Sharing Store\n\n\n\tFelt Like Sharing Letter Board, $28.95\nNothing keeps you in a good headspace quite like motivational messages. This 10x10 letter board comes with 300 letters so they can write out pretty much anything that will keep them in a positive headspace. \n\t\n\t\n\t\n\nLandmark\n\n\n\tLandmass Scratch-Off Map Of The World, $17.99\nIf they're going through withdrawal of international travel, help them revel in the good times — and start thinking about what trip to start planning next. This map lets you scratch off where in the world you've been already, and then showcase it on your wall.\n\tA small, voice-activated assistant\n\t\n\t\n\nGoogle\n\n\n\tGoogle Nest Mini, $24.99\nWhen you're sick, it's nice to be able to just ask for music or answers to a question without any actual effort. And when you're self-isolating, any amount of talking is welcome — even if it's just to a digital assistant. The Google Nest Mini is an affordable smart speaker with Google Assistant built-in, so they can do everything from play their favorite Spotify playlist, to turn the TV volume down, to check their work calendar, all without lifting a finger. And right now, it's only $25.\n\tA head-to-toe self-care kit\n\t\n\t\n\nDrunk Elephant\n\n\n\tDrunk Elephant The Littles Hair + Body Kit 2.0, $49\nWhat else is there to do at home than some self-care? Cult-favorite beauty brand Drunk Elephant makes quality products that are both vegan and great for sensitive skin, and this super affordable kit includes seven mini bottles of fun products for your hair and body, plus a bonus comb and bag.\nRead the original article on Business Insider","author":"All Content from Business Insider","url":"https://www.businessinsider.com/gifts-for-people-struggling-with-social-distancing-because-of-coronavirus","link_type":"article","item_date":1633450437000,"item_id":"173a4654","timestamp":1633540734227,"domain":"businessinsider.com","item_date_formatted":"Oct 5, 4:13 pm","description_trimmed":"When you buy through our links, Insider may earn an affiliate commission. Learn more.\n\t\n\nGreetabl\n\n\nPeople are still social distancing and isolating thanks to the Delta variant and unvaccinated risks.\n\nIsolation and loneliness are quite harmful for both your mental and physical h...","keywords":"Self Isolating, Letter Board, Social Distancing, Virtual Class"},{"title":"DC Bulldozed a Homeless Person’s Tent While They Were Still Inside","description":"Want the best of VICE News straight to your inbox? Sign up here. A worker clearing out a homeless encampment with heavy machinery in the nation’s capital Monday managed to pick up a tent with an unhoused person still screaming inside, according to local media. When the machine, described in reports as both a bulldozer and a front-end loader, made contact with the tent in Washington, D.C., a person “could be heard screaming,” local news site WTOP reported. Workers, police, and activists then rushed to the tent, video of the incident shows.  The affected homeless person, who has not been identified, was taken to a local hospital for evaluation, and D.C. Deputy Mayor for Health and Human Services Wayne Turnage told WTOP that they’re expected to be OK.  Turnage emphasized to WTOP that it won’t happen again. While Turnage did not immediately respond to VICE News’ request for comment, he told WTOP someone had checked the tent before trying to move it Monday, but that moving forward, the city would also place a worker by a tent after it’s been checked to see if there’s a person inside; that way, the worker can ensure that nobody re-enters the tent before bringing in heavy machinery. But concerns are mounting about the future of the city’s pilot program to end some encampments by connecting their residents with housing and other social service programs, according to the Washington Post. The encampment that was cleared out Monday was the first of three that the city plans to take down, the Post reported, and 22 of the approximately 60 people living there have already moved into apartments. Eight others will get housing this week, while seven have received hotel rooms.  “While I’ve been informed that no one was hurt, if the resident had not been able to communicate their presence, they could have died,” Ward 1 Council Member Brianne Nadeau said of the incident on Twitter Monday.  “We are literally talking about life and death when working with encampments,” Nadeau continued. “And while I support funding housing solutions for our unhoused neighbors, as evidenced by the major investments I’ve fought for to help end homelessness, I continue to have concerns about the pilot program. I’ve expressed my concerns directly to Deputy Mayor Turnage and suggested we immediately revisit the protocols for the pilot.”   Even when cities have the best of intentions, these kinds of “sweeps” are often considered by homeless people and advocates to be the worst possible means of addressing the country’s affordable housing crisis. In most cities, tearing down one encampment typically doesn’t give homeless people somewhere to go—they’re just expected to move, period—and the process can destroy valuable items that a person might need to maintain their health and stability down the line: medications, documents necessary for welfare, wheelchairs, and more.  Almost 600 people have signed on to a letter that asks city officials to stop clearing encampments for the establishment of “no-tent zones,” particularly when everyone hasn’t been connected to housing yet, according to Axios.","author":"VICE US","url":"https://www.vice.com/en_us/article/5db7qb/dc-bulldozed-a-homeless-persons-tent-while-they-were-still-inside","link_type":"article","item_date":1633450897000,"item_id":"e2baee59","timestamp":1633540734523,"domain":"vice.com","item_date_formatted":"Oct 5, 4:21 pm","description_trimmed":"Want the best of VICE News straight to your inbox? Sign up here. A worker clearing out a homeless encampment with heavy machinery in the nation’s capital Monday managed to pick up a tent with an unhoused person still screaming inside, according to local media. When the machine, d...","keywords":"Pilot Program, Heavy Machinery, Worker Clearing, Homeless Person"},{"title":"Lidar developer Ouster agrees to buy Sense Photonics as it takes aim at the auto industry","description":"Ouster, a lidar company that went public this year via a SPAC merger, said it would acquire solid-state lidar startup Sense Photonics in an all-stock deal that was valued at around $68 million at close of markets on Monday.\nOnce the acquisition is complete, Ouster said it would establish a new business arm, Ouster Automotive, which will be headed by Sense CEO Shauna McIntyre. That business will integrate Sense’s 200-meter range solid-state lidar into a new lidar suite. San Francisco-based Sense’s claim to fame is also its improved field of view, as TechCrunch’s Devin Coldewey explained.\n\nSense Photonics flashes onto the lidar scene with a new approach and $26M\n\n\nAccording to a news statement, Ouster Automotive will also aim to advance negotiations with five automotive OEMs, though additional details about these potential deals were not provided. Should they turn into something solid, production would begin in 2025 or 2026.\nLidar is a key sensor in most autonomous driving stacks. The sensor, whose name is a shortened form of “light detection and ranging,” measures distance using lasers to generate a 3D map of the world. Along with radar, cameras and software, lidar is a critical part of the AV systems of some of the leading developers today, including companies like Waymo and Argo AI.\nIn February, Ouster CEO Angus Pacala said on the podcast “Shift” that the future of the lidar industry would be marked by consolidation. “There’s going to be three to five lidar companies within the next five years,” he said. This new acquisition is a mark that Ouster will be at the forefront of turning this prediction into a reality.\nEarlier this year, Ouster completed a merger with a blank-check firm in a deal valued at $1.9 billion. It joined rival lidar companies Luminar, Innoviz and Velodyne in taking the SPAC route to the public market. Ouster’s stock hit a year-to-date trading high of $15.39 in February; today, it’s trading for $7.41.\nUpdate: A spokesperson for Ouster confirmed to TechCrunch that the company expects the majority of Sense’s 80 employees to join McIntyre in joining Ouster.\nThe spokesperson added, “Ouster’s perspective has always been that auto OEMs want a multi-sensor suite of solid-state lidar, long to short-range, that can be manufactured at scale and integrated into the body of the vehicle for the low hundreds of dollars. That’s exactly what we’re planning to offer.”","author":"TechCrunch","url":"https://techcrunch.com/2021/10/05/lidar-developer-ouster-agrees-to-buy-sense-photonics-as-it-takes-aim-at-the-auto-industry/","link_type":"article","item_date":1633451213000,"item_id":"30e2d91e","timestamp":1633540734711,"domain":"techcrunch.com","item_date_formatted":"Oct 5, 4:26 pm","description_trimmed":"Ouster, a lidar company that went public this year via a SPAC merger, said it would acquire solid-state lidar startup Sense Photonics in an all-stock deal that was valued at around $68 million at close of markets on Monday.\nOnce the acquisition is complete, Ouster said it would e...","keywords":"Ouster Automotive, Lidar Company, Lidar Companies, Lidar Suite"},{"title":"@CStyles45 @Tesla Pushed a week to align with 10.2","description":"@CStyles45 @Tesla Pushed a week to align with 10.2","author":"@elonmusk on Twitter","url":"https://twitter.com/elonmusk/status/1443892118745911309","link_type":"article","item_date":1633085681000,"item_id":"19979dc2","timestamp":1633540734741,"domain":"twitter.com","item_date_formatted":"Oct 1, 10:54 am","description_trimmed":"@CStyles45 @Tesla Pushed a week to align with 10.2","keywords":""},{"title":"What VICE Readers Bought This Month: Massagers, Trippy Lights, and Fancy Earplugs","description":"Happy Thursday, dear VICE reader, and welcome to autumn, the cinnamon-roll-and-nostalgia zone. This month, our readers seemed to be beyond ready to get cozy and deck out their homes with decorative gourds and spooky candelabras, and we couldn't agree more—let's book some leaf-gazing weekend getaways and curl up with a weighted blanket, shall we? VICE-heads have massagin', masturbatin', and picking up new jackets, masks, and presents for the neighborhood squirrels, because you're all worth it!!!  So, what did we get into this month at Rec Room? Well, we started going to shows again, so we needed new masks and the best earplugs, and our friends started getting married again (gross) so we found the best unique gifts to give those losers who found true love. We found the coolest affordable fall basics, from flannels to beanies, and broke down TikTok's Y2K bedroom nostalgia and gorpcore, the streetwear look that's all about crunchy 90s North Face energy (need a fanny pack, or new hiking boots that won't make you look like a dorky uncle, anyone?). We explained what you need to try out pegging (why not?) and what mattresses can help with back pain if you're getting so freaky that you misalign that spine. We reviewed LELO's new vibrator, asked New York's coolest hair stylists what shampoo and conditioner we should be using for every hair type, started buying NFTs, tested out a bunch of anti-anxiety products, and found gifts for your Libra friends and e-bikes that won't make you look like you think Mark Zuckerberg is cool. Ugh, there's so much more, folks—but you'll have to pop over to Rec Room to see the rest. Here's what our faithful audience was most into this month, from the perfect denim coat to a trippy party light. An affordable sub for the cult-fave Theragun Back in late August, we reviewed the pricey but beloved Theragun line of massagers, and found that they're all pretty great. But since not everyone can drop several Benjamins on a super-charged body vibe, we found some affordable alternatives that also get the job done, like this $50 pick from Amazon. VICE readers are pickin' it up in spades, and loving it as much as the gazillion people on Amazon who have given it a five-star rating. Earplugs that protect your hearing without muffling the band We also reviewed Loop earplugs, which are designed to reduce noise levels without making you feel like you're under the sea. This is especially important when you're watching one of your favorite bands, of course—as our editor was when she tested them at a Turnstile show. The verdict: They're perfect for concert-going, and even look like cool Klingon jewelry while you're wearing them. The denim chore coat that we'll wear all through fall We recently did double duty on rounding up the best denim jackets for men and for women, because a) everyone should have a killer jean jacket and b) fall is the perfect time to wear it. The biggest hit with readers? Madewell's denim chore coat, which is equal parts retro and modern, functional and fly. A picnic table for squirrels, because y'all are crazy We love bringing you the best deals, and earlier this month, we came across this incredible invention that only highlights the ingenuity of mankind and the insane depths of Amazon. Yes, it is a picnic table for squirrels, complete with mirror and corn cob holder. Obviously, we all want one. The antiperspirant that all the super-sweatiest swear by We have some peeps on the team who are sweaty types, and so we know firsthand that a lot of \"deodorants\" don't do their jobs. But there is hope for those who are permanently glistening; as we break down in our list of the best men's deodorants, Certain Dri is considered the crème de la crème when it comes to antiperspirants that actually stop you from drippin'. More than 18,000 reviews on Amazon agree that this stuff is life-changing for the hyperhidrosis crowd. KN95 masks that don't make you look like all haz-mat It's nearly October 2021, and yes, we're still in The Mask Zone. With that in mind, we're always keeping an eye on the best masks of the season, since the ones we bought in spring 2020 are definitely ratty and ready to be replaced, and these multicolored KN95s reign supreme when it comes to mixing form and function. Sometimes we want plain black to go with our health goth sweats; other times, we're feeling navy or pink. That's what variety packs are all about—and a bunch of readers agreed. The clit tapper that just doesn't quit When Better Love's super popular Tap Dancer went on sale earlier this month, we rejoiced—and so did our readers with clitorises. After all, the Tap Dancer's powers are well-known; this of it as a snake charmer for crazy orgasms. It's still 33% off right now, if you're jonesin' for a sex toy described by its satisfied owners as \"just WOW!!!\" and \"genuinely the fastest toy that has ever made me cum, and by cum I mean this was a whole new experience.\" A super-psychedelic projector Ever been curious about what good psychedelics are like, but know that you wouldn't mesh well with actual drugs? The next best thing might be this LED party light projector, which comes with paint so that you can customize your trippy, color-drenched experience. \"Use it to make light painting photographs or as a night light, party light indoors in a dark or semi-dark room, or bring it with you into the woods or a garden party, it will totally add a plus to the event,\" the seller writes. If you're throwing parties in the woods with this thing, we want an invite, thanks! Prostate massagers for blowing your mind (and your load) Here at VICE, we want to service our readers—and what better way to help y'all out than by teaching you how to give yourselves and each other explosive prostate orgasms, y'know? So our guide has been a bit of a hit, and along with it, the top toy picks from experts when it comes to beautifully (and gently, of course) blasting your b-hole. The Aneros Helix Syn Trident and Njoy Pure Wand are considered best in class—and many, many happy customers sing their praises for good reason. The coffee alternative that the caffeine-sensitive crowd loves Looks like sludge, tastes like a delicious chia: MUD\\WTR is a big-time fan fave for those who can't do coffee but still want a morning pick-me-up, and it only seems to be growing in cult status month over month. As fun as it is to spend our days looking like that psychotic GIF of an overstimulated Sylvester the cat, a whole lot of us are ready to mix up our bev routine to be free of meltdowns, and MUD\\WTR is getting rave reviews all around for its super-tasty PSL-like flavor—and its ability to offer a panic-attack-free energy kick. See you at the finale of Spooky Season—then it's time for pie season [clicks heels].","author":"VICE US","url":"https://www.vice.com/en_us/article/5db7gz/what-vice-readers-bought-september-2021","link_type":"article","item_date":1633035514000,"item_id":"7c38051c","timestamp":1633540734743,"domain":"vice.com","item_date_formatted":"Sep 30, 8:58 pm","description_trimmed":"Happy Thursday, dear VICE reader, and welcome to autumn, the cinnamon-roll-and-nostalgia zone. This month, our readers seemed to be beyond ready to get cozy and deck out their homes with decorative gourds and spooky candelabras, and we couldn't agree more—let's book some leaf-gaz...","keywords":"Rec Room, Picnic Table, Vice Readers, Mask Zone"},{"title":"Horrific Accident Involving A Tesla; Driver’s Life Saved By The Vehicle","description":"Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a video and said that he was […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/09/30/horrific-accident-involving-a-tesla-drivers-life-saved-by-the-vehicle/","link_type":"article","item_date":1633039797000,"item_id":"2739674f","timestamp":1633540734890,"domain":"cleantechnica.com","item_date_formatted":"Sep 30, 10:09 pm","description_trimmed":"Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a vid...","keywords":"Life Saved, Car Saved, Incredibly Lucky"},{"title":"The cheap solar-powered car you might never need to charge [Video]","description":"Imagine a car that can charge using the sun, generate an income via a car-sharing scheme, and is also affordable to buy. Sounds like a pipe dream, right? Think again – say hello to Sono Motors’ Sion electric car.\n more…\nThe post The cheap solar-powered car you might never need to charge [Video] appeared first on Electrek.","author":"Electrek","url":"https://electrek.co/2021/09/30/the-cheap-solar-powered-car-you-might-never-need-to-charge-video/","link_type":"article","item_date":1633036009000,"item_id":"8c285b8c","timestamp":1633540734924,"domain":"electrek.co","item_date_formatted":"Sep 30, 9:06 pm","description_trimmed":"Imagine a car that can charge using the sun, generate an income via a car-sharing scheme, and is also affordable to buy. Sounds like a pipe dream, right? Think again – say hello to Sono Motors’ Sion electric car.\n more…\nThe post The cheap solar-powered car you might never need to...","keywords":"Charge Video, Sono Motors, Pipe Dream"},{"title":"What you should know about working with corporate venture investment committees","description":"Brian Walsh\n\t\t\t\t\t\tContributor\n\t\t\n\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\n\t\tShare on Twitter\n\t\t\t\n\t\t\t\t\n\t\t\n\t\t\t\n\n\t\t\n\t\tBrian Walsh is the head of WIND Ventures, the venture capital arm of COPEC, a leading energy company in Central and South America and the U.S. WIND Ventures provides mobility, energy and retail startups and scaleups with access to Latin America.\t\n\t\n\t\t\n\t\tMore posts by this contributor\n\t\t\n\t\t\t\t\t\tSPACs are the construct VCs need to fund clean tech\n\t\t\t\t\t\tLatin American startup deals see major drop in COVID-19 era\n\t\t\t\t\t\n\t\n\t\nWith global corporate-venture-capital-backed (CVC) funding reaching $79 billion across 2,099 deals in the first half of 2021, according to CB Insights, the chances are high that startups will find great opportunities with this growing investor set.\nEntrepreneurs, however, are likely to discover that the investment process can be different for CVCs compared to private venture capital firms. While both types of investment firms tend to make decisions via an investment committee (IC), private VCs (inclusive of VCs with corporate backers that have an independent LPA structure) make up their ICs with firm partners and/or other venture-minded people.\n\t\n\t\t\n\t\t\tAs CVCs become more active, entrepreneurs often don’t understand that the decision to invest, or not, doesn’t rest solely within a subgroup of the direct investment team or with venture-minded people. \t\t\t\t\t\n\t\n\t\nBut for CVCs investing off a corporate balance sheet, the IC can include corporate-minded people, such as the CEO or business unit leaders, who generally tend to be detached from the venture mindset and the requirements for operating in the VC world. As such, entrepreneurs will realize that a successful CVC investment decision tends to have different requirements compared to a private VC firm’s decision.\nSo what do entrepreneurs seeking investment need to know about this relatively new but powerful participant in the funding process? I’ll do my best to demystify the role of the CVC IC and shine a light on how entrepreneurs can navigate some of the hidden pitfalls while taking advantage of the opportunities.\nThe arbiters of investment\nWhile private VCs immerse themselves into the venture ecosystem, CVCs live in the middle of two very different worlds and mindsets: corporate and venture. The CVC must engage the venture ecosystem to attract deal flow while also driving opportunities that can be of strategic interest to the corporation.\nTo do this well, a CVC ideally should have a well-defined mandate and IC purpose statement — to deem investment opportunities as strategic, for example. A business unit leader or CEO who spends about an hour on a monthly IC session is nearly completely immersed within the corporate mindset while making a decision related to the venture world.","author":"TechCrunch","url":"https://techcrunch.com/2021/09/30/what-you-should-know-about-working-with-corporate-venture-investment-committees/","link_type":"article","item_date":1633043043000,"item_id":"f1015e07","timestamp":1633540734933,"domain":"techcrunch.com","item_date_formatted":"Sep 30, 11:04 pm","description_trimmed":"Brian Walsh\n\t\t\t\t\t\tContributor\n\t\t\n\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\n\t\tShare on Twitter\n\t\t\t\n\t\t\t\t\n\t\t\n\t\t\t\n\n\t\t\n\t\tBrian Walsh is the head of WIND Ventures, the venture capital arm of COPEC, a leading energy company in Central and South America and the U.S. WIND Ventures provides mobility, energy and ret...","keywords":"Wind Ventures, Venture Ecosystem, Venture Minded, Venture World"}]}