{"etag":"W/\"39ad1a991f696169c1583d464ee39e54\"","items":[{"title":"@CStyles45 @Tesla Pushed a week to align with 10.2","description":"@CStyles45 @Tesla Pushed a week to align with 10.2","author":"@elonmusk on Twitter","url":"https://twitter.com/elonmusk/status/1443892118745911309","link_type":"article","item_date":1633085681000,"tags":"","item_id":"fbc1c5c6","timestamp":1633374704176,"domain":"twitter.com","item_date_formatted":"Oct 1, 10:54 am"},{"title":"What VICE Readers Bought This Month: Massagers, Trippy Lights, and Fancy Earplugs","description":"Happy Thursday, dear VICE reader, and welcome to autumn, the cinnamon-roll-and-nostalgia zone. This month, our readers seemed to be beyond ready to get cozy and deck out their homes with decorative gourds and spooky candelabras, and we couldn't agree more—let's book some leaf-gazing weekend getaways and curl up with a weighted blanket, shall we? VICE-heads have massagin', masturbatin', and picking up new jackets, masks, and presents for the neighborhood squirrels, because you're all worth it!!!  So, what did we get into this month at Rec Room? Well, we started going to shows again, so we needed new masks and the best earplugs, and our friends started getting married again (gross) so we found the best unique gifts to give those losers who found true love. We found the coolest affordable fall basics, from flannels to beanies, and broke down TikTok's Y2K bedroom nostalgia and gorpcore, the streetwear look that's all about crunchy 90s North Face energy (need a fanny pack, or new hiking boots that won't make you look like a dorky uncle, anyone?). We explained what you need to try out pegging (why not?) and what mattresses can help with back pain if you're getting so freaky that you misalign that spine. We reviewed LELO's new vibrator, asked New York's coolest hair stylists what shampoo and conditioner we should be using for every hair type, started buying NFTs, tested out a bunch of anti-anxiety products, and found gifts for your Libra friends and e-bikes that won't make you look like you think Mark Zuckerberg is cool. Ugh, there's so much more, folks—but you'll have to pop over to Rec Room to see the rest. Here's what our faithful audience was most into this month, from the perfect denim coat to a trippy party light. An affordable sub for the cult-fave Theragun Back in late August, we reviewed the pricey but beloved Theragun line of massagers, and found that they're all pretty great. But since not everyone can drop several Benjamins on a super-charged body vibe, we found some affordable alternatives that also get the job done, like this $50 pick from Amazon. VICE readers are pickin' it up in spades, and loving it as much as the gazillion people on Amazon who have given it a five-star rating. Earplugs that protect your hearing without muffling the band We also reviewed Loop earplugs, which are designed to reduce noise levels without making you feel like you're under the sea. This is especially important when you're watching one of your favorite bands, of course—as our editor was when she tested them at a Turnstile show. The verdict: They're perfect for concert-going, and even look like cool Klingon jewelry while you're wearing them. The denim chore coat that we'll wear all through fall We recently did double duty on rounding up the best denim jackets for men and for women, because a) everyone should have a killer jean jacket and b) fall is the perfect time to wear it. The biggest hit with readers? Madewell's denim chore coat, which is equal parts retro and modern, functional and fly. A picnic table for squirrels, because y'all are crazy We love bringing you the best deals, and earlier this month, we came across this incredible invention that only highlights the ingenuity of mankind and the insane depths of Amazon. Yes, it is a picnic table for squirrels, complete with mirror and corn cob holder. Obviously, we all want one. The antiperspirant that all the super-sweatiest swear by We have some peeps on the team who are sweaty types, and so we know firsthand that a lot of \"deodorants\" don't do their jobs. But there is hope for those who are permanently glistening; as we break down in our list of the best men's deodorants, Certain Dri is considered the crème de la crème when it comes to antiperspirants that actually stop you from drippin'. More than 18,000 reviews on Amazon agree that this stuff is life-changing for the hyperhidrosis crowd. KN95 masks that don't make you look like all haz-mat It's nearly October 2021, and yes, we're still in The Mask Zone. With that in mind, we're always keeping an eye on the best masks of the season, since the ones we bought in spring 2020 are definitely ratty and ready to be replaced, and these multicolored KN95s reign supreme when it comes to mixing form and function. Sometimes we want plain black to go with our health goth sweats; other times, we're feeling navy or pink. That's what variety packs are all about—and a bunch of readers agreed. The clit tapper that just doesn't quit When Better Love's super popular Tap Dancer went on sale earlier this month, we rejoiced—and so did our readers with clitorises. After all, the Tap Dancer's powers are well-known; this of it as a snake charmer for crazy orgasms. It's still 33% off right now, if you're jonesin' for a sex toy described by its satisfied owners as \"just WOW!!!\" and \"genuinely the fastest toy that has ever made me cum, and by cum I mean this was a whole new experience.\" A super-psychedelic projector Ever been curious about what good psychedelics are like, but know that you wouldn't mesh well with actual drugs? The next best thing might be this LED party light projector, which comes with paint so that you can customize your trippy, color-drenched experience. \"Use it to make light painting photographs or as a night light, party light indoors in a dark or semi-dark room, or bring it with you into the woods or a garden party, it will totally add a plus to the event,\" the seller writes. If you're throwing parties in the woods with this thing, we want an invite, thanks! Prostate massagers for blowing your mind (and your load) Here at VICE, we want to service our readers—and what better way to help y'all out than by teaching you how to give yourselves and each other explosive prostate orgasms, y'know? So our guide has been a bit of a hit, and along with it, the top toy picks from experts when it comes to beautifully (and gently, of course) blasting your b-hole. The Aneros Helix Syn Trident and Njoy Pure Wand are considered best in class—and many, many happy customers sing their praises for good reason. The coffee alternative that the caffeine-sensitive crowd loves Looks like sludge, tastes like a delicious chia: MUD\\WTR is a big-time fan fave for those who can't do coffee but still want a morning pick-me-up, and it only seems to be growing in cult status month over month. As fun as it is to spend our days looking like that psychotic GIF of an overstimulated Sylvester the cat, a whole lot of us are ready to mix up our bev routine to be free of meltdowns, and MUD\\WTR is getting rave reviews all around for its super-tasty PSL-like flavor—and its ability to offer a panic-attack-free energy kick. See you at the finale of Spooky Season—then it's time for pie season [clicks heels].","author":"VICE US","url":"https://www.vice.com/en_us/article/5db7gz/what-vice-readers-bought-september-2021","link_type":"article","item_date":1633035514000,"tags":"","item_id":"b7ad650c","timestamp":1633374704208,"domain":"vice.com","item_date_formatted":"Sep 30, 8:58 pm"},{"title":"Horrific Accident Involving A Tesla; Driver’s Life Saved By The Vehicle","description":"Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a video and said that he was […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/09/30/horrific-accident-involving-a-tesla-drivers-life-saved-by-the-vehicle/","link_type":"article","item_date":1633039797000,"tags":"","item_id":"5b866a10","timestamp":1633374704233,"domain":"cleantechnica.com","item_date_formatted":"Sep 30, 10:09 pm"},{"title":"The cheap solar-powered car you might never need to charge [Video]","description":"\nImagine a car that can charge using the sun, generate an income via a car-sharing scheme, and is also affordable to buy. Sounds like a pipe dream, right? Think again – say hello to Sono Motors’ Sion electric car.\n more…\nThe post The cheap solar-powered car you might never need to charge [Video] appeared first on Electrek.\n","author":"Electrek","url":"https://electrek.co/2021/09/30/the-cheap-solar-powered-car-you-might-never-need-to-charge-video/","link_type":"article","item_date":1633036009000,"tags":"","item_id":"1a6bbc11","timestamp":1633374704234,"domain":"electrek.co","item_date_formatted":"Sep 30, 9:06 pm"},{"title":"What you should know about working with corporate venture investment committees","description":"\n\n\t\n\t\t\n\t\t\t\t\t\t\tBrian Walsh\n\t\t\t\t\t\tContributor\n\t\t\n\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\n\t\tShare on Twitter\n\t\t\t\n\t\t\t\t\n\t\t\n\t\t\t\n\n\t\t\n\t\tBrian Walsh is the head of WIND Ventures, the venture capital arm of COPEC, a leading energy company in Central and South America and the U.S. WIND Ventures provides mobility, energy and retail startups and scaleups with access to Latin America.\t\n\t\n\t\t\n\t\tMore posts by this contributor\n\t\t\n\t\t\t\t\t\tSPACs are the construct VCs need to fund clean tech\n\t\t\t\t\t\tLatin American startup deals see major drop in COVID-19 era\n\t\t\t\t\t\n\t\n\t\nWith global corporate-venture-capital-backed (CVC) funding reaching $79 billion across 2,099 deals in the first half of 2021, according to CB Insights, the chances are high that startups will find great opportunities with this growing investor set.\nEntrepreneurs, however, are likely to discover that the investment process can be different for CVCs compared to private venture capital firms. While both types of investment firms tend to make decisions via an investment committee (IC), private VCs (inclusive of VCs with corporate backers that have an independent LPA structure) make up their ICs with firm partners and/or other venture-minded people.\n\t\n\t\t\n\t\t\tAs CVCs become more active, entrepreneurs often don’t understand that the decision to invest, or not, doesn’t rest solely within a subgroup of the direct investment team or with venture-minded people. \t\t\t\t\t\n\t\n\t\nBut for CVCs investing off a corporate balance sheet, the IC can include corporate-minded people, such as the CEO or business unit leaders, who generally tend to be detached from the venture mindset and the requirements for operating in the VC world. As such, entrepreneurs will realize that a successful CVC investment decision tends to have different requirements compared to a private VC firm’s decision.\nSo what do entrepreneurs seeking investment need to know about this relatively new but powerful participant in the funding process? I’ll do my best to demystify the role of the CVC IC and shine a light on how entrepreneurs can navigate some of the hidden pitfalls while taking advantage of the opportunities.\nThe arbiters of investment\nWhile private VCs immerse themselves into the venture ecosystem, CVCs live in the middle of two very different worlds and mindsets: corporate and venture. The CVC must engage the venture ecosystem to attract deal flow while also driving opportunities that can be of strategic interest to the corporation.\nTo do this well, a CVC ideally should have a well-defined mandate and IC purpose statement — to deem investment opportunities as strategic, for example. A business unit leader or CEO who spends about an hour on a monthly IC session is nearly completely immersed within the corporate mindset while making a decision related to the venture world.\n","author":"TechCrunch","url":"https://techcrunch.com/2021/09/30/what-you-should-know-about-working-with-corporate-venture-investment-committees/","link_type":"article","item_date":1633043043000,"tags":"","item_id":"32ed49ab","timestamp":1633374704234,"domain":"techcrunch.com","item_date_formatted":"Sep 30, 11:04 pm"}]}