{"etag":"W/\"39ad1a991f696169c1583d464ee39e54\"","items":[{"title":"German EV Rental Car Company Makes Tesla Its Only Brand","description":"ElektroHub, a German battery electric vehicle company that once offered a variety of EVs for rent, is changing its selection to only renting out Tesla vehicles. Alex Voigt shared a video on Twitter about this and added that this is why he sharply criticizes auto manufacturers for offering battery electric vehicles (BEVs) that are not […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/10/07/german-ev-rental-car-company-makes-tesla-its-only-brand/","link_type":"article","item_date":1633618854000,"item_id":"667b5c4d","timestamp":1633629438636,"domain":"cleantechnica.com","item_date_formatted":"Oct 7, 3:00 pm","description_trimmed":"ElektroHub, a German battery electric vehicle company that once offered a variety of EVs for rent, is changing its selection to only renting out Tesla vehicles. Alex Voigt shared a video on Twitter about this and added that this is why he sharply criticizes auto manufacturers for...","keywords":"Tesla Vehicles"},{"title":"Tesla becomes last EV standing after car rental company purges its BEV fleet","description":"The electric vehicle market is getting more crowded, with more and more electric cars being released every year. This was particularly true for Miete Deinen Tesla, a German electric vehicle rental company that expanded its operations by purchasing more EVs from other automakers. In a recent announcement, the BEV rental company noted that it is purging its EV fleet save for its Teslas since the ownership experience of other electric cars is a bit lacking, at least for now. \n\n\n\nThe car rental company outlined its decision in a recent video, which was uploaded on its YouTube channel. In the video, the company noted that it is actually very sad to see some of its EVs go, especially the Porsche Taycan 4S, an otherwise stunning electric car that is bogged down by its charging infrastructure. Other electric cars that the company bought from manufacturers like Volkswagen and Hyundai also presented their own fair share of challenges — challenges which do not make them as good as Teslas for business. \n\n\n\n\n\nGerman BEV rental company abandons all BEVs after 2.5 years of experience, except Tesla because IDs, Enyaq, Taycan, Kona, Ioniq had a lot of problems with software, charging and repairsThey didn't get cars other BEVs bc they talk positively about Teslahttps://t.co/gijilIWwU7— Alex (@alex_avoigt) October 6, 2021\n\n\n\n\n\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\nMiete Deinen Tesla mentioned some of the issues that they experienced over the time they operated with a fleet of EVs from different automakers. According to the company, issues that were prevalent with non-Tesla electric cars included software, charging, and repair, to name a few. For example, Volkswagen’s ID series are yet to have over-the-air software update capabilities, which means that owners typically have to go to dealers just to update their vehicles. \n\n\n\nThe BEV rental company noted that it would continue to support the electric vehicle movement by featuring non-Tesla electric cars in its YouTube channel on a regular basis. But for its actual business, the car rental company would be focusing on a Tesla-only fleet for now. This is quite understandable considering that Tesla’s electric vehicles are very well rounded, and their rapid charging infrastructure makes them ideal alternatives to fossil fuel-powered cars. \n\n\n\nIf there are any lessons that could be learned from the experience of the German electric vehicle rental company, it is that the ownership experience of EVs matters a lot. Electric cars may be stunning and their capabilities as a vehicle per se may be impressive, but without the necessary ecosystem, the ownership experience could easily get bogged down. Fortunately, this is something that Tesla particularly excels at, despite the company’s areas of improvement when it comes to service and repair. \n\n\n\nTesla’s mastery of over-the-air updates is also a key advantage, as it allows the company to address minor issues and even add features from time to time by a software update that’s not unlike those utilized by smartphone-makers like Apple. \n\n\n\n\n\n\n\n\n\nDon’t hesitate to contact us with news tips. Just send a message to tips@teslarati.com to give us a heads up. \nThe post Tesla becomes last EV standing after car rental company purges its BEV fleet appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-last-ev-standing-germany/","link_type":"article","item_date":1633614587000,"item_id":"fb97da4f","timestamp":1633629438737,"domain":"teslarati.com","item_date_formatted":"Oct 7, 1:49 pm","description_trimmed":"The electric vehicle market is getting more crowded, with more and more electric cars being released every year. This was particularly true for Miete Deinen Tesla, a German electric vehicle rental company that expanded its operations by purchasing more EVs from other automakers. ...","keywords":"Electric Cars, Ownership Experience, Ev Standing, Youtube Channel"},{"title":"FSD Beta 10.2 rolls out Friday midnight to ~1000 owners with perfect 100/100 safety scores. \n\nRollouts will hold for several day...","description":"FSD Beta 10.2 rolls out Friday midnight to ~1000 owners with perfect 100/100 safety scores. \n\nRollouts will hold for several days after that to see how it goes. \n\nIf that looks good, beta will gradually begin rolling out to 99 scores &amp; below.","author":"@elonmusk on Twitter","url":"https://twitter.com/elonmusk/status/1446104772092772352","link_type":"article","item_date":1633613219000,"item_id":"efecc3a2","timestamp":1633629438953,"domain":"twitter.com","item_date_formatted":"Oct 7, 1:26 pm","description_trimmed":"FSD Beta 10.2 rolls out Friday midnight to ~1000 owners with perfect 100/100 safety scores. \n\nRollouts will hold for several days after that to see how it goes. \n\nIf that looks good, beta will gradually begin rolling out to 99 scores &amp; below.","keywords":"Fsd Beta, Safety Scores, Friday Midnight"},{"title":"GM Needs to Walk the Tesla Talk","description":"The company painted a wildly ambitious picture of growth at its much-anticipated 2021 investor conference. What investors really need from the company, though, isn’t more talk.","author":"WSJ.com: WSJD","url":"https://www.wsj.com/articles/gm-needs-to-walk-the-tesla-talk-11633609360?mod=rss_Technology","link_type":"article","item_date":1633609320000,"item_id":"5e3619fe","timestamp":1633629438624,"domain":"wsj.com","item_date_formatted":"Oct 7, 12:22 pm","description_trimmed":"The company painted a wildly ambitious picture of growth at its much-anticipated 2021 investor conference. What investors really need from the company, though, isn’t more talk.","keywords":"Tesla Talk, Investor Conference, Company Painted"},{"title":"Tesla raises Model 3 and Model Y base prices by $2,000","description":"Tesla has raised the base prices of the Model 3 and Model Y by $2,000, the latest in a series of price changes this year. First spotted by Electrek, Tesla's online configurator now shows the price of the base rear-wheel drive Model 3 Standard Range Plus as $41,990 instead of the previous $39,990. The starting price of the Model 3 Performance also...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133799_tesla-raises-model-3-and-model-y-base-prices-by-2-000","link_type":"article","item_date":1633608000000,"item_id":"6de09087","timestamp":1633629438951,"domain":"greencarreports.com","item_date_formatted":"Oct 7, 12:00 pm","description_trimmed":"Tesla has raised the base prices of the Model 3 and Model Y by $2,000, the latest in a series of price changes this year. First spotted by Electrek, Tesla's online configurator now shows the price of the base rear-wheel drive Model 3 Standard Range Plus as $41,990 instead of the ...","keywords":"Base Prices, Starting Price, Drive Model"},{"title":"Tesla shareholders will vote today on whether to kick Elon Musk's brother off the company's board","description":"Elon Musk's brother Kimbal Musk.\nAxelle/Bauer-Griffin/FilmMagic\n\n\nTesla is holding its annual shareholder meeting on Thursday.\nShareholders will vote on the future of Kimbal Musk and James Murdoch on the company's board.\nAdvisory firm ISS has urged shareholders to oust the pair, saying Tesla board members are overpaid.\n\nSee more stories on Insider's business page.\nTesla shareholders are due to vote Thursday on whether to oust James Murdoch and Kimbal Musk, the brother of CEO Elon Musk, from the company's board. The vote on the pair's possible reelection will take place at Tesla's annual shareholder meeting on Thursday, which it will host at its factory in Austin, Texas.Shareholder proxy advisor Institutional Shareholder Services (ISS) wrote to clients on September 24 saying Tesla's board members were overpaid compared to board members at similar companies, Bloomberg reported at the time.Murdoch, son of media mogul Rupert Murdoch, received $32,500 for serving on Tesla's board last year, and Kimbal Musk received $20,000, per a Tesla Securities and Exchange Commission (SEC) filing.Other directors make much more money, but Murdoch and Musk are the only members up for reelection this year. ISS said they should be denied the chance to continue serving, The New York Times reported. Chair of the board Robyn Denholm was paid $5.7 million last year and board member Hiromichi Mizuno was paid $9 million. Both Denholm and Mizuno were paid largely in stock options. ISS made a similar recommendation to investors in 2018 to oust Murdoch and now-outgoing director Antonio Gracias.Separately, a proposal from Morgan Stanley-owned Calvert Research and Management that is due to be voted on calls for more transparency on Tesla's diversity and inclusion efforts, SEC filings show.Nia Impact Capital, a small shareholder, also submitted a proposal that would force Tesla to publish a report on its inclusion of mandatory arbitration in employee contracts, the filings show. Mandatory arbitration means employees can't bring disputes to court.On Monday, Tesla was ordered to pay former elevator operator Owen Diaz $137 million after he filed a racial harassment lawsuit against the company.Attorneys for Diaz, who was a contractor and not directly employed by Tesla, told CNBC he was only able to bring the case because he had not signed an arbitration agreement.Another proposal submitted by shareholder Sisters of the Good Shepherd would force Tesla to commission an independent third-party report on whether it's ensuring there are no human rights abuses in its supply chain.In an SEC filing, Tesla urged investors to reelect Musk and Murdoch. It also urged investors to vote against the proposals from Calvert Research and Management, Nia Impact Capital, and Sisters of the Good Shepherd in an SEC filing. Read the original article on Business Insider","author":"All Content from Business Insider","url":"https://www.businessinsider.com/activist-tesla-investors-try-to-oust-kimbal-musk-2021-10","link_type":"article","item_date":1633606419000,"item_id":"fb2595df","timestamp":1633629438534,"domain":"businessinsider.com","item_date_formatted":"Oct 7, 11:33 am","description_trimmed":"Elon Musk's brother Kimbal Musk.\nAxelle/Bauer-Griffin/FilmMagic\n\n\nTesla is holding its annual shareholder meeting on Thursday.\nShareholders will vote on the future of Kimbal Musk and James Murdoch on the company's board.\nAdvisory firm ISS has urged shareholders to oust the pair, ...","keywords":"Kimbal Musk, Force Tesla, Tesla Shareholders, Sec Filing"},{"title":"HOURS AGO! GM Wants To Overtake Tesla as EV Leader With New $30,000 EV","description":"https://www.youtube.com/watch?v=_OdLh_wvBP8","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=_OdLh_wvBP8","link_type":"article","item_date":1633577787000,"item_id":"9a5841c7","timestamp":1633629438849,"domain":"youtube.com","item_date_formatted":"Oct 7, 3:36 am","description_trimmed":"https://www.youtube.com/watch?v=_OdLh_wvBP8","keywords":"Ev Leader"},{"title":"Elon Musk confirms Tesla’s $1.4 billion loan for Giga Shanghai was paid off early","description":"Tesla CEO Elon Musk confirmed on Twitter several days ago that the company’s $1.4 billion loan for its Gigafactory Shanghai facility in China was paid off.\nOn October 4, 2021, @jpr007, a Tesla enthusiast on Twitter, showed documentation that Tesla had officially paid off its entire $1.4 billion loan, which was granted from Chinese banks, in just sixteen months. The loan was announced in December 2019, and appeared to have no balance as of Tesla’s Q2 2021 financial documentation. Musk later confirmed the story by stating, “Tesla always pays its debts.” His statement was a response to a CleanTechnica article.\n\nTesla always pays its debts\n— Elon Musk (@elonmusk) October 5, 2021\n\n\nJPR stated that the $1.4 billion loan was paid off in just 16 months, as the terms of the loan had a five-year, or sixty month, pay-off period. This would entail that Tesla paid off the tremendous loan massively early, and it appears that the entire balance was paid with profits from the Shanghai factory. The loan was provided by several banks, including China Construction Bank, Agricultural Bank of China, Industrial and Commercial Bank of China, and Shanghai Pudong Development Bank, according to a report from Reuters.\nTesla has a reputation for paying back its federal loans, whether from the United States government or a foreign entity, rather quickly and well ahead of schedule. In May 2013, Tesla, then Tesla Motors, announced that it had paid off a massive loan from the U.S. Department of Energy, sending its final wire on May 22 worth $451.8 million. Tesla paid the loan back nine years early.\nIf speculation is correct and Tesla utilized only profits from the Shanghai factory to pay back the $1.4 billion loan from Chinese banks, this was likely fueled by the widened gross margins Tesla was receiving from its vehicle sales. Tesla has become a mainstay in the Chinese electric vehicle market, being one of the top manufacturers in the region in terms of sales figures. Additionally, the company was rumored to have a 39% gross margin on its China-built Model 3, and 29.4% on the Model Y. The increased gross margin came from increased vertical integration and manufacturing efficiencies which made Tesla’s vehicles easier and more affordable to produce.\nPaying back loans early is a great look for the electric automaker, as Tesla is utilizing strategic financial strategies to eliminate its debts while also increasing profitability. Tesla has already accumulated eight consecutive quarters of profitability, dating back to Q3 2019.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Elon Musk confirms Tesla’s $1.4 billion loan for Giga Shanghai was paid off early appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-giga-shanghai-loan-paid-off-elon-musk/","link_type":"article","item_date":1633539592000,"item_id":"11bf2b7a","timestamp":1633629438639,"domain":"teslarati.com","item_date_formatted":"Oct 6, 4:59 pm","description_trimmed":"Tesla CEO Elon Musk confirmed on Twitter several days ago that the company’s $1.4 billion loan for its Gigafactory Shanghai facility in China was paid off.\nOn October 4, 2021, @jpr007, a Tesla enthusiast on Twitter, showed documentation that Tesla had officially paid off its enti...","keywords":"Billion Loan, Tesla Paid, Shanghai Factory, Giga Shanghai"},{"title":"Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000","description":"Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000","author":"TeslaTracker Submissions","url":"https://electrek.co/2021/10/06/tesla-increases-mod","link_type":"article","item_date":1633537742000,"item_id":"125a6d30","timestamp":1633629438954,"domain":"electrek.co","item_date_formatted":"Oct 6, 4:29 pm","description_trimmed":"Tesla increases Model 3 and Model Y prices, cheapest car is now $42,000","keywords":"Cheapest Car"},{"title":"Federal Court Orders Tesla To Pay $137 Million To Former Black Employee Over Racism","description":"https://www.youtube.com/watch?v=lJyUF5ZoOdk","author":"Tesla - YouTube","url":"https://www.youtube.com/watch?v=lJyUF5ZoOdk","link_type":"article","item_date":1633532268000,"item_id":"3ab2d20f","timestamp":1633629438442,"domain":"youtube.com","item_date_formatted":"Oct 6, 2:57 pm","description_trimmed":"https://www.youtube.com/watch?v=lJyUF5ZoOdk","keywords":""},{"title":"Report: Tesla is alleging theft of battery trade secrets by Rivian","description":"Tesla is continuing its trade secrets fight with Rivian, alleging that the electric-truck hopeful poached employees and stole \"highly proprietary\" battery technology, according to a Bloomberg report. The Silicon Valley firm filed a lawsuit against Rivian 14 months ago, but claims the company has continued poaching its staff, and using them to...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133767_report-tesla-is-alleging-theft-of-battery-trade-secrets-by-rivian","link_type":"article","item_date":1633521600000,"item_id":"29bc6d8a","timestamp":1633629438938,"domain":"greencarreports.com","item_date_formatted":"Oct 6, 12:00 pm","description_trimmed":"Tesla is continuing its trade secrets fight with Rivian, alleging that the electric-truck hopeful poached employees and stole \"highly proprietary\" battery technology, according to a Bloomberg report. The Silicon Valley firm filed a lawsuit against Rivian 14 months ago, but claims...","keywords":"Rivian Tesla, Continued Poaching, Bloomberg Report"},{"title":"Lidar developer Ouster agrees to buy Sense Photonics as it takes aim at the auto industry","description":"Ouster, a lidar company that went public this year via a SPAC merger, said it would acquire solid-state lidar startup Sense Photonics in an all-stock deal that was valued at around $68 million at close of markets on Monday.\nOnce the acquisition is complete, Ouster said it would establish a new business arm, Ouster Automotive, which will be headed by Sense CEO Shauna McIntyre. That business will integrate Sense’s 200-meter range solid-state lidar into a new lidar suite. San Francisco-based Sense’s claim to fame is also its improved field of view, as TechCrunch’s Devin Coldewey explained.\n\nSense Photonics flashes onto the lidar scene with a new approach and $26M\n\n\nAccording to a news statement, Ouster Automotive will also aim to advance negotiations with five automotive OEMs, though additional details about these potential deals were not provided. Should they turn into something solid, production would begin in 2025 or 2026.\nLidar is a key sensor in most autonomous driving stacks. The sensor, whose name is a shortened form of “light detection and ranging,” measures distance using lasers to generate a 3D map of the world. Along with radar, cameras and software, lidar is a critical part of the AV systems of some of the leading developers today, including companies like Waymo and Argo AI.\nIn February, Ouster CEO Angus Pacala said on the podcast “Shift” that the future of the lidar industry would be marked by consolidation. “There’s going to be three to five lidar companies within the next five years,” he said. This new acquisition is a mark that Ouster will be at the forefront of turning this prediction into a reality.\nEarlier this year, Ouster completed a merger with a blank-check firm in a deal valued at $1.9 billion. It joined rival lidar companies Luminar, Innoviz and Velodyne in taking the SPAC route to the public market. Ouster’s stock hit a year-to-date trading high of $15.39 in February; today, it’s trading for $7.41.\nUpdate: A spokesperson for Ouster confirmed to TechCrunch that the company expects the majority of Sense’s 80 employees to join McIntyre in joining Ouster.\nThe spokesperson added, “Ouster’s perspective has always been that auto OEMs want a multi-sensor suite of solid-state lidar, long to short-range, that can be manufactured at scale and integrated into the body of the vehicle for the low hundreds of dollars. That’s exactly what we’re planning to offer.”","author":"TechCrunch","url":"https://techcrunch.com/2021/10/05/lidar-developer-ouster-agrees-to-buy-sense-photonics-as-it-takes-aim-at-the-auto-industry/","link_type":"article","item_date":1633451213000,"item_id":"69f83358","timestamp":1633629439022,"domain":"techcrunch.com","item_date_formatted":"Oct 5, 4:26 pm","description_trimmed":"Ouster, a lidar company that went public this year via a SPAC merger, said it would acquire solid-state lidar startup Sense Photonics in an all-stock deal that was valued at around $68 million at close of markets on Monday.\nOnce the acquisition is complete, Ouster said it would e...","keywords":"Ouster Automotive, Lidar Company, Lidar Companies, Lidar Suite"},{"title":"Lucid Air driven, Jeep Grand Cherokee 4xe, GM battery innovation: Today’s Car News","description":"GM is focusing in on the batteries as the key to achieving a longer range and to lower costs. The Jeep Grand Cherokee plug-in hybrid will tow and go off-roading. And we drive the Lucid Air. This and more, here at Green Car Reports. The 2022 Lucid Air is already beating top numbers from Tesla in range and charging. But as we found in a very brief...","author":"Green Car Reports","url":"https://www.greencarreports.com/news/1133778_lucid-air-driven-jeep-grand-cherokee-4xe-gm-battery-innovation-today-s-car-news","link_type":"article","item_date":1633449300000,"item_id":"6ccd2c11","timestamp":1633629439018,"domain":"greencarreports.com","item_date_formatted":"Oct 5, 3:55 pm","description_trimmed":"GM is focusing in on the batteries as the key to achieving a longer range and to lower costs. The Jeep Grand Cherokee plug-in hybrid will tow and go off-roading. And we drive the Lucid Air. This and more, here at Green Car Reports. The 2022 Lucid Air is already beating top number...","keywords":"Lucid Air, Longer Range"},{"title":"Tekion, the automotive retail platform headed by a former Tesla CIO, just tripled in value","description":"A year ago, we told you about the opportunity that former Tesla CIO Jay Vijayan was chasing. His plan? To pull car dealers into the 21st century with a snazzy end-to-end automative SaaS platform like the one he helped develop inside Tesla. Customers could use it to order a car to their precise specifications; dealers could use it to see in real time to understand their inventory and seamlessly check in customers for service appointment; OEMs could use it to see exactly which of their parts were where, relative to said dealerships.\nThe list of ways the software would produce savings and improve efficiencies for both dealers and OEMs went on and on, as Vijayan explained it. Apparently, his Pleasanton, Calif., company, Tekion, is gaining meaningful traction, too.\nAccording to Vijayan, the company’s revenue has grown threefold over the last year; the number of states where dealers are using Tekion’s software has grown to 39 from 28; and the company just began working with its first dealership in Canada as part of a plan to become an international outfit.\nAccordingly, the company is today announcing $250 million in Series D financing that bumps its valuation a year ago from $1 billion to $3.5 billion today, and its total funding from $185 million to $435 million. Alkeon Capital and Durable Capital co-led the round. Other investors include Hyundai Motor Company, several dealer groups across the U.S., and earlier backers Advent International, Index Ventures and FM Capital.\nInterestingly, the global chip shortage and other parts-supply disruptions that drove down new vehicles sales down a whopping 26% last month, is only having a positive impact on Tekion, and a recent piece in Morning Brew suggests why.\n\nThis former Tesla CIO just raised $150 million more to pull car dealers into the 21st century\n\n\nWhen the outlet talked with the president of an automotive group in Columbus, Ohio, he said that because inventory is scarce, a sale that would have taken four hours to make before the chip shortage now closes in 52 minutes. That scarcity is also driving profits through the roof, with buyers paying more for both new and used inventory, and auto retailers benefiting from lower operating costs with less inventory. (A dealership in Fort Lauderdale, Fla., tells Morning Brew that its profits jumped 197% in Q1 2021 compared to Q1 2020.)\nCourtesy of tech from Tekion and some of its legacy competitors, retailers are presumably also able to operate faster when it comes to servicing the consumers who are waiting out the shortage and hoping to make their cars last longer.\n“The supply is less but the demand is strong, so everyone is making a lot of money,” Vijayan tells TechCrunch. “The dealers, the OEMs — they’re making a good amount of margin.”\nTekion, Vijayan adds, has been “very strong through that growth,” but he anticipates that next year will be even better when he foresees that inventory will begin to catch up to demand.\n\nFord expects semiconductor rebound, new vehicle demand to increase 2021 profits\n\n\n“I believe sometime next year there will be some level of correction in the market and that our technology platform will help both dealers and OEMs navigate the correction much more smoothly because it will continue to learn and evolve to provide insights on where they should focus their business.”\nIn the meantime, the growth of Tekion — whose operations are split between California and Bangalore, India —  appears to largely organic. Though the automotive world is known for spending lavishly on marketing and for aggressive sales tactics, just 17 of Tekion’s employees now 1,350 employees work in sales. “We don’t spend any money in marketing, or it’s very negligible. [We’re growing through] word of mouth,” Vijayan says.\nA deal struck back in March with General Motors — which is an early investor in Tekion, as is BMW and the Nissan-Renault-Mitsubishi Alliance — is also surely helping. Though it’s up to each franchise to opt in or out, GM dealers broadly are beginning to use Tekion’s white-labeled dealer management software to make it easier for customers to purchase an Chevy, Cadillac, Buick or GMC brand electric vehicle.\nThe platform reportedly operates similar to  GM’s existing Shop. Click. Drive. program, which allows users to search for certain GM vehicles at dealerships near them and complete a portion of the transaction online. It’s a lot better, though. So said one Chevrolet VP in conversation earlier this year with Automotive News, who described Tekion’s software as akin to GM’s internal program “on steroids.”","author":"TechCrunch","url":"https://techcrunch.com/2021/10/05/tekion-the-automotive-retail-platform-headed-by-a-former-tesla-cio-just-tripled-in-value/","link_type":"article","item_date":1633448671000,"item_id":"891760f9","timestamp":1633629438336,"domain":"techcrunch.com","item_date_formatted":"Oct 5, 3:44 pm","description_trimmed":"A year ago, we told you about the opportunity that former Tesla CIO Jay Vijayan was chasing. His plan? To pull car dealers into the 21st century with a snazzy end-to-end automative SaaS platform like the one he helped develop inside Tesla. Customers could use it to order a car to...","keywords":"Year Ago, Tesla Cio, Dealer Groups, Chip Shortage"},{"title":"Regarding Today’s Jury Verdict","description":"*Sharing this recent note to employees from Valerie Capers Workman, VP People:\nHi Team,\nEarlier today, a jury in San Francisco decided that in late 2015 and early 2016 Tesla failed to make sure that one contract employee (Owen Diaz) was not racially harassed while he worked at the Tesla Fremont factory.  I heard the testimony of every witness. I was at the defense table for Tesla every day during the trial because I wanted to hear firsthand what Mr. Diaz said happened to him.","author":"News | Tesla","url":"https://www.tesla.com/blog/regarding-todays-jury-verdict","link_type":"article","item_date":1633401872000,"item_id":"137d8633","timestamp":1633629438936,"domain":"tesla.com","item_date_formatted":"Oct 5, 2:44 am","description_trimmed":"*Sharing this recent note to employees from Valerie Capers Workman, VP People:\nHi Team,\nEarlier today, a jury in San Francisco decided that in late 2015 and early 2016 Tesla failed to make sure that one contract employee (Owen Diaz) was not racially harassed while he worked at th...","keywords":"Tesla Failed, Earlier Today, Vp People, Recent Note"},{"title":"Tesla short-sellers are becoming a rare breed, market analysis shows","description":"Tesla (NASDAQ: TSLA) short-sellers are becoming a rare breed, new data from IHS Markit Ltd., a London-based information company, shows.\nFor years, Tesla has been among the most shorted stocks on Wall Street. In the past, the company has had vocal critics like David Einhorn, Jim Chanos, Michael Burry, and others. However, $TSLA stock’s incredible run-up over the past two years has caused many of these short sellers to abandon their positions.\n\n\n\nTesla Showroom in Century City, California\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWhile Chanos essentially admitted defeat in an interview this year where he told CEO Elon Musk that he had done a great job, others have remained relatively vocal regarding their positions on Tesla stock. It seems many short sellers have followed in Chanos’ footsteps, as the data shows short levels are at their lowest since 2010 when Tesla went public at $13 per share.\nBloomberg stated in their report of the short interest that just 1.1% of available Tesla shares are borrowed by traders, which is a standard measure of short interest. This is based on IHS Markit’s data as of Thursday, September 30. S3 Partners, another data company that competes with IHS, indicated that their short interest calculations for Tesla stock came in at a slightly higher 3.2%. This is still the lowest-ever recorded short-interest percentage metric that S3 has ever captured for Tesla stock. S3 spokesperson Ihor Dusaniwsky stated that shares shorted decreased by 1.55 million shares last month.\nShort interest in Tesla hit record lows in December 2020, when many of the company’s skeptics began to abandon negative positions. At the tail end of last year, Tesla short-sellers suffered an estimated $28.5 billion in losses. Short interest had fallen to 31.4 million in December, as, just eleven months earlier in January 2020, it was at its peak of 93.6 million. 2020, despite being such a challenging year for so many entities, was perhaps Tesla’s most incredible year. It was without a doubt if you go off of stock price alone, which surged over 700% last year.\n2021 did not get off to a good start for shorts, either. Some reports had indicated that Tesla short-sellers had lost over $1 billion within the first five days of trading in 2021. In 2020, Tesla shorts felt $38 billion in losses alone.\nIf history is any indication of what short sellers will feel this year, it could be the reason for such decreased bets against Tesla. The company is coming off of its most successful quarter in history, as it reported 241,300 vehicle deliveries in Q3, with production coming in slightly lower. Both figures were the best in Tesla’s short but storied history, and the company is now within striking distance of attaining one million vehicle deliveries for the year if it can ramp Giga Texas and Giga Berlin production early in Q4.\nAt the time of writing, Tesla shares were up 1%, trading at $782.59.\nDisclosure: Joey Klender is a TSLA Shareholder.\nDon’t hesitate to contact us with tips! Email us at tips@teslarati.com, or you can email me directly at joey@teslarati.com.\nThe post Tesla short-sellers are becoming a rare breed, market analysis shows appeared first on TESLARATI.","author":"TESLARATI","url":"https://www.teslarati.com/tesla-short-sellers-interest-decrease-2021/","link_type":"article","item_date":1633377567000,"item_id":"0be7ec60","timestamp":1633629438212,"domain":"teslarati.com","item_date_formatted":"Oct 4, 7:59 pm","description_trimmed":"Tesla (NASDAQ: TSLA) short-sellers are becoming a rare breed, new data from IHS Markit Ltd., a London-based information company, shows.\nFor years, Tesla has been among the most shorted stocks on Wall Street. In the past, the company has had vocal critics like David Einhorn, Jim C...","keywords":"Short Interest, Rare Breed, Short Sellers, Tesla Stock"},{"title":"Horrific Accident Involving A Tesla; Driver’s Life Saved By The Vehicle","description":"Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a video and said that he was […]","author":"CleanTechnica","url":"https://cleantechnica.com/2021/09/30/horrific-accident-involving-a-tesla-drivers-life-saved-by-the-vehicle/","link_type":"article","item_date":1633039797000,"item_id":"c2ed6ec5","timestamp":1633629439032,"domain":"cleantechnica.com","item_date_formatted":"Sep 30, 10:09 pm","description_trimmed":"Twitter user Paul Taylor, @Quattro091275, shared photos yesterday of an accident he was in yesterday in his Tesla. He said that the car saved his life and that it is literally a life-saving vehicle. Looking at the photos, Paul is incredibly lucky to be alive. He also shared a vid...","keywords":"Life Saved, Car Saved, Incredibly Lucky"}]}